[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n12-16-1993\r\nClemson Commencement Program, December\r\n1993\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, December 1993\" (1993). Clemson Commencement Programs. 127.\r\nhttps://tigerprints.clemson.edu/comm_programs/127"
    },
    {
        "page_number": "2",
        "text": "CLEMSON UNIVERSITY \r\nGraduation Exercises \r\nDecember 16, 1993 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "Congratulatory Applause You are requested to refrain from loud \r\nexpressions of pleasure for individual graduates. Such expressions \r\nfrequently detract from the recognition due the next graduate in line. \r\nYour cooperation is respectfully but urgently requested. \r\nFirst Aid For your convenience, a First Aid station is located at \r\nPortal 0. \r\nEvacuation System Littlejohn Coliseum is equipped with a fire \r\nalarm evacuation system. In the event of activation -- as noted by \r\nsustained horns and flashing strobe lights -- please proceed to the \r\nclosest available exit. Remain outside the building until fire officials \r\ndeem the building safe to re-enter. \r\nNo Smoking ·No smoking is permitted in the seating area of \r\nLittlejohn Coliseum. Cigarette receptacles are provided around the \r\nouter concourse. \r\n* * * * * * * * * * \r\nNote The lists of candidates appearing in this program are not \r\nofficially certified lists of graduates. Likewise, academic honors \r\ndesignations are based upon performance prior to final grades. Both \r\ncertification and academic honors designations must come from the \r\nRegistrar of the University. "
    },
    {
        "page_number": "4",
        "text": "11:00 a.m. \r\nGraduation \r\nDecember 16, 1993 \r\nLittlejohn Coliseum \r\nORDER OF CEREMONIES \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation) \r\nInvocation \r\nKatherine R. Creech \r\nConferring of Honorary Degree \r\nPresident Max Lennon \r\nRecognition of the Deans of the Colleges \r\nProvost J. Charles Jennett \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident Max Lennon \r\nRecognition and Presentation of Awards \r\nClass of '39 Award for Excellence \r\nFrank W. Breazeale, Organist \r\nKevin Davidson, Soloist \r\nDr. John H. Walker, University Marshal "
    },
    {
        "page_number": "5",
        "text": "HONORARY DEGREE \r\nMARLIN DON LOGAN \r\nDOCTOR OF HUMANITIES \r\nClemson alumnus Don Logan is President of Time Inc., whose 1992 sales of $3.1 \r\nbillion make it the largest magazine publisher in the world and one of the largest book \r\npublishers. \r\nAs President and Chief Operating Officer, Mr. Logan oversees the operations of \r\nthe wholly owned publishing arm of the media and entertainment conglomerate, Time \r\nWarner Inc. The parent corporation had 1992 sales of $13.1 billion, ranking third in the \r\nFortune Service 500 list of the largest 100 diversified service companies. \r\nTime Inc. publishes Time, Life, Fortune, Sports Illustrated, Money, People, Enter\u0002tainment Weekly, Sports Illustrated for Kids, Parenting, Health, Martha Stewart Living, \r\nVibe and Sunset. Time lnc.'s other book publishing operations range from Time Life \r\nInc. and Book-of-the-Month Club to Warner Books and Little, Brown & Co. \r\nMr. Logan was tapped as President of Time Inc. after an outstanding 22-year \r\ncareer with its Southern Progress unit based in Birmingham. Southern Progress Corp\u0002oration is the largest regional magazine and book publishing company in the country \r\nand a wholly owned subsidiary of Time Inc. It publishes Southern Living, Progressive \r\nFarmer, Cooking Light, Southern Accents and Travel South magazines, as well as Ox\u0002moor House books. \r\nHe joined Southern Progress as a data processing manager in 1970 and had risen \r\nto Chairman and Chief Executive Officer when Time Inc. brought him to New York City \r\nlast year. Under Mr. Logan's leadership, Southern Progress has enjoyed some of the \r\nhighest profit margins in the magazine and book~ publishing industries. \r\nSince moving to New York, he has maintained his Southern and civil rights con\u0002nections, continuing to serve as Co-chair of the Civil Rights Institute in Birmingham \r\nand as a board member of the Alabama Association of Independent Colleges. He also \r\nis a member of the Board of Directors of the Magazine Publishers of America. \r\nMr. Logan has developed many ties to Clemson University through the years. He \r\nearned his Master of Science degree here in 1968 and worked on his Ph.D. degree \r\nin mathematics at Clemson for one semester. Today he serves as a member of the \r\nPresident's Advisory Council. \r\nAn Alabama native, Mr. Logan earned his undergraduate degree in mathematics \r\nat Auburn University, graduating magna cum laude in 1966. \r\nClemson University considers it a special privilege to honor one of its own whose \r\nachievements in the corporate business world have brought great credit to himself, his \r\nfamily and to his alma mater. We hold Don Logan's accomplishments in the highest \r\nregard, and it is a pleasure to award him the honorary degree, Doctor of Humanities. "
    },
    {
        "page_number": "6",
        "text": "BOARD OF TRUSTEES \r\nBilly L. Amick, Chairman __________________________ Batesburg \r\nPhilip H. Prince, Vice Chairman ________________ Pawleys Island \r\nLouis P. Batson, Jr. ------------------------------ Greenville \r\nJ. J. Britton ---------------------------------------- Sumter \r\nW. G. Deschamps, Jr. ---------------------------- Bishopville \r\nLawrence M. Gressette, Jr. _________________________ Columbia \r\nHarold D. Kingsmore ---------------------------------- Aiken \r\nLouis B. Lynn ------------------------------------ Columbia \r\nPatricia H. McAbee ------------------------------ McCormick \r\nThomas B. McTeer, Jr. ----------------------------- Columbia \r\nBuck Mickel ------------------------------------- Greenville \r\nJoseph D. Swann --------------------------------- Greenville \r\nAllen P. Wood ------------------------------------- Florence \r\nTrustees Emeriti \r\nFletcher C. Derrick, Jr. --------------------------- Charleston \r\nWilliam N. Geiger, Jr. ------------------------------ Columbia \r\nPaul W. McAlister ---------------------------------- Laurens \r\nPaul Quattlebaum, Jr. ---------------------------- Charleston \r\nJames C. Self ----------------------------------- Greenwood \r\nD. Leslie Tindal ---------------------------------- Pinewood \r\nJames M. Waddell, Jr. ------------------------------ Beaufort \r\nADMINISTRATIVE OFFICERS \r\nMax Lennon __________ ____________ President \r\nJ. Charles Jennett _________________ Provost and Vice President \r\nfor Academic Affairs \r\nManning N. Lomax ________________ Vice President for \r\nAdministration and \r\nSecretary of the Board \r\nof Trustees \r\nMilton B. Wise ____________________ Vice President for \r\nAgriculture and Natural \r\nResources \r\nDavid R. Larson __________________ Vice President for \r\nBusiness and Finance \r\nGary A. Ransdell __________________ Vice President for \r\nInstitutional Advancement \r\nG. Jay Gogue _____________________ Vice President for Research \r\nAlmeda Jacks ____________________ Vice President for Student \r\nAffairs "
    },
    {
        "page_number": "7",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, Trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its mar\u0002shal, a senior faculty member, with the college baton, described under University Regalia. \r\nFollowing the marshal is the college banner bearer. Each banner is a combination of \r\ncolors that declare the disciplines taught in that college. These colors, which were estab\u0002lished by the American Council on Educa1ion, are as follows: \r\nCollege Colors Discipline \r\nAgriculture Maize Agriculture \r\nArchitecture Brown Fine Arts \r\nLilac Architecture \r\nCommerce & Industry Copper Economics \r\nDrab Business \r\nEducation Light Blue Education \r\nEngineering Orange Engineering \r\nForest & Recreation Russet Forestry \r\nResources Sage Green Recreation Education \r\nLiberal Arts Dark Blue Philosophy \r\nWhite Letters & Humanities \r\nCream Social Science \r\nLibrary Lemon Library \r\nNursing Apricot Nursing \r\nSciences Golden Yellow Sciences \r\nStaff Purple & Orange Academic Support \r\nCollegiate faculty follow their banner in order of academic rank wearing academic cos\u0002tumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United States wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions are \r\nspecified by a uniform code maintained by the American Council on Education. Caps are \r\nblack and are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels \r\nusually of metallic thread; other degrees wear black or discipline colors. \r\nThe bachelors' gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is to replace black velvet \r\nwith velvet in the discipline color. A second variation is a colored gown usually of the univer\u0002sity's colors. \r\nAll hoods specify the level of degree, the discipline studied and the awarding institution. \r\nFirst, degree level is signified by the size of the hood with bachelors' smallest, masters' lar\u0002ger, and doctors' quite large and of a different shape. Clemson does not award hoods to \r\nbachelors. The width of the velvet trim also conveys the degree. Secondly, the discipline is \r\nindicated by the color of the trim edging the hood to form the throat over the gown. Finally, \r\nthe color of the hood's lining specifies the awarding institution. The colors are displayed in \r\ncombinations that are drawn from heraldry. Notice that the Clemson University hood is lined \r\nwith purple through which is an orange chevron (a \"V\"). Although many combinations are \r\nduplicated by dozens of institutions, Clemson is presently the only institution with that reg\u0002istered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastical, or military re\u0002galia as set forth by their professions. They are preceded by the University marshal. Clad in \r\na gown of office in gold and purple, the marshal wears no hood and bears the University \r\nmace. At the ceremony's close, the faculty do not exit as a part of the recessional but are \r\ndismissed, along with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "8",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present at any convocation where the University, through \r\nIts delegated members, is acting officially. At any official convocation such as \r\ncommencement, the University Marshal, carrying the mace, precedes the Presi\u0002dent into the assembly. The mace rests before the President's chair or speaker's \r\nstand throughout the ceremony, and its removal from the assembly at the close \r\nof a convocation is symbolic of the official withdrawal of the University and, thus, \r\nthe close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic club\u0002like shape, however, is much more ancient, probably going back to man's pre\u0002history. It is made of walnut wood and silver, with the seal of the University in \r\ngold and the University colors represented by insets of cornelian (orange) and \r\namethyst (purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the \r\noffice of president by the governing body of the University. Only the University \r\nPresident may wear it, and while wearing it he speaks for the whole body of the \r\ninstitution. Clemson's chain and seal are made of silver and gold, and cornelian \r\nand amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most acclaimed \r\ngoldsmiths of our era. The enamel plaques for the batons were executed by the \r\nlate Professor Marshall C. Bell, and the lapidary work was executed by the late \r\nMr. C. C. Wilson of Clemson University. "
    },
    {
        "page_number": "9",
        "text": "Coat of Arms \r\nDesigned by Clemson University graphic artist, \r\nConnie Floyd, the coat of arms represents the historic \r\nthree-fold mission of this institution: teaching, research \r\nand service. \r\nPictured on the cover, the coat of arms is divided \r\ninto three parts. The bottom contains a series of open \r\nbooks representing the concept of teaching as the ba\u0002sis of the land-grant university. The white of the books \r\nand the purple of the background designate the teach\u0002ing mission of the University as it is achieved through \r\nundergraduate and graduate instruction. \r\nThe upper portion of the shield contains two sets \r\nof calipers and wheat sheaves illustrating the measure\u0002ment system for research, as well as Clemson's tradi\u0002tion in agriculture and Extension. The three symbols -\r\nthe books, calipers and wheat sheaves - also repre\u0002sent the humanities, technology and science. \r\nThe entire shield is joined by a small orange cen\u0002ter shield bearing a white tiger mask symbolizing the \r\nabiding spirit of Clemson. \r\nThe crest is a gold palmetto tree, which emphasizes \r\nThomas Green Clemson's desire that Clemson become \r\n\"the people's university\" for South Carolinians. It rises \r\nfrom a band of purple, orange, white and gold. The \r\nouter pair of colors, purple and gold, are the official \r\ncolors of the University; the inner pair, orange and \r\nwhite, are Clemson's student colors. "
    },
    {
        "page_number": "10",
        "text": "CANDIDATES FOR DOCTORS' DEGREES \r\nA. WAYNE BENNETT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURAL SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nAgronomy Duck Young Chung~ _____________________________ Seoul, Korea \r\nB.S., M.S., Kon Kuk Univershy \r\nDissertation: Convetttive Adsorption and Transport of Su~ate and Organic Acid in Cecil Bl Soil \r\nAdvisor: Dr. V. L. Quisenberry \r\nStephen Charles Wagner_-,-,c-=--..,...,---.,.,---=-----=--..,...,-,--.,,-----------------Trflin, OH \r\nB.S., Heidelberg College; M.S., North Carolina State Univershy \r\nDissertation: Characteristics of Bradyrhizobium spp. Strains Collected from South Carolina and Kenya \r\nAdvisor: Dr. H. D. Skipper \r\nAnimal Physiology \r\nDonald Joseph Saucier ~-~~-----------------------New Orleans, LA \r\nB.S., M.S., Louisiana State Univershy \r\nDissertation: Regulation of Progesterone Synthesis in the Rabbh Corpus Luteum \r\nAdvisor: Dr. T. Gimenez \r\nApplied Economics \r\nWilliam 0 . Brown Gaffney, SC \r\nB.S., M.A., Clemson University \r\nDissertation: Empirical Analysis of the Relationship Between Corporate Board Structure and Corporate Performance \r\nAdvisor: Dr. M. T. Maloney \r\nEntomology \r\nYuesea Eric Chen ~---,--~~~~--~~---------------- Ta~i. Taiwan \r\nB.S., National Taiwan Universtty; M.S., Clemson Universtty \r\nDissertation: Revision of the~ (Trichoptera: Leptoceridae) of the World \r\nAdvisor: Dr. J. C. Morse \r\nEnvironmental Toxicology \r\nGail Ann Schull Harkey~--,-~-~~~~-~~~-~---------------Canton, Ml \r\nB.S., Univershy of Missouri-Columbia; M.S., Memphis State Univershy \r\nDissertation: Investigating Bioavailabilhy of Sediment Associated Hydrophobic Organic Contaminants \r\nAdvisor: Dr. S. Klaine \r\nFood Technology \r\nAlice Holley Brandenburg Aiken, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Modification of Soy Protein Isolate Films and their Effects on Barrier and Mechanical Properties \r\nAdvisor: Dr. R. F. Testin \r\nDale Albert Grinstead Waterloo, IA \r\nB.S., M.S., Iowa State Univershy \r\nDissertation: Purification, Partial Characterization, and Application of Jenseniin G, a Bacteriocin Produced by \r\nPropionibacterium Jensenii P126 \r\nAdvisor: Dr. S. Barefoot \r\nNutrition \r\nLisa Michelle Redmond __________ ___________ _____ Winston-Salem, NC \r\nB.S., North Carolina State Univershy; M.S., Clemson Universtty \r\nDissertation: Efficacy of Dopamine Receptor Antagonists as Treatments for Fescue \r\nAdvisor: Dr. D. L. Cross \r\nPlant Pathology \r\nThomas Josef Baum ~~--~~~~--------------------Bingen, Germany Diploma, Technical University - Munich, Germany \r\nDissertation: Population Dynamics and Species ldenMication of Root-Knot Nematodes in Tobacco \r\nAdvisor: Dr. S. A. Lewis "
    },
    {
        "page_number": "11",
        "text": "Plant Physlology Heather Ann Hatt __________________ _ _ ________ ___ Mohnton, PA \r\nB.S., The Pennsylvania State University; M.S., Clemson University \r\nDissertation: Photomodulation of Plant Growth \r\nAdvisor: Dr. D.R. Decoteau \r\nRenee Joan Keese Easley, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Investigations of MSMA Resistance and Mode of Action with MSMA-Resistant and Susceptible Common \r\nCocklebur and Cotton \r\nAdvisor: Dr. N. D. Car!l>8r \r\nCOLLEGE OF COMMERCE AND INDUSTRY \r\nDOCTOR OF PHILOSOPHY \r\nlndustrlal Management \r\nMan-ying Qiu Shanghai, China \r\nB.S., Central Wesleyan College; M.S., Clemson University \r\nDissertation: Hierarchical Production Planning and Scheduling in a Multi-Product and Multi-machine Environment \r\nAdvisor: Dr. E. E. Burch \r\nCOLLEGE OF EDUCATION \r\nDOCTOR OF EDUCATION \r\nVocatlonal and Technlcal Education \r\nBarbara McDonald Foltz Seneca, SC \r\nB.A., M.A., University of Colorado \r\nDissertation: The Effect of a Career Counseling Workshop on the Career SeW-Efficacy of Non-Tradltional College \r\nStudents \r\nAdvisor: Dr. D. H. Pate, Jr. \r\nWanda Talley Staggers Anderson, SC \r\nB.S., University of Hartford; M.ln.Ed., Clemson University \r\nDissertation: A Survey of the Status of Computer Literacy Graduation Requirements in Selected Private Colleges and \r\nUniversities \r\nAdvisor: Dr. D. H. Pate, Jr. \r\nCOLLEGE OF ENGINEERING \r\nDOCTOR OF PHILOSOPHY \r\nAgrlcultural Engineering \r\n(Agricuhural Engineering is jointly administered by the College of \r\nAgricultural Sciences and the College of Engineering.) \r\nCraig Allen DeWitt --~~-------------------------Clemson, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Ventilation of Crawl Spaces in a Warm, Humid Climate \r\nAdvisor: Dr. J. M. Bunn \r\nCaye Marie Drapcho Snow Shoe, PA \r\nB.S., M .S., Pennsylvania State University \r\nDissertation: Modeling of Algal Productivity and Diel Oxygen Profiles in the Partitioned Aquacuhure System \r\nAdvisor: Dr. D. E. Brune \r\nBioengineering \r\nArun Sudhakar Shanbhag Bombay, India \r\nB.E., University of Mysore; M.S., Clemson University \r\nDissertation: Human Monocyte Response to in Vivo and in Vitro Generating Particulate Biornaterial Debris \r\nAdvisor: Dr. J. Blad< \r\nAbdel-Wahab Ahmed Soliman .----,..,...,,---,.,.-----,-,...-,---..,.----- ----------Mansoura, Egypt B.S., Milltary Technical College; M.S., Mansoura University \r\nDissertation: Image Processing and Neural Network Analysis of Cell Kinetic Behavior \r\nAdvisor: Dr. R. L. Dooley "
    },
    {
        "page_number": "12",
        "text": "Ceramic Engineering \r\nChi-Shiung Hsi Taipei, Taiwan \r\nB.S .. M.S., Cheng-Kung University, Taiwan \r\nDissertation: The Electrical Properties of Contacts Between Metallic Electrodes and High-Tc Superconductors \r\nAdvisor: Dr. G. H. Haertling \r\nChemical Engineering \r\nPatrick J. Hickey Rutherford, NJ \r\nB.Ch.E., M.Ch.E., Manhattan College \r\nDissertation: The Optimization of Spiral Wound Membrane Modules for the Pervaporative Removal of Volatile Organic \r\nCompounds \r\nAdvisor: Dr. C. H. Gooding \r\nElectrical Engineering \r\nVisvanathan Neelakantan Madras, India \r\nB.Sc., Madras University; B.E., Indian Institute of Science; M.Engr., Memorial University of New Foundland \r\nDissertation: A Study of the Hidden Markov Model for Isolated Word Recognition \r\nAdvisor: Dr. J. N. Gowdy \r\nEngineering Mechanics \r\nDarwin Gregory Moon Clemson, SC \r\nB.S., Michigan Technological University; M.S.E., University of Michigan; M.S., Calnomia State University-Northridge \r\nDissertation: Characterization and Prediction of Post-Impact Fatigue Damage in Stitched Composites \r\nAdvisor: Dr. J. Kennedy \r\nEnvironmental Systems Engineering Yunn-Tzer Lu _______________________________ Taipei, Taiwan \r\nB.S., National Chun-Kung University; M.Engr., Clemson University \r\nDissertation: Analysis of Plasmid lnstabillty in Non-Seleclive Growth Environments \r\nAdvisor: Dr. C. P. L. Grady, Jr. \r\nScott Hoffman Reboul Moorestown, NJ \r\nB.S., Dickinson College; M.S., Clemson University \r\nDissertation: Oualltative and Quantitative Analysis of Alpha-and-Beta-Emitting Radionuclides by Ion Chromatography and \r\nOn-line Scintillation Counting \r\nAdvisor: Dr. R. A. Fjeld \r\nIndustrial Engineering \r\nWilliam Anthony Brown_~-~------------------------- Greer, SC \r\nB.S., M.S., University of Massachusetts-Amherst \r\nDissertation: Designing for Product End-of-Lffe Alternatives \r\nAdvisor: Dr. R. P. Davis \r\nMechanical Engineering \r\nDadong Zhou Songyang, China \r\nB.S., Tsinghua University; M.S., Zhejiang University \r\nDissertation: Effects of Elevated Free-Stream Turbulence and Streamwise Accelerations on Flow and Thermal Structures \r\nin Transltional Boundary Layers \r\nAdvisor: Dr. T. Wang \r\nCOLLEGE OF FOREST AND RECREATION RESOURCES \r\nDOCTOR OF PHILOSOPHY \r\nForest Resources \r\nJon Eric Bany ------------------------------- Pine Bluff, AR \r\nB.S., Harding University; M.S., University of Arkansas \r\nDissertation: Bottomland Oak Regeneration in the Congaree River Bottoms of South Carolina \r\nAdvisor: Dr. E. Nix \r\nParks, Recreation, and Tourism Management \r\nTheresa A. Herrick Russellville, AR \r\nB.S., Southwest Missouri State University; M.S., University of Missouri-Columbia \r\nDissertation: An Overview and Synthesis of Visual Resources Assessment: Considerations for Integrating Social and \r\nResources Dala Sets \r\nAdvisor: Dr. R. Becker "
    },
    {
        "page_number": "13",
        "text": "COLLEGE OF SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nBiochemistry Robert Samuel English, Jr. ___________________________ Lancaster, SC \r\nB.S., Clemson Universtty \r\nDissertation: Molea.llar Biology of the THIOBACILLI \r\nAdvisor: Dr. J. M. Shively \r\nChemistry \r\nChristopher Wade Alexander Pickens, SC \r\nB.S., Wofford College \r\nDissertation: Organocopper Chemistry: (I) Preparation and Reactions of a-Azoalkyl and a-Aminoalkyl Copper/Cuprate \r\nReagents. (II) Reactions of N,S-Acetals with Organocopper Compounds. \r\nAdvisor: Dr. R. K. Dieter \r\nDong Dai __________________ ___ ____________ Beijing, China \r\nB.S., Beijing University \r\nDissertation: Synthesis of Cannabinoid Metabolttes and Analogs \r\nAdvisor: Dr. J. W. Huffman \r\nMary Dolores Brookshire Dillingham ------------------------ Columbia, SC \r\nB.S., Funnan Universtty \r\nDissertation: The Organometallic Chemistry of Group 13 Metal Alkyls and Aryls: Structure and Reactivfy \r\nAdvisor: Dr. G. Robinson \r\nComputer Science \r\nVeera Sekhararao Muddana __________________________ Palaparru, India \r\nSridhar Narayan _______________________________ Rourkela, India \r\nB.T., Indian Institute of Technology; M.S., M.S., Clemson University \r\nDissertation: Nonlinear Transformation of Neuronal Inputs in Mutti-layer Perceptron Networks \r\nAdvisor: Dr. E. W. Page \r\nGenetics \r\n(Genetics is jointly administered by the College of Agricultural \r\nSciences and the College of Sciences.) \r\nBrent Alan Murdock ___ ~~~~~~-~---~--~------------ Belton, SC \r\nB.A., Covenant College; B.S., M.S., Cal~ornia Polytechnic State Universfy \r\nDissertation: Characterization of Male Sterilfy and Polyploidy in Watennelon ICttrullus lanatus\\ \r\nAdvisor: Dr. N. H. Ferguson \r\nMathematica! Sciences \r\nMana Medford Bell ______________________ _ ______ Waynesville, NC \r\nB.S., Western Carolina University; M.S., Clemson Universfy \r\nDissertation: Prior~y and Vacation Queues with Markov Renewal Arrivals \r\nAdvisor: Dr. P. C. Kiessler \r\nDavid Warren Cribb ---------------------------Boiling Springs, NC \r\nB.S., Gardner Webb College, M.S., Clemson University \r\nDissertation: Stabilfy Properties of Inclusive Connectivity for Graphs \r\nAdvisor: Dr. R. D. Ringeisen \r\nRobin Lougee-Heimer ___ _________________________ Greenwood, SC \r\nB.S., M.S., Clemson University \r\nDissenation: Combinatorial Approaches to Energy, Economic and Allocation Problems \r\nAdvisor: Dr. W. P. Adams \r\nPhysics \r\nXinfen Chen Shanghai, China \r\nB.S., M.S., Shanghai University of Science and Technology \r\nDissertation: Growth, Characterization and the Effect of Uniaxial Stress on Transport Properties in Biscco High \r\nTemperature Superconducting Single Crystals \r\nAdvisor: Dr. G. X. Tessema \r\nPhillip Bruce Chilson --~~----=------------------- 'Duncan , SC \r\nB.S., Clemson University; M.S., University of Florida \r\nDissertation: A Study of Precipitation Using Dual-Frequency and Interferometric Doppler Radars \r\nAdvisor: Dr. C. W. Ulbrich \r\nPatrick James Fay Columbia, SC \r\nB.A., M.l.Bs., Universfy of South Carolina \r\nDissertation: Detailed Balance Method lor Chemical Potential Determination and Monte Cano Simulations in the \r\nlsoenthalpic-lsotension-lsobaric Ensemble \r\nAdvisor: Dr. J. Ray "
    },
    {
        "page_number": "14",
        "text": "Matthew Jack Freeman:---,.,....,--...,,--..,..,--=---=,-----,-,-,--.,,----------------Charlotte, NC \r\nB.S., North Carolina State University; M.S., Clemson University \r\nDissertation: Radio Wave Heating of the Lower lonospere \r\nAdvisor: Dr. L. M. Duncan \r\nzoology \r\nYun-tao Ma Kunming, China \r\nB.S., Yunnan Universtty; M.S., Western Carolina University \r\nDissertation: Developmental Ultrastructure of Central Nervous System of Ascidia interrupta (Chordata, Ascidiacea) \r\nAdvisor: Dr. E. E. Ruppert \r\nLinda Kuisma Wang Clemson, SC \r\nB.S., M.Ag., Clemson University \r\nDissertation: Quantitative Genetics of Daily Torpo Ciouclland Deer Mice Peromyscus manuculatus nublterrae \r\nAdvisor: Dr. E. B. Pivorun "
    },
    {
        "page_number": "15",
        "text": "CANDIDATES FOR EDUCATION SPECIALIST \r\nAND MASTERS' DEGREES \r\nA. WAYNE BENNETT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURAL SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nMichael Funnan Mcleod ______ Clemson, SC Patrick Edward Settle ________ Inman, SC \r\nMASTER OF \r\nHenry David Gunter,,--------__,.·Pelion, SC \r\nCharles Edward Phillips Appling, GA \r\nAGRICULTURE \r\nDawn Marie Swallow -------.Paducah, KY \r\nlrfan Tak Louisville, KY \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nTania Loretta Espadas _____ Washington, DC Cheryl Hope Knight ______ Newport News, VA \r\nAgronomy \r\nJeffrey Robert Watts Sugar Land, TX \r\nAnimal and Food Industries \r\nLaura A. Dellevigne _______ Flemington, NJ Thomas Anthony Trezza ______ Benicia, CA \r\nJay Morgan Jensen Norway, Ml \r\nAnimal Physiology \r\nRachel LeClere Schlager Lee ___ Lawrenceville, GA Myra Michele Robinson ______ Cleveland, OH \r\nAquaculture, Fisheries, and Wlldllfe Blology \r\nPhillip Daniel Jones Auburn, AL \r\nEntomology \r\nTimothy Scott Davis _______ Greenville, SC Samuel Benson Hudson, Jr .. _____ Sumter, SC \r\nRobert Donald Gilbert Ogdensburg, NY \r\nEnvironmental Toxicology \r\nPrakash Silwal Palpa, Nepal \r\nHorticulture \r\nJoseph Philip Albano ______ ~_Tarr1Ja, FL Charles Duane Johnson. ____ College Station, TX \r\nDanielle Rene Ellis Houston, TX Haiying Wang Beijing, China \r\nNutrition \r\nSusan Marie Block~ ______ Clarllsboro, NJ Joanne Orinick Gaffney ____ Lake Oswego, OR \r\nCandace Nason Croft Seneca, SC Pamela Sue Stachelek North Vernon, IN \r\nCOLLEGE OF ARCHITECTURE \r\nMASTER OF ARCHITECTURE \r\nJohn Sullivan Sm~h Ill ___ Fayetteville, GA \r\nMASTER OF CITY AND REGIONAL PLANNING \r\nWendy Lynne Bell _______ Williamston, SC Shoji Hasegawa.,--______ .Nagasaki-Shi, Japan \r\nEdward Kwame Hagan Kumasi, Ghana Gunjan Khatwani Bangalore, India \r\nMASTER OF \r\nKatherine Anne Cowan -------,-,-~Newry, SC \r\nRussell James Horton North Scituate, RI \r\nBryan Forbes Lafaye Seneca, SC \r\nFINE ARTS \r\nThomas Reynolds White ~----~Saginaw, Ml \r\nKristen Tabone Woodward Webster, NY "
    },
    {
        "page_number": "16",
        "text": "COLLEGE OF COMMERCE AND INDUSTRY \r\nMASTER OF BUSINESS ADMINISTRATION \r\nRobbie Harold Albertson -----~ Easley, SC \r\nJames Frederick Anderson St Louis, MO \r\nJaney Elizabeth Link Newton, NC \r\nRobert Nathaniel Lloyd North Augusta, SC \r\nSamuel Richard Angelo Perryopolis, PA Julie Renee Manfredi Aiken, SC \r\nMelissa Kay Anrbrust Anderson, SC James Everette McClain Ill Greenwood, SC \r\nRobert Scott Ballard Williamston, SC Benjamin Wallen McCormick Dillon, SC \r\nSusanne R. Bates Greenville, SC James Blaine Meadows Lawrence, KS \r\nSteve Coleman Bolick, Jr. Denver, NC Stacy James Morrison Anderson, SC \r\nDavid John Bolka Neshanic Station, NJ David John Mould Cresskill, NJ \r\nDeanna nsha Bridgeman Spartanburg, SC Jacqueline Kaye Nantz Greenville, SC \r\nChristopher Lee Burrell Greenville, SC Mohamed N'Diaye Bamuko, Mali \r\nAndrew Lee Casstty Charlotte, NC John Robert-Winfred Nelson _ _ _ Simpsonville, SC \r\nDavis Edward Clark Clemson, SC Dao Thi Nguyen Greenville, SC \r\nIan Clarke Spartanburg, SC Eric Arthur Nielsen Knoxville, TN \r\nMelissa Joan Correll Summerville, SC Daniel Arthur Nowell Fountain Inn, SC \r\nDaniel Vincent Danish New Milford, CT Carl Gottleib Oehmig IV Anderson, SC \r\nHolly Anne Deal Spartanburg, SC Calvin Ketth Owens Newberry, SC \r\nJeffrey John DeMars Jackson, TN Dana Patrick Painter Anderson, SC \r\nGeorge Christopher Dickson Seneca, SC Clarence Jeffrey Pearson Seneca, SC \r\nPolly Warren Doss Toccoa, GA Michael Ray Posey liberty, SC \r\nScott Walter Dozier Fayetteville, GA Scott Vernon Rollins Wellford, SC \r\nEdi Fabbro Udine, Italy Richard Lee Rothman Nashville, TN \r\nDavid Joseph Faulk Charlotte, NC Frances Andree Rzewnicki Charleston, SC \r\nRobert Shayne Floyd Florence, SC Donna L. Sawyer Greenville, SC \r\nSusan Janelle Fowler Greenville, SC Donald Edward Schlomer Greenwood, SC \r\nSusan Carol Frazier Greenville, SC Dawn Kelly Shay Myrtle Beach, SC \r\nMatthew George Given Reston, VA Susan Lynn Shealy Gilbert, SC \r\nDwayne Michael Grassie Simpsonville, SC Timothy James Simmons Walterboro, SC \r\nWanda Michelle Greene Laurens, SC Mark Edward Smtth York, SC \r\nJames Emmett Holstein North, SC Shayla Jenea Steen Greenville, SC \r\nAmelia Catherine Hood Clemson, SC Daniel Mark Steeves Simpsonville, SC \r\nDiane Giglio Hoskins Easley, SC James Phillip Stover Greenville, SC \r\nChin-Lin Hu Taichung, Taiwan Kenneth Allen Sult Mauldin, SC \r\nPatrick Curtis Hudson Greenville, SC William Chris Taylor Simpsonville, SC \r\nDavid Paul Jacky Anderson, SC Todd Christopher Thompson Columbus, OH \r\nGary Anthony Kerley Thibodaux, LA Daniel Lewis Thurman Concord, MA \r\nRobert Alan Kirk Simpsonville, SC Bobby Ray Tinkler, Jr. Rock HiV, SC \r\nRonald Allen Lanier, Jr. Savannah, GA Rob Alan Whttlock Yardley, PA \r\nLeau Wilson Lee Simpsonville, SC Komsun Yuvachit Bangkok, Thailand \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nMiranda Letttia Fowler _______ Anderson, SC Charles Edward Ramsay _____ ___,,Clemson, SC \r\nKetth Thomas Littrell Venice, FL Melinda Scott Greenville, SC \r\nAna Luisa Mallo West Palm Beach, FL John Lewis Seabrook Ill Salisbury, NC \r\nLinda Webb Martin Central, SC Kathy Lynn Thomas Iva, SC \r\nNeschla Deloach McCall West. Union, SC Janet Ruth Wagner Seneca, SC \r\nVarada Amod Ogale Bombay, India Yolanda Dawn Wardlaw Anderson, SC \r\nMASTER OF ARTS \r\nEconomics \r\nRobert Paul Dailey _________ Terre Haute, IN Fabio Alberto Robelo _____ San Jose, Costa Rica \r\nZhuowen Fei Shanghai, China Jill Russell Salley Central, SC \r\nKris Elaine Krauza Raleigh, NC Laura Dianne Speake Tallahassee, FL \r\nPaul Mather Lindsay Roswell, GA Tzu-Ying Wang Taipei, Taiwan \r\nPeter Christopher Melvin Winter Springs, FL Zhongyi Yuan Oidong, China \r\nTimothy Andrew Newman Clemson, SC \r\nMASTER OF SCIENCE \r\nIndustrial \r\nKimberly Ann Benson _______ Seneca, SC \r\nPhillip Brian Lowery Old Fort, NC \r\nJoseph Andre Maraltt Charleston, SC \r\nManagement \r\nJuan Carlos Morales Bogota, Colombia \r\nPoornachandra R. Panchalavarapu _ Vijayawada , India \r\nRobert Felix Prinzo Dunwoody, GA \r\nTextile Chemistry \r\nJuan Herrera Moro ___ Mexico Ctty, Mexico \r\nTextile Science \r\nSubramanya Ananthanarayana Yellambalse _____ Mysore, India "
    },
    {
        "page_number": "17",
        "text": "COLLEGE OF EDUCATION \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\nJudy Ann Deal Adkins _______ Easley, SC \r\nKenneth Franklin Chapman Saluda, SC \r\nRobert Lee Davis Greenville, SC \r\nJanlt Diane Kangas _______ Lexington, SC \r\nKimberly Broome May Anderson, SC \r\nTammy Tillotson Thompson Easley, SC \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nPreston Scott Abrams ______ Greenwood, SC Susan Scott Morrow _______ Greenwood, SC \r\nRoberta Hornick Elrod West. Union, SC Eldred Sebastian Tinsley IV Hodges, SC \r\nCounsellng and \r\nAmy Lee Bennett ~~----- Summerville, SC \r\nTravis Moore Campbell Greer, SC \r\nLisa Owens Carpenter Liberty, SC \r\nJettry Craig Clifton Salem, SC \r\nDebra June Cole Mountain Rest, SC \r\nShelley Renee Conrad Anderson, SC \r\nKaren Annette Davis Anderson, SC \r\nKay Dyar Franck Irmo, SC \r\nLloyd Andrew Howe Orleans, IN \r\nLaura Katherine Jenkins Mauldin, SC \r\nTammy Honea Lee Seneca, SC \r\nAmy Pettit Loftus Greenwood, SC \r\nRevonda Jo McClain Honea Path, SC \r\nBarbara Morgan McComb Orangeburg, SC \r\nGuidance Services \r\nAmy Mclane Merck Seneca, SC \r\nRenee Crooks Midd.~le~to-n------=-Greenville, SC \r\nSharon Sessoms Mimms Pickens, SC \r\nDiane Susan Miner Laurens, SC \r\nMary Margaret Moss Durham, NC \r\nNancie Michele Motley Chatham, VA \r\nMarilyn Louise Ongley Toccoa FaUs, GA \r\nCarol Elizabeth Pedley St Petersburg, FL \r\nMelanie Ryan Robertson Anderson, SC \r\nFrances J. Schmid Mauldin, SC \r\nRay Lee Thompson Ill Pendleton, SC \r\nNancy Taylor West Clayton, GA \r\nRosemary HoUand Wise Seneca, SC \r\nBennett Stephen Wright Anderson, SC \r\nElementary Education \r\nRebecca Kay Athelstone ______ Cornelia, GA Sandra Ann Moore _______ Westminster, SC \r\nLucile Hinshaw Cathey Anderson, SC Veatrice Jenkins Rooks Charlotte, NC \r\nJoyce Dalton Fowler Pickens, SC Lauren Michele Stephens Elberton, GA \r\nJudy Ann Gatlin Hoberg Hartwell, GA Belinda Hyde Thomas Elberton, GA \r\nEnglish McGee Holland Rock HiU, SC Karen Elizabeth Vaughn Hartwell, GA \r\nAnna Walters Mize Anderson, SC \r\nReading \r\nPatricia Jean Brinson ------~Gainesville, FL Elizabeth Allen Shaw ________ Surnter, SC \r\nLuAnn Ciotti Beachwood, NJ \r\nSecondary Education \r\nSonia Michelle Cunningham ____ Simpsonville, SC Susan Hairfield Lass_ Ramstein Air Force Base, Germany \r\nMelissa Stewart Dalton Pickens, SC \r\nSpeclal Education \r\nSharon Sims Davis ________ ~ Belton, SC Dena Meece Hiott -------- Pickens, SC \r\nRobert Lee Downs Greenville, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nCharles Lane Allen. _______ Anderson, SC Kathy Diane Hougen ________ Morrison, IA \r\nRick Ray Chandler Greenville, SC Bradley Allison Hughes Greenville, SC \r\nDana Elizabeth Edgar Cayce, SC Daniel Joseph Maw Seneca, SC \r\nPamela Lynne Edgar Seneca, SC James Rick McCallister Lynn, NC \r\nMltchell Turner Frye Seneca, SC Marcelie Tucker, Jr. Whitmire, SC \r\nKathleen McGarlty Grant Pickens, SC William Daniel Vickery Columbia, SC \r\nDebra McAlister Ham Simpsonville, SC Willie Joe Washington Seneca, SC \r\nMASTER OF INDUSTRIAL EDUCATION \r\nJason Edward Barrier ______ Summerville, SC Hollace Leigh Morris. ______ Spartanburg, SC \r\nJoyce Ann McGrady Duncan Demorest, GA Kumar D. Phani Pradesh, India \r\nMatthew Gerard Emenhiser New Haven, IN Monty Randolph Stancil Seneca, SC \r\nKevin Charles Kohler Carlisle, PA David Lyle Summers Easley, SC \r\nJamie Boyd Lane East.view, KY John Andrew Utley Greenville, SC \r\nRhonda Mechelle Martin Cornelia, GA Sandra L. Whittle Greenville, SC \r\nGary Charles Matthews Toccoa, GA "
    },
    {
        "page_number": "18",
        "text": "COLLEGE OF ENGINEERING \r\nMASTER OF ENGINEERING \r\n, Civil Engineering \r\nPaul Geoffrey Gur1ey ___ Powdersville, SC \r\nElectrical Engineering \r\nDiane Lynn Hinterlong ___ __ ~~~ Aurora, IL Frank Vincent Myers _______ Columbus, OH \r\nRobert B. Kieffer Pickerington, OH \r\nEnvironmental Systems Engineering \r\nKeith Joseph Kornegay _______ Clifton, VA Tammy Lynn Watson _______ Bellingham, MA \r\nPatricia Anne Scanlan Willingboro, NJ \r\nMASTER OF SCIENCE \r\nBioengineering \r\nSameer Bhatia~~-------~. Poona, India Bernadette Konopka Boca Raton, FL \r\nJohn Michael Buckley Charleston, SC Christian Matthew Puttlltz ___ Wappingers Falls, NY \r\nJoel Thomas Corbett Camden, SC Jennifer Lynne Rohr Enfield, CT \r\nStephanie Cheree Johnston Aiken, SC Susan Lynn Roweton Chadron, NE \r\nCeramic Engineering \r\nNancy Beth Bolger Seneca, SC \r\nChemical Engineering \r\nNnamdi Emmanuel Aniedobe _____ .Anka, Nigeri Jeffrey Alan Dugger _____ North Charleston, SC \r\nClark Elbert Barthel Elgin, IL Joseph Franklin Hart West Springs, SC \r\nJarrett Taylor Brown Wilmington, NC Jenntter Stikeleather Peavey Charlotte, NC \r\nJaclyn Dawn Cobb Bridgeton, •NJ \r\nCivil Engineering \r\nThomas Michael Canick ----~~~Clemson, SC Khwaja Ghulam Murshed Clemson, SC \r\nHans Fritsche Nerchau, Germany Terrence Wade Philbrick, Jr. Waxhaw, NC \r\nRobert Alain Grumber New Pahz, NY Srinivas Rama Saraswatula Washington, DC \r\nJonathan Michael Hugg Cayce, SC Hara Gopala Sharma Totapally ___ Hyderabad, India \r\nD. Mack Kelly, Jr. Liberty, SC Terry L. Wood Watkins Glen, NY \r\nComputer \r\nGary Lee Berger ________ Pendleton, SC \r\nNicolae Peter Costescu Arlington, VA \r\nRobert Hance Finley, Jr. Taylors, SC \r\nCar1 Thomas Murray Oak Hill, WV \r\nElectrical \r\nShirish Sharadchandra Bhagwat __ ~~ Pune, India \r\nZhongyue Cai Shanghai, China \r\nDavid Thomas Callister Clover, SC \r\nJohn Brawner Duffie Wedgefield, SC \r\nAtchyuth Krishna Gorti Vijayawada, India \r\nLinwood Earl Halsey, Jr. Creswell, NC \r\nArchana Khetan Gwalior, India \r\nTapan Mohanti Boulder, CO \r\nEngineering \r\nSupriya Sandeep Sharma. ______ Nagpur, India \r\nDaniel Charles Stanzione, Jr. Seneca, SC \r\nSravan Kumar Vellanki Atlanta, GA \r\nEngineering \r\nSai Krishna Mopuri_~ ___ Andhra Pradesh, India \r\nMandar Manohar Natekar Pune, India \r\nSubir Prasad New Delhi, India \r\nLynna Marie Setzer Forest City, NC \r\nDeepak Shankar Madras, India \r\nJohn William Stephens Winslow, IN \r\nShyam Suri Clemson, SC \r\nMark Allen Walt Lawton, OK \r\nEngineering Mechanics \r\nThomas Malon Browder, Jr. ---- Niceville , FL Thomas Edward Serdinak ______ Richlield, OH \r\nEnvironmental Systems Engineering \r\nBarbara Anne Anderson. _____ ~ Kettering, OH Stephen Ott Meininger ______ Columbia, MD \r\nAnthony Michael Ferrelli Staten Island, NY Paul David Nunley Charleston, WV \r\nDeborah Ford Hudson Augusta, GA Shawn Michael Sock Lincoln, NE \r\nCorey Lynn Knoop Greer, SC Bradley Allen Striebi Jacobus, PA \r\nDebra Ann Mccroskey Kingston, TN James Franklin Strunk, Jr. Plainsboro, NJ \r\nIndustrial \r\nMadhusudhana Rao Anne Vijayawada, India \r\nMelroy Edwin D'Souza Bombay, India \r\nSudarshan Govind Ghate Gandhinagar, India \r\nVijayabhasker Reddy Kommidi _ __ Hyderabad, India \r\nDaniel Lorenzo Lark Clinton, SC \r\nEngineering \r\nVenu Gopal Pajjuri Cleveland, OH \r\nVenkataramana Reddy Reddivari __ Hyderabad, India \r\nGuruprasad Srihari Bangalore, India \r\nK. S. Venkatraman Bombay, India \r\nBrian Phillip Western Rushville, NY \r\nMaterials Science and Engineering \r\nLawrence Price Hann~-----~_ Media, PA Anthony Pascal Sannino _____ Marseille, France \r\nJohn Prentiss Sanders Ill Summerville, SC "
    },
    {
        "page_number": "19",
        "text": "Mechanlcal Engineering \r\nSteven Gregory Diacumakos _ ___ Frogmore, SC Richard Anthony Mineo------,..,. Elkton, MD \r\nJeremy Jonathan Kahrs Denville, NJ Scott Patrick Mislevy Wauchula, FL \r\nCOLLEGE OF FOREST AND RECREATION RESOURCES \r\nMASTER OF FOREST RESOURCES \r\nJonathan R. Glenn _ _ ______ Greenville, SC Christopher Todd Horton _ ____ Summerville, SC \r\nMASTER OF SCIENCE \r\nForest Resources \r\nWilliam Beauregard Sleele ___ Lancaster, SC \r\nCOLLEGE OF LIBERAL ARTS \r\nMASTER OF ARTS \r\nEngllsh \r\nBerlethia Johneese Pitts _ ______ Seneca, SC John Mell Sherrer Ill ___ ____ Columbia, SC \r\nProlesslonal Communication \r\nnmothy Earl Cook _ _______ Clemson, SC Godfrey Click Kimball _______ Rock HiN, SC \r\nMASTER OF SCIENCE \r\nApplled \r\nRobert Pruitt Gruber ________ Ravenel, SC \r\nJeffrey Todd Kerbow Clemson, SC \r\nSarah F. Marl<s Easley, SC \r\nSoclology \r\nNipa Shah Roxbury, NJ \r\nCatherine Valerjevna Slepova-Terry _ Moscow, Russia \r\nMargaret Clare ner Tyler, TX \r\nCOLLEGE OF NURSING \r\nMASTER OF SCIENCE \r\nNursing \r\nAnita Macaione Butler ~-----Spartanburg, SC Mary Gay Trado ~------- Anderson, SC \r\nCatherine Kerns Mattingly Owingsville, KY Suzanne Finley Ulmer Atlanta, GA \r\nRobin White Simpkins Woodruff, SC Linda Rae Woodward Erie, PA \r\nPamela Ga~ Horst Stodghill Greenville, SC \r\nCOLLEGE OF SCIENCES \r\nMASTER OF SCIENCE \r\nBiochemistry \r\nStephanie Dianne Friedman _ GuH Breeze, FL \r\nChemistry \r\nMichael Anthony DeTure _______ .Maltland, FL Jeffrey Michael Weston ____ __ Greenville, SC \r\nComputer Science \r\nRichard Manning Baldwin II ______ Clemson, SC Neeraj Ojha Delhi, India \r\nRobert WilUam Berry Freeburg, IL Michael Scott Percy Charleston, SC \r\nMarvin Lawrence Blackbum Marion, SC Dora Potluri Vijayawada, India \r\nShuchi Chawla Secunderabad, India Krishnamoorthy Ravishankar Clemson, SC \r\nLisong Chen nanjin, China Charles Edwin Riehm Ill Greenville, SC \r\nWei-ying Chen Hangzhou, China Suvrat Sahaya Calcutta, India \r\nRahul Chopra Clemson, SC Girish Jivaji Sardeshpande Belgaum, India \r\nBanumathy Ganesan Clemson, SC Lionel Stanley Stewart New Orleans, LA \r\nDaryl Thomas Holoman Ivor, VA Asim Tewary New Delhi, India \r\nRajat Jain New Delhi, India Kanupriya Tewary Boulder, CO \r\nTimothy Francis Keenan Concord, NC Hemanthkumar K. Tholappa Madras, India \r\nAjltesh Kishore Agartala, India Tm James Tumlin Easley, SC \r\nRavi Kohli Bradbury, CA Rama Krishna Tummala Clemson, SC \r\nBelinda Marie Liviero Allendale, SC Chandramouli Sarai Vemuri Vijayawada, India \r\nDanny Howard Mace Gaffney, SC Trent Whlteley Manassas, VA \r\nShankar P. Narayan Warangal, India Lona Diann Ponds Wiles Spartanburg, SC \r\nTracey Marie Oakes Bowie, MD Prahladkumar Srinivasa Verra ___ Hyderabad, India "
    },
    {
        "page_number": "20",
        "text": "Hydrogeology \r\nEric Bruce Aufderhaar _______ Greenville, SC Scott Eppes Brame -----~Long Creek, SC \r\nMathematical \r\nNlvedita Chakravarti ------- Udaipur, India \r\nScott William Crosbie caiy, NC \r\nSandra Perlene Davis Greer, SC \r\nSciences \r\nPaul Allen Koza Clemson, SC \r\nDavid Walker McCullough, Jr. __ Hendersonville, NC \r\nDami Craig Tirrber1ake New Orleans, LA \r\nMlcroblology \r\nKo-Dee Gan -~--------Taipei, Taiwan Abdul Khatib Jafri _ _____ _ Karachi, Pakistan \r\nLane Keny Hansel Greenville, SC \r\nPhysics \r\nGrady Todd Phillips ________ Lyman, SC Ke\"h Edward Wagner _______ Rochester, NY \r\nNeil Gregory Schnepf Wh\"estone, NY Xiao Ping Zhang Shanghai, China "
    },
    {
        "page_number": "21",
        "text": "CANDIDATES FOR BACHELORS' DEGREES \r\nCOLLEGE OF AGRICULTURAL SCIENCES \r\nTHOMAS ROSS WILKINSON, Dean \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nW~liam Travis Bentley ______ Haines City, FL Phillip Dewayne Dibrell ______ Summerville, SC \r\nRobert Michael Brewer Clemson, SC Roger L. Flowers, Jr. Summerton, SC \r\nJeffrey Scott Butler Orangeburg, SC \r\nChad W~son Cash Cowpens, SC \r\nJames Madison Mccrorey, Jr. Chester, SC \r\nFrankie Wayne Williams Clover, SC \r\nAgricultural Education \r\nArlene Jean Connin Seabrook, MD \r\nAgricultural Mechanization and Business \r\nBrian Wade Hollffield _______ Chesnee, SC Leonard Elbert Newman, Jr. ______ Sumter, SC \r\nAgronomy \r\nGuslavo Adotto Roosen ____ Caracas, Venezuela Jeffrey Duane Smith _____ Kings Mountain, NC \r\nAnimal Industries \r\nThomas James Hagood _____ Blythewood, SC Bernard L. Hamby _______ McCormick, SC \r\nShannon Rebecca Hail Pine Plains, NY Mary Edna Shir1ey Seneca, SC \r\nAquaculture, Fisheries, and Wildlife Biology \r\nKenneth Chadwick Ahman _______ Irmo, SC Stephen Winford Mitchell Anderson, SC \r\nWilson Kenneth Britton II Hollywood, SC William Christiaan Pollltzer ___ Hilton Head Island, SC \r\nClaude Parker Day Ill Rock Hill, SC Stephen Lee Potts Clinton, SC \r\nCynthia L. Dienemann Rockville, MD Darryl James Price Sumter, SC \r\nSean David Finley New Concord, OH Kevin Scott Reinecke Indialantic, FL \r\nCatherine Michelle Fulmer Columbia, SC Robert Earl Ridlehoover, Jr. Saluda, SC \r\nChar1es Allan Holcorrbe, Jr. Hartsville, SC Harold Hunter Robinson Ill Summerville, SC \r\nJulie Wilson Holling Charleston, SC Stanley Ernest Rogers Garnett, SC \r\nRobert Cole Hurt Winnsboro, SC Robby Gordon Sacora Moncks Corner, SC \r\nEntomology \r\nMary Anne Chicos _______ Chattanooga, TN +•Alison Horton _ ________ Clemson, SC \r\nHorticulture \r\nRobert Thomson Ball Ill, ______ Charleston, SC Gregory Allen Rogers ______ Westminster, SC \r\nWilliam Sta~ey Broome Abbeville, SC Jeffrey Bruce Sheehao Campobello, SC \r\nLouis Vincent Caggiano Ill Gaffney, SC David Jackson Smallridge Anderson, SC \r\nChristopher Daniel Dellamura Charleston, SC .. Kristy Elizabeth Thomason Florence, SC \r\nMichael Todd Hatchell Irmo, SC \r\nPackaging Science \r\nWilken Benjamin II ________ Hartsville, SC William Pritchard Gnann ______ Beaufort, SC \r\nTyler Martin Brewington Lancaster, SC Jennffer Lee Hughes Seneca, SC \r\nClement Hope Campbell Lexington, SC Russell Andrew Shepherd Georgetown, SC \r\nTonya Marie Coney Greenwood, SC Rodney Shane Taylor Ware Shoals, SC \r\nKirrberly Faith Foster Spartanburg, SC Franklin Chad Windham Lamar, SC \r\nCOLLEGE OF ARCHITECTURE \r\nJAMES FRAZIER BARKER, Dean \r\nBACHELOR OF ARCHITECTURE \r\nWayne Douglas Roberts Mars Hil, NC \r\nBACHELOR OF ARTS \r\nDesign \r\nIleana Teresa Caban. _______ Clemson, SC Tiffany Daunn Walker _______ Phoenix, AZ \r\nKristen Marie Stevenson Clemson, SC \r\nBACHELOR OF FINE ARTS \r\nAngela Leigh Felder ______ Charleston, SC +•susan Patricia Sigmon ______ Conover, NC \r\nKelly Elizabeth McClure Anderson, SC \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\n+ .. Todd Keene Mohler_ Fort Lauderdale, FL "
    },
    {
        "page_number": "22",
        "text": "BACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nEdward Allen Boyd, Jr. _____ Spartanburg, SC \r\nMarl< Kennlt Brumagim Oakton, VA \r\nFrederick Arthur Fiscus ______ .Lexington, KY \r\nAaron Brett Gandy Charleston, SC \r\nGregory Alan Bruno Manalapan, NJ Lance Richard Gooding Hampton, SC \r\nMichael John Carroll Middletown, NY Gregory Richard Leonard Greenville, SC \r\nDouglas Wesche Childs Raleigh, NC Matthew John Ninnemann Gantlrills, MD \r\nWilliam Arthur Fenstermacher Aiken, SC Christopher Vincent Sneed Greenville, SC \r\nDesign \r\nAaron Hamilton Arnett ---- -~_ Aiken, SC Tracy Kristine Lee Conway, SC \r\nAmanda Page Ballard Greenville, SC Marl< Edward Moehring Greenville, Ml \r\nJames Frederick Burns Greenville, SC Kimberly Dechelle Montgomery ___ Columbia, SC \r\nVivek Dayal Jaipur, India John Shea Pendergrass Anderson, SC \r\nPaige Elizabeth Gray Easley, SC Elena Margaret Soto Orlando, FL \r\nHeidi Maria Huber Kinnelon, NJ Richard Caughman Touchstone ___ Greenville, SC \r\nWilliam Wade Huss, Jr. Dillon, SC \r\nCOLLEGE OF COMMERCE AND INDUSTRY \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nMargaret Walters Boette ______ Columbia, SC Jeffrey Keith Mullis. _______ Hickory, NC \r\nCynthia Lynn Leaphart Leesville, SC Juan Manuel Servy Alicante, Spain \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nPaige Alisa Aimers_~----- Summerville, SC Ganesh Viswanathan lyer ______ Greenville, SC \r\nSteven Jeffrey Bagwell Charlotte, NC Matthew John Jarom Chicago, IL \r\nJane Catherine Banks Columbia, MD Lauri Lidstone Klugh Peterborough, NH \r\nVanessa Denise Bar1<sdale Atlanta, GA • Anthony McConnen Knight Clemson, SC \r\nCathy A. Barlow Charlotte, NC + .. 'Emily Anne McKale Clemson, SC \r\nChristine Denise Baugher Liberty, SC Yvonne Lynette Mitchell Charleston, SC • \r\nRobert Perry Bradham Charleston, SC Nnarndi Ben Nwokocha Gnugu State, Nigeria \r\nAHred Wilburn Brown Anderson, SC +' \"Cassandra Elaine Poston Florence, SC \r\nAmy Marie Bryant Iva, SC Kimberly Ann Prenitzer Miami, FL \r\nKathryn Walker Buck Bellport, NY William Kyle Riser Mauldin, SC \r\nJenntter Carol Cook Clemson, SC Amy Kristina Rogers Columbia, SC \r\n+ .. Robert Joseph Dennis, Jr. Pickens, SC Laurie Ann Scott Boise, ID \r\n'Michael Donald Dowling East Peoria, IL David Herbert Seifert Campobello, SC \r\nValerie Cora Farr Newberry, SC Michael Bradley Slates Raleigh, NC \r\nStephen Jesse Foster, Jr. Anderson, SC Errol Ashnell Thomas Edgefield, SC • \r\nJonathan Irvin Godwin Lake City, SC ' Lisa Ann Tracy Springfield, VA \r\nRobert Trenton Hackle Easley, SC Beth Marie Wigington Tamassee, SC \r\nJeffrey John Har1<awik, Jr. Gennantown, MD Ming Fang Williams Clemson, SC \r\nBrian John Higgins Delhi, NY William John Wylie Mt WoH, PA \r\nDorothy L. Hofmann Hilton Head Island, SC \r\nEconomics \r\nDavid Allen Abel ~-------~~ Irmo, SC Mary Hollis Holmes•~~------~ Atlanta, GA \r\nThomas Kevin Beck Clemson, SC Patrick O'Connor McSharry Greenville, SC \r\nBryan Taylor Blackwood Sparlanburg, SC Alex Joseph Newton Greenville, SC \r\nRobert Noel Bourque Delray Beach, FL Marl< Thomas Owens Fountain Inn, SC \r\nJonathan Thomas Davis Lithonia, GA Victoria Marie Par1<s Easley, SC \r\nWilliam Andrew Dowling Sumter, SC Robert Christopher Plate Clover, SC \r\nJeffrey Holland Fowler Powdersville, SC Laurie Marie Smith Powdersville, SC "
    },
    {
        "page_number": "23",
        "text": "Flnanclal \r\nSteven Newhall Babcock Anderson, SC \r\nScott Christopher Baka North Potomac, MD \r\nBrian Kipper Bell Fountain Inn, SC \r\nJeffery Daren Biggers Salisbury, NC \r\nJason Randall Blodgett Spartanburg, SC \r\n·christopher Alan Bradley Atlanta, GA \r\n.. Lynn Hinton Cole Seneca, SC \r\nMark Joel Ewell Greer, SC \r\nMichael Shaw Finkelstein Spartanburg, SC \r\n•James Brett Freeze Anderson, SC \r\nNicholas Kurt Goetze Watkinsville, GA \r\nKenneth David Hiott Williamston, SC \r\nDavid Ammons Holstein Batesburg, SC \r\nRebecca Harris Jackson Camden, SC \r\nAlexander Christopher Knott Greeley, CO \r\nKristin Gay Kuhlke Richmond, VA \r\n·charles Christian LaFleur Anderson, SC \r\nJohn Garnett Lawton IV Lewisville, TX \r\nLuis Ernesto Lopez-Craik __ San Salvador, El Salvador \r\n.. Gaile Quick Marlowe Lakewood, CA \r\nlndustrlal \r\nJefferson Albert Blanton, Jr. ___ _ Charleston, SC \r\nAndrew Alexander Brown Taylors, SC \r\nChristopher Scott Crowder Clinton, SC \r\nMichael Bartlette Hunter Newberry, SC \r\nAlan Gordon Lavore Julian, NC \r\nTimothy Brian Littleton Clinton, SC \r\nManagement Gerald Rudolph Massey 111. _____ Alpharetta, GA \r\nWalter Lee Matkovich Jamestown, SC \r\nRobert Lennon Mclean Orangeburg, SC \r\nBrant Michael Meleski Athens, TN \r\nBeth Anne Miele Bayport, NY \r\nChristopher Patrick Monson Columbia, SC \r\nMichael Joseph Mullins Beckley, WV \r\nJohn Dennis Mulvey Charleston, SC \r\nDeidre Nicole Palmer Anderson, SC \r\n.. Michael Lawson Pierce High Bridge, NJ \r\nThomas Kennedy Player Bishopville, SC \r\nJoseph Howard Powers Columbia, SC \r\nSoraya Gay Rasheed Joliet, IL \r\nMichael Martin Salerno Middletown, NJ \r\nCynthia Ann Skelton Anderson, SC \r\nLawrence Edward Smith, Jr. Summerville, SC \r\nMary MagnoUa Stover Westville, SC \r\nHarvest Lucas Tucker Warrenton, GA \r\nMichael Eric Van Daele Lexington, SC \r\nJoseph Waters Wilson Barnwell, SC \r\nManagement \r\nLorraine Antoinette Nealy _____ Riverdale, GA 1 \r\nDebra Lynn SlarJllak Easton, PA \r\nChad Barrett Tennant Lynchburg, VA \r\nRobert Henry ThorJllSOn II Pendleton, SC \r\nEdward Park Williams Summerville, SC \r\nManagement \r\nKevin Clay Adams ___ _ _____ Seneca, SC Lance Gordon Hart Greenville, SC \r\nDean Thomas Berry Greenville. SC Bertram Alexander Heffernan Centereach, NY \r\nMelissa Ann Boren Central, SC William Frari< Hosea, Jr. Greer, SC \r\nKimberley Ann Brannon Anderson, SC Dane Scott Hunter Newberry, SC \r\nMichelle Leigh Bridges Greenville, SC Charles LeHoward Johnson Pickens, SC \r\nThomas Edward Brown Greenville, SC Raymond Paul McDowell Butler, PA \r\nTeresa Baylor Bryant Spartanburg, SC Bradley Wayne McElhannon Anderson, SC \r\nStephanie Carol Cannon Clemson, SC Jeffrey Chad Miller Atlanta, GA \r\nMarie Annette Cantrell Greer, SC Mary Buckner Morgan Fulton, MO \r\nSamuel Edwin Clamp Leesville, SC Heather Ann O'Shea Hilton Head Island, SC \r\nDavid James Cody Mauldin, SC Bruce Pasquarella Chester Springs, PA \r\nStephen Edward Derriso Huntsville, AL Jeremy Charles Petty Raleigh, NC \r\nChristopher Daniel Duncan Taylors, SC Jonathan Blake Pittman Greenville, SC \r\nSteven Craig Durbin Charleston, SC Robert Bryant Porter Sumter, SC \r\nSharon Beck Eberhart Anderson, SC Ginger Lynn Putnam Greenville, SC \r\nJohn Brandon Farris lnno. SC Alan Duane Smith Spartanburg, SC \r\nKenneth Jay Fuqua Aiken. SC Terry Allen Smith Clemson, SOI \r\nVincent Gagliardi Freehold, NJ Kevin John Smythe Oswego, NY \r\nRobert Glen Garrett Central. SC ... Kellie Christine Tagtmeyer Seneca, SC \r\nAmy Christine GlyrJllh Fair Play, SC Wayne Luther Taylor, Jr. Sumter, SC \r\nWilliam Kelley GomiUion Aiken, SC Charlotte Taylor Thomason Salisbury, NC \r\nKristine Marie Greene Hartsville, SC Aaron Bret Tolbert Easley, SC \r\nTyler Rochelle Greer Greer, SC •Mark A. Turner Seneca, SC \r\nScott Anthony Hallman Greenville, SC Lou Ann Waldrop Newberry, SC .. Ted Harry Hamm Columbia, SC Frank Rainsford Yarborough ___ Edisto Beach, SC \r\nBrian Adrian Harrison Pacolet, SC •Andy Bee Young IV Clinton, SC "
    },
    {
        "page_number": "24",
        "text": "Marketing \r\nVictoria Lynn Ashley -~---- Salisbury, MD Pamela Joan Keller _ _ ______ Easley, SC \r\nVincent Betts Atkinson, Jr. Piedmont, SC James M. Matoska Jackson, NJ \r\nStephanie Lynne Bradley Glassboro, NJ Clayton Baldwin McCullough Columbia, SC \r\nTeresa Lyn Brady Spartanburg, SC Joseph Anthony McDonald Marietta, GA \r\nMeredith Leigh Brown Columbia, SC Alicia Maria Miyares Spartanburg, SC \r\nMichael John Canata Westfield, NJ •valerie Jeanne Parker Tuckerton, NJ \r\nDavid Reid Clark Fort Mill, SC Steve Raymond Pierce Houston, TX \r\nWlliam Dean Collar Ill Lexington, SC Don Ricky Richardson, Jr. Prosperity, SC \r\nThomas Denver Craft Anderson, SC Edward Joseph Rose Gaithersburg, MD \r\nKenneth Richard Davenport II Charleston, SC Kristin Amanda Sandeen Largo, FL \r\nJonathan David Dickard Pickens, SC Charles Louis Settle Inman, SC \r\nRobert Thomas Doolittle _Delray Beach, FL John Paul Skandamis Goose Creek, SC \r\nCharles Marvin East IV Charlotte, NC .. Stephanie Therese Sloka Greer, SC \r\nDerek Brian Gantt Greenwood, SC Elizabeth Ann Strassel Greensboro, NC \r\nTucker Garrett Graves Jefferson City, MO Jessica Paige VanDyke Greenville, SC \r\nJennifer Hargreaves Lexington, SC Kriston Jo Vinson Easley, SC \r\nFem Denise Hughes Columbia, SC ' Steven Lee Wilson Columbia, SC \r\nGlenn Leon Janosky Newton, NJ Arny Gayle Young Boca Raton, FL \r\nRoger Wade Juntilla Tewksbury, NJ \r\nTextile Chemistry \r\nTyler Andrew Grant _______ Hyde Park, VT Judy Pei-Te Sun ________ Greenville, SC \r\nTextile Management \r\nDarren Daryle Calhoun ______ McCormick, SC \r\nMonica Renee Darby Camden, SC \r\nKent Albert Kingsley -,---,---------0.,.,.-Fort Mill, SC \r\n•Anthony Wayne Kubik, Jr. Walterboro, SC \r\nAlma Michele Evans Darlington, SC Gregory Philip Maus Anderson, SC \r\nJennijer Elaine Gilliland Columbia, SC Alfonzia Cardell Thurman Belton, SC \r\nCOLLEGE OF EDUCATION \r\nBOBBY GUINN WIXSON, Acting Dean \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\nCassandra Lynne Bauer ___ _ _ _ Seabrook, TX Susan Elaine Pickens -----~~Anderson, SC \r\nKelly Suzanne Bearden Seneca, SC Charlene Raye Smeltzer Myrtle Beach, SC \r\nKristina Conaway Georgetown, DE Stephanie Christen Spears Summerville, SC \r\n•Diana Christine Graham Simpsonville, SC J. Marie Stanzione North Andover, MA \r\nKate Elizabeth Graham Rockville, MD Juliana Shirley Vickery Seneca, SC \r\nShawnta Anise Haynes Lugoff, SC Kattvyn Marie Waataja Fort Mill, SC \r\nMelanie Lynn Hicks Union, SC Christa Belle Waddell Hendersonville, NC \r\nStephanie Ann Hobbs Lexington, KY Kathleen Ann Walker Glenwood, MD \r\nBonnie Blue Owens West Union, SC \r\nElementary Education \r\nAngela Dawn Ammons _______ Camden, SC \r\nMelissa Elaine Buck Saluda, SC \r\n•Lisa Oliver Day .-,-_________ Six MUe, SC \r\nAllison Tracy Fabio Pauline, SC \r\nKimberly June Bunch Charleston, SC Francina Gerald Loris, SC \r\nTamara Lynn Burden Anderson, SC Elise Marie Giattino East Patchogue. NY \r\nMonica Ann Buttermore Atlanta, GA Lisa Gayle Gilleland Six Mile, SC \r\n•Monica Leigh Caddell Easley, SC Sheri Lynn Harden Seneca, SC \r\nKimberly Colleen Chastain Walhalla, SC Martha Susan Hautala Wilmington, DE \r\nAllyson Church Greenville, SC Barbara Lynn Hendricks Charlotte, NC \r\nAllison Suzanne Clardy Seneca, SC Ethelyn Gail Hinson Lilburn, GA \r\nDana Paige Clark Greenville, SC ·Ansley Louise Howren CartersvUle, GA \r\n•Patricia Helen Cobb Mountain Rest, SC Ronette Marie Johns Chapin, SC \r\nKimberly Anne Cockfield Belton, SC Deborah Lynn Johnson Camden, SC .. Kimberly June Colvin Lugoff, SC Serena Pace Kimbrell Anderson, SC \r\nLeann Robertson Corbin Greenville, SC Deanna Therese Kline Absecon, NJ ... Regina DeLynne Cox Easley, SC Kimberly Anne Leviner Fayetteville, NC \r\nAshley Elizabeth Dameron Florence, SC Laurie Genevieve Love Atlanta, GA "
    },
    {
        "page_number": "25",
        "text": "Elementary Education (continued) \r\nMeredtth Elaine Lyons ______ Westminster, SC Rebecca S. Reagan Blythewood, SC \r\nCandy Maria Maners Pelzer, SC Mary Elizabeth Ross Six Mia, SC \r\n•Kira Joan Martin Myrtle Beach, SC Ellison Elaine Rushton Greenville, SC \r\nPatricia Dodgens Masters Pickens, SC Shannon Marie Schaal Greenville, SC \r\n•Andrea Jean McClain Greenville, SC Jennifer Elizabeth Schramm Jacksonville Beach, FL \r\nTonja Lee McClinton Anderson, SC Gina Lynn Sexton -- Beaufort, SC-; \r\nBrittany Anne Meister Naples, FL Tonia Scott Simpson Anderson, SC \r\n•Jennifer Dione Moore Easley, SC Amy Durelle Turnipseed Travelers Rest, SC \r\nKimberly Dawn MuUigan Liberty, SC •Erin Alicia Webb Fayetteville, NC \r\n... Susan Crane Orr Six Mile, SC Tammy Teresa Whtten Fair Play, SC \r\nElizabeth Ann Pettett Greenville, SC •Amanda Lynn Willis Fountain Inn, SC \r\nTerra Karen PoUard West Pelzer, SC Wendy Denise Winborn Rock Hil, SC ' \r\nSecondary \r\nWilUam Scott Bacon~------ Columbia, SC \r\nPaige Lunceford Baker Greenville, SC \r\nAngel Goldsmtth Blackston Anderson, SC \r\nAlison Leann Claytor Williamston, SC \r\nRandolph Charles Ewart Columbia, SC \r\nTracy Michelle Freeman Piedmont, SC \r\nJane Ann George Liberty, SC \r\nJeffrey Walker Gravely Greenville, SC \r\nSherry Sue Gurley Belton, SC \r\nHolly Renee Hudson Greer, SC \r\nJesse Lynn Hutchinson Cayce, SC \r\nAngela Beth Jones Landrum, SC \r\nEducation \r\nAmy Melissa Long Fountain Inn, SC \r\nKelly Susan Miller Aiken, SC \r\n••Joseph Edmond Paddenburg ___ Martinsville, VA \r\n+ ... Kelli Marie Petty Heath Springs, SC \r\nReginald Wayne Phillips Pageland, SC \r\nJennner Dianne Rivers Camden, SC \r\nMelissa Anne Schaefer Jacksonville, FL \r\nMargot Mala Shaw Columbia, SC \r\n•Tracy Lynn Ward Aiken, SC \r\nJessica Ann Warren Potomac, MD \r\nEri< Carsyt Yost Cannel, NY \r\nSpecial Education \r\n... Candace Jarrette Hardin _ _ _ Winston-Salem, NC Jennner Martin Medgyesy ______ Easley. SC \r\nBACHELOR OF SCIENCE \r\nGraphic Communications \r\nDavid Marion Beam II _ _ _____ Cherryville, NC Kevin Scott O'Brien _ _ _____ Damestown, MD \r\nPatricia Lynn Beavis Sea Girt, NJ Tricia Lynn Page Lancaster, SC \r\nDana Marie Began Rock HiU, SC •Alison Linn Ramsay York, PA \r\nJennifer Rochester Church Greenville, SC Jon David Rayle Columbia, SC · \r\n•christen Lynn Clarkson Tupelo, MS Jeffrey Vinson Salter Morganton, NC \r\nSusan Theresa Fennell Clemson, SC Robert Bradford Schwartz Florence, SC \r\nRobert Wyatt Hunter Summerville, SC Wendi Denise Simmons Edgefield, SC \r\nAndrew Wayne Killian Aiken, SC •Todd Andrew Skidmore Silver Spring, MD \r\nNorman Bruce Mcleod Glen Ann, MD •Homer Montgomery Thrailkill Ill Holly HUI, SC \r\nIndustrial Education ... Patrick Glen Adams ______ Anderson, SC \r\nBradley Don Grooms Camden, SC \r\nKevin Charles Hampton Ltttle Mountain, SC \r\nMathematics \r\nPage Renee Cantrell,.....,.--..,,----.,- Abbeville, SC \r\nChristopher Randoll Colwell Miamisburg, OH \r\nMickey Ray Edmonds Joanna, SC \r\nBradley Neil Grilftth Pendleton, SC \r\nJohn Samuel Hart Greenville, SC \r\nJon Christopher Nobles ___ North Myrtle Beach, SC \r\nTroy Austin Thompson Clover, SC \r\nTeaching \r\nAndrea Marie Martin ______ _ Gainesvile, GA \r\nRay Allen MiUer Clemson, SC \r\n.. Ebony Keshia Sims Columbia, SC ' \r\nStephanie Rae Weaver Landrum, SC \r\nScience Teaching \r\nWilliam Edward Bonsky ______ Rochester, Ml Lauren Doreen March ___ _ ___ Beaufort, SC \r\nCart Thurman Cromer Greenville, SC Deanna Marie Robert Walhalla, SC \r\nRichard Dean Garrick Easley, SC William Ernest Teal, Jr. Seneca, SC \r\nMary Elisa Johnson Roanoke, VA David Ca\"lJbell Tho rs land Liberty, SC "
    },
    {
        "page_number": "26",
        "text": "COLLEGE OF ENGINEERING \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF SCIENCE \r\nAgrlcultural Engineering \r\n(Agricultural Engineering is jointly administered by the College of \r\nAgricultural Sciences and the College of Engineering.) \r\nJohn Maynard Clemens Bluffton, SC Jackie Wayne Dam10n Robbins II ____ Ruston, LA \r\nWillie Wendell Linder, Jr. Columbia, SC \r\nCeramic Engineering \r\nChristopher Don Bishop _ ___ --,.,.,--~. lnman , SC \r\nEdward J. Bonneau Worthington, OH \r\nChristopher Robert Greene _____ Tega Cay, SC \r\nMorris Gamble Hall, Jr. Mauldin, SC \r\nCindy Kay Brown West Columbia, SC Yovona Faye Hopkins Estill, SC \r\nMichael Christopher Brown Bohemia, NY John Henry Jaquish Washington, DC \r\nRobert Charles Brown Spartanburg, SC Thomas Aaron Martin Seneca, SC \r\nRoxsand Denice Brown Columbia, SC Cameron Jolley McCraw Gaffney, SC \r\nLance Townsend Burnett North Augusta, SC •Todd Richard Miller Ann Arbor, Ml \r\nRussell Harris Clark Abbeville, SC Christopher Rex Stephens Walhalla, SC \r\nAlan William Davis Clemson, SC James Richard Waldrop II Greenville, SC \r\nCarltto Namoc EstO<JJia Charleston, SC Jeffrey David Youn Spartanburg, SC \r\nJoseph Daniel Gowan, Jr. Ware Shoals, SC \r\nChemlcal Engineering \r\nMark Daniel Holden _________ Inman, SC •••Allan Pearson Turner ______ Winnsboro, SC \r\nClvll Engineering \r\nJefferson Pierce Ackerman ____ Charleston, SC Maria Sullivan Maney ______ Summerville, SC \r\nBrandon Michael Bailey Anderson, SC Bradley Eugene Means Bethlehem, NC \r\nJames David Blume Greenville, SC Geraldine Supan Monroy Goose Creek, SC \r\nRichard Earl Boston Hanahan, SC Michael David Newman Rock Hill, SC \r\nJeffrey Franklin Buice Gaffney, SC Scott Matthew Niesen Brentwood, TN \r\nTimothy Wayne Carr¢ell Easley, SC Joseph Bryant Nixon Clinton, SC \r\nGregory James Canivan Glastonbury, CT Christopher Marc Parypinski Columbia, MD \r\nJeffrey Carl Coleman Cortlandt Manor, NY Charles James Pellerin Annapolis, MD \r\nWilliam Logan Coleman Ill Columbia, SC Michael Albert Perrotta Upper Marlboro, MD \r\nBrent Thomas Connelly Prospertty, SC Samuel Mark Price Clover, SC \r\nElizabeth Ann Crosby Farmington Hills, Ml Sterling James Pye, Jr. Columbia, SC \r\nJohn Clarke DeHart Newberry, SC Arthur Henry Reed Erie, PA \r\nMurray William Dodd Greenville, SC Brent Alan Richardson Prospertty, SC \r\nMatthew Clayton Driggers Dunwoody, GA Joey Duane Riddle Newberry, SC \r\nChristopher Eric DuBois Charlotte, NC Stephen Earl Roberts West Point, GA \r\nJason Philip Eppley Tigerville, SC Randolph William Rogers Hanahan, SC \r\nAnthony Wayne Fallaw Monetta, SC Richard Jay Rogers II Lexington, SC \r\nKristina Elizabeth Franson Holliston, MA John Cope Sanders Greenwood, SC \r\nPamela Constance Fusonie Greenville, SC George Athanasios Sembos Columbia, SC \r\nBrian David Gray Pawleys Island, SC Brandon Thomas Sharp Fort Washington, PA \r\nChad Warren Hawkins Newberry, SC David Bruce Shehan Gaffney, SC \r\nMichael H. Hennessey East Greenwich, RI Nicholas Daniel Stanley Savannah, GA \r\nAndrew Slater Hill San Diego, CA William Ernest Sykes, Jr. Chesapeake, VA \r\nEugene Douglas Hinkle Pickens, SC Darrell Ray Webb Alcolu, SC \r\nHerman Ashley Johnson Elgin, SC Albert Simpson Welch, Jr. Florence, SC \r\nJeffrey Can Jordan Columbia, SC Eric Lewis Whtte Charleston, SC \r\nSean Alexander Joyce Alexandria, VA Robert Scott Williams Greenville, SC \r\nDoyle Devon Kelley, Jr. Savannah, GA Sally Ann Wood Middletown, OH \r\nJeffrey Wayne Laney Lancaster, SC Scott Thomas Wyatt Marietta, GA \r\n•paul Damian Larger Lexington, KY Tracy Nicole Zlock Dover, DE \r\nComputer \r\nDennis Edward Anderson ---~~~ Holly Hill, SC \r\nAlan Francis Ayres Surfside Beach, SC \r\nBrent Andrew Banks Greenwood, SC \r\nChristopher Matthew Cloninger Gastonia, NC \r\n•Robert Kent Estep Myrtle Beach, SC \r\nChad Eric Fenske Greenville, SC \r\nEngineering \r\nMarsha Am Gladney _______ Winnsboro, SC \r\nJon Randal Harmon Charleston, SC \r\nThomas Michael Lynch Goose Creek, SC \r\nRayna Melissa Roach Simpsonville, SC \r\nBrian Curtis Snider McBee, SC \r\nJeffrey Scott Willis Spartanburg, SC "
    },
    {
        "page_number": "27",
        "text": "Electrlcal Engineering \r\n'Talbert James Black, Jr. Liberty, SC Roger Ray Lanegan Tryon, NC \r\nPatrick John Bowers Gaithersburg, MD Karen Leverette McCormid<, SC \r\nBradley Carhon Brown Dalzell, SC Jeffery Dale Loven BakersvUle, NC \r\n'Gerald Wayne Elmore Sumter, SC '\"Thomas Allen Lubeskie Charleston, SC \r\nJames Neil Eubanks, Jr. Betton, SC Kevin Andrew Lynn Easley, SC \r\nEdward Richard Glasgow Orlando, FL 'Daniel Alva Mast, Jr. Spartanburg, SC \r\nTamra L.ashan Grant Georgetown, SC Thorsten Otto Erwin May ___ Schweinfurt, Germany \r\n'William Christopher Greenwood ___ Camden, SC Jonathan Blair McGahey Anderson, SC \r\nJared Peebles Grimes Towson, MD Robert Bryan Mobley Warner Robins, GA \r\nPravin M. Gulrajani Marion, SC '\"William Martin Riddle Greenville, SC \r\nKenneth Frederick Hause Camden, SC Charles H. Sandifer V Florence, SC \r\nCharles Brian Hoopingarner Auburndale, FL Peter Sedor Berkeley Heights, NJ \r\nPerry Allen Hopkins Rockwell, NC Hosea Lester Suber, Jr. Greenville, SC \r\nFauana Islam Dhaka, Bangladesh Andrew Jesse Van Evera Vienna, VA \r\nPaul Andrew Jones, Jr. Bowman, SC Mark Alan Woodrum Florence, SC \r\nEngineering Analysis \r\nPeter Mason Grett Ormond Beach, FL \r\nlndustrlal \r\nSharon Travonne Allen ____ St Helena Island, SC 1 \r\n'Shelia Kay Barnett Jackson, KY \r\nWesley Howard Beck Winston-Salem, NC \r\nJames Vernon Davis Ill Columbia, SC \r\n'James Scott Deal Spartanburg, SC \r\nMichael Anthony DiNapoli Seneca, SC \r\nKevin Stewart Fennington Anderson, SC \r\nTiffany A. Gilliam Columbia, SC \r\nMechanical \r\nPamela Jean Alford ,.-------___,~Caltton, NJ \r\nMichael O'Neal Arant Townville, SC \r\n'Elizabeth Claire Bailey Aiken, SC \r\n+'Brantley Ferrell Bain Rock HiU, SC \r\nChristopher Todd Bayne Greenwood, SC \r\nRobert Jeffrey Black Honea Path, SC \r\nMonty Dwayne Blackmon Lancaster, SC \r\nTracy Ann Borkenhagen HartsvUle, SC \r\nErnest Chandler Bostic Anderson, SC \r\nKenneth Brent Burdette Woodruff, SC \r\nVirginia Davies Calvert Fairfax, VA \r\nMichael Shawn Carnes Phoenixville, PA \r\nTrent Logan Carpenter Anderson, SC \r\nDavid Neal Carter Candler, NC \r\nBryant Edwin Caveness Aiken, SC \r\nRay Daniel Drinnon, Jr. Williston, SC \r\n\"Jon Scott DuBro Dayton, OH \r\nCharles Thomas Fleetwood Ill Seaford, DE \r\nKun Wagner Fuller Roswell, GA \r\nTodd Alexander Gillespie Greenville, SC \r\nChristopher Michael Golf Eastover, SC \r\nJames Carson Goodson Columbia, SC \r\nScott Christopher Graham Easley, SC \r\nMichael Shane Grumbles Fort Mill, SC \r\nRobert Scott Grumbles Fort Mill, SC \r\nBrian Christopher Guzik Piedmont, SC \r\nGrant Alan Hennessey Pasadena, MD \r\nEngineering \r\n+'\"Duane Carlos Graves-----~- Atlanta, GA \r\nMatthew Gordon Harold Boca Raton, FL \r\nWinston Henry Hermann, Jr. Columbus, OH \r\nAngelia Francine Ladd Easley, SC \r\nAllan George Ouerubin Dillon, SC \r\nTravis Smith Robinson Cordova, SC \r\nRobert Donald Scheffler Goose Creek, SC \r\nEngineering \r\nJason Street Jackson _____ __ Columbia, SC \r\nDerrick Dale Jenkins Wando, SC \r\nChristina Faith Joaquin Ladson, SC \r\nEdgar Phillip Johnson Greenwood, SC \r\nMichael John Johnson Painted Post, NY \r\nBruce Christian Ko Baltimore, MD \r\nJoseph Nevin Matutina Goose Creek, SC \r\nTimothy Edgar Maurer Rock HiU, SC \r\nPatrick Erwin McGirt Columbia, SC \r\nRyan Christopher McMahon Leesville, SC \r\n+'Frederich Randal Naegele Winter Park, FL \r\n•Jay Woodrow Nordling North Augusta, SC \r\nColeman Clyde O.Vens Ill Mt Pleasant, SC \r\nNicholas Scott Peak Winnsboro, SC \r\nRoberto Jose Pereyo North Augusta, SC \r\nBilly Joe Phillips Pickens, SC \r\nThomas Stephan Phillips Pittsburgh, PA \r\nEdwin Barkley Pierce, Jr. Newark, DE \r\nThomas Edward Pool Greenville, SC \r\nCharlton Scott Rice Rock HiU, SC \r\nJames Michael Scott Wilmington, DE \r\nJason Lance Stegall Rock HiU, SC \r\nDibbon Keith Watters IV Aiken, SC \r\nDonald Eugene Wilson, Jr. Donalds, SC \r\n'Ray Lansing Wilson Ill Darlington, SC \r\nCraig Curtis Yoho Summerville, SC "
    },
    {
        "page_number": "28",
        "text": "COLLEGE OF FOREST AND RECREATION RESOURCES \r\nBENTON HOLCOMB BOX, Dean \r\nBACHELOR OF SCIENCE \r\nForest Products \r\nVincent Burnell Thomas ___ Kissimmee, FL \r\nForest Resource Management \r\nDwight Martin Hanks, Jr. ______ _,. Lugoff, SC \r\nTimothy David Hegler Kershaw, SC \r\nTimothy Brian Kirven Hartsville, SC \r\nParks, Recreation, and \r\n•steven Paul Artman Anderson, SC \r\nKetth Douglas Batson Easley, SC \r\nGregory Steven Boozer Batesburg, SC \r\nJames William Bradley Mt Pleasant, SC \r\nRobert Shelton Brookover IV ___ Virginia Beach, VA \r\nGarrett Cronin St Petersburg, FL \r\nJohn Durfee Greenville, SC \r\nJames Cloud Harden Ill Columbia, SC \r\nScott Bradley Kimmel Mt Sidney, VA \r\nArthur Millwee Klugh IV Anderson, SC \r\nGregory Palmer Luetjen _____ ___, Bethesda, MD \r\nTheodore Frank Mabry Waherboro, SC \r\nCalvin Timothy Sharp Summerville, SC \r\nTourism Management \r\n•Melissa Canup Mann Covington, GA \r\nRobert Brian McCaskiU Camden, SC \r\nJoseph Fowler Moseley Greer, SC \r\nTheron Jackie Palmer, Jr. Walhalla, SC \r\nTerri Lynn Riley Edgewater, MD \r\n••Michele Mary Sosnowski Allentown, PA \r\nGretchen Anne Tuchscherer _ Hihon Head Island, SC \r\nChristopher Mark Winkler Sarasota, FL \r\n+••Paul Stephen Wright __ Reading, Untted Kingdom \r\nCOLLEGE OF LIBERAL ARTS \r\nROBERT ALFRED WALLER, Dean \r\nBACHELOR OF ARTS \r\nEngllsh \r\nMurray Chad Abramson Florence, SC •Joseph Edward Muldrow Ill ______ Taylors, SC \r\nJames R. Anderson, Jr. Spartanburg, SC Lawrence Edward Nix, Jr. Seneca, SC \r\nLisa Christina Bogart Bethesda, MD James HoweU Palmer, Jr. Clemson, SC \r\nCharlotte Mildred Bruner Clemson, SC •Rhetta Ear1e Partin Pendleton, SC \r\nStacia Elaine Couch Greer, SC Lori Melissa Putnam Anderson, SC \r\nCharles Anthony Dendy, Jr. Piedmont, SC Emily Meigs Query Mooresville, NC \r\n••Thomas Johnson Dorris Ill Columbia, SC Eliza Car1eton Roberts Clemson, SC \r\nMatthew Lewis Drummond Greenwood, SC Christian Tayloe Scott Myrtle Beach, SC \r\n•Amy Alysia DuBose Ridge Spring, SC Stephanie James Shipley Greenville, SC \r\nRoseAnna Jewell DuBose Anderson, SC Lara Elizabeth Steffen Doylestown, PA \r\n•Karen Lee Fields Marietta, GA Karen Valerie Stepp Union, SC \r\nCalandra Trinette Harrison Columbia, SC Kathryn Kendra Taylor Johnsonville, SC \r\nChristopher Winslow Lockett ___ Woodbridge, VA Tommy Keith Thompson Dillon, SC \r\nRegina Mack Greenville, SC Jennner Robin Waddell Greenville, SC \r\nFrank Hitton McGiU Ill Kingstree, SC Alexander Kearney Ward Charleston, SC \r\nRobert Seabrook Moore Columbia, SC Heather Gale White Columbia, SC \r\nHistory \r\nDavid Alan Amberg Port Charlotte, FL Knowlton Davis Sanders ~-----Camden, SC \r\nCharles Anthony Dendy, Jr. Piedmont, SC Stephen Christopher Stephens Dillon, SC \r\n•David Andrew England Summerville, SC Marc Weston Taylor Denver, NC \r\nJohn Francis Flannigan Ill ___ Yorktown Heights, NY Brett Allen Turner Asheville, NC \r\n••Ellen Hartsfield Graben Clemson, SC William Jordan Ward Anderson, SC \r\nMalcolm Bums Hale, Jr. Charleston, SC Sandra Lynn Whitaker Tega Cay, SC \r\nEugene Joseph Maupai Ill Rumson, NJ \r\nLanguage and lnternatlonal Trade \r\nLisa Kathleen Aballo Columbia, MD Heather Marie Miller Greenwood, SC \r\nGarrett James Bamola Charleston, SC Scott Whelan Moulton Reading, PA \r\nPamela Anne Cafl1lbell Anderson, SC •0onna Elizabeth Murphy Greenville, SC \r\n•Hannah Carr Coker Jacksonville, FL •Frank George Seitz Ill Beachwood, NJ \r\n••Patricia Marie Hartmann Cranford, NJ Mar1and James Spicher ___ Altamonte Springs, FL \r\nMargaret Andrea Holtmeier __ Hitton Head Island, SC Karmin Heather Stephenson Greenville, SC \r\n• JennHer Gwen Kuck Roswell, GA Joseph Steven Wo~ Seminole, FL \r\nSuzanne Elizabeth McGarity Springfield, VA \r\nModern Languages •••Kathryn Louise McGuire Connor ___ Central, SC Sandra Cristina Femandez ___ Fort Lauderdale, FL \r\nPhllosophy \r\nBrian Thomas Kassa Spartanburg, SC "
    },
    {
        "page_number": "29",
        "text": "Polltlcal Science \r\nKevin John Ba~our ______ Laguna Beach, CA \r\nEric Andre Brown Florence, SC \r\nWMney Elaine Per1<ins ----- -=-- Chester, SC \r\nGlenn Gilbert Reese, Jr. Spartanburg, SC \r\nJames Frederick Burns Greenville, SC David Alan Smith Anderson, SC \r\nChristopher Jason De Serio Springfield, VA Eric Joseph Spadavecchia Sussex, NJ \r\nCameron Lee Dillard Spartanburg, SC Heath Gerald ThorJ'4lSOn Columbia, MO \r\nDouglas Soott Hardy Walhalla, SC James Michael Turner Newberry, SC \r\nKimberley Ann Koch Atlanta, GA Dawn Michelle Wechselberger Tokyo, Japan \r\nChristopher Todd Nolan Fairfax, VA Amy Elizabeth WMe Powdersville, SC \r\nHager Bur1<e Patton Mclean, VA \r\nPsychology \r\nAmy Louise Anders Columbia, SC •Rega Rachel Joseph _______ Houston, TX \r\nDavid Michael Bagley Columbia, SC Antonya Michelle Moore Seneca, SC \r\nElizabeth Weigel Broderick Piedmont, SC Cannen Quezada Nevel Phoenix, AZ. \r\nDelores Eugenia Campbell __ HiHon Head Island, SC Richard Joseph O'Malley Toms River, NJ \r\nChristalyn Paige Clements Sumter, SC Kathleen Patricia Patrick Medford, NJ \r\n.. Connie Jenine Covington Myrtle Beach, SC Jon David Payne Santa Clara, CA \r\nMeredtth Lynne Dickson Anderson, SC William Brent Shropshire Calhoun, GA \r\nMakel Lee Durham Anderson. SC Tisha Renee Thompson GranviUe, OH \r\nLisa Lynn Elrod Piedmont, SC Tyrone Walker Union, SC \r\nMelissa Diane Evatt Easley, SC Melissa Ruth WUliams West Columbia, SC \r\nKady Faith Jacobs-Moss __ St Thomas, Virgin Islands Heather Elizabeth Zwirek Wantage, NJ \r\nStephen Bryan Jenkins Westminster, SC \r\nSocio logy \r\nRodney Terrell Blunt _______ Pensacola, FL Emily Ann Howard _________ Fort Mill, SC \r\nLisa Rae Brady Orlando, FL Krista Lynn Kranze Longwood, FL \r\nVicky Melissa Bryant Pickens, SC M Mari Lyon Dale City, VA \r\nSoott Douglas Goss Liberty, SC Thomas Ryan Norris, Jr. Easley, SC \r\nEngle Leslie Hall Columbia, SC Lana Nicole Roberson Beaufort, SC \r\nSean Hallihan Ansonia, CT Kimbley Gay Srntth Piedmont, SC \r\nBlake Douglas Hooks Columbia, SC Janet Elizabeth Suiter Anderson, SC \r\nDOUBLE MAJOR \r\nEnglish and Phllosophy \r\n.. Cecilia Maria Herles Flanders, NJ \r\nGerman and History \r\nLisa Marie Branco ________ .Alexandria, VA •Russell David Lentz ________ Easley, SC \r\nPhilosophy and Psychology \r\nNora Mary Johnson ___ South Plainfield, NJ \r\nCOLLEGE OF NURSING \r\nOPAL SHEPARD HIPPS, Dean \r\nBACHELOR OF SCIENCE \r\nNursing •Teresa Cooley Billig _ _ ______ Easley, SC Scott Peter Lethi _ _______ =-- Easton, CT \r\n... Faye Thomas Blevins Anderson, SC Marcia Kaye Martin Bowersville, GA \r\nSharon Patrice Bostic WaUace, SC Joan D. Merchant Anderson, SC \r\nEvelyn Michele Clldwell Lexington, SC ... Suzanne Kennedy Misiaveg Greer, SC \r\n... Katora Pettigrew CarJ'4lbell Seneca, SC Crystal Lowery Montgomery Columbia, SC \r\nChristy Lynn Compton Westminster, SC Angela Rachelle Robinson Yor1<, SC \r\nKellie Elaine Crawford Anderson, SC Tammy Lee Roscoe Lexington, SC \r\n... Lydia McCor1<1e Dunaway Anderson, SC Malissa Rene Seger Fort Mill, SC \r\nJames Newton Goodson Ill Darlington, SC Nicole Lynn Selgrath Hatboro, PA \r\n••Jo Cooper Hazlehurst Walhalla, SC Cynthia Joan Signorino Morris Plains, NJ \r\nJoanne Adrienne Kattak Wayne, NJ Julie Ann Statler WheeMng, WV \r\nTheresa Lee Kelly Six MUe, SC Melanie Shedd Swords Clemson, SC \r\nJulianne Marie King Dunwoody, GA Gina Denise Taglieri Clemson, SC \r\nRenee Mattos Knox Easley, SC Natalie Lynn Whttlow Elberton, GA \r\nSheila Marie Langford Anderson, SC Lawrence Robert Wood 111 Pawleys Island, SC "
    },
    {
        "page_number": "30",
        "text": "COLLEGE OF SCIENCES \r\nBOBBY GUINN WIXSON, Dean \r\nBACHELOR OF ARTS \r\nBlologlcal Sciences \r\nJenntter Leigh Armstrong, _ ____ Columbia, SC \r\nSally Alice Bissada Charleston, SC \r\nMeMssa Marie Couler Spartanburg, SC \r\nMitzi Patricia Kremer ________ nusville, FL \r\nRamona Sophia Qureshi Lancaster, SC \r\nChristopher Scott Shelton Spartanburg, SC \r\nComputer Science \r\n• Jaroslaw Jerzy Zawislan __ Ontario, Canada \r\nGeology \r\nRegina Marie Komo Clemson, SC \r\nPhysics \r\nPatrick Trey Boykin _ _____ Taylors, SC \r\nBACHELOR OF SCIENCE \r\nBiochemistry \r\nJami Renee Anderson _ _ _ ____ Greenville, SC Bernard Julius McCullough. _____ Florence, SC \r\nBrett Randolph Lackey Clemson, SC •steven Craig Tucker Williamston, SC \r\nBlologlcal Sciences \r\nDouglas Dondell Bailey ______ St Stephen, SC \r\nNeal Edward Beeman Denmark, SC \r\nJohn David Latham _______ Milledgeville, GA \r\nTimothy Wayne McJunkin Greenville, SC \r\nAnthony Byron Bradley Atlanta, GA John Stephen McPhail II Seneca, SC \r\nLawrence Edward Bullard, Jr. Easley, SC Michael John Meade Summerville, SC \r\nErica Yolander Cheeks Lexington, SC •Brian Scott Owens Walhalla, SC \r\n•Todd Brian Elliott Columbia, SC Chris Anthony Perry Greenville, SC \r\nHenry Miles Faris Ill Greenville, SC Edgar Lowndes Ready IV Unionville, PA \r\nAngela Elaine Gallimore Seneca, SC Sarah Elizabeth Sims Parkersburg, WV \r\nDouglas Francis Geiger Charleston, SC John Clayton Taylor Medford, NJ \r\nElizabeth Ellen Hodgson Taylors, SC Denise Michelle Ward Columbia, SC \r\nDonald Mark Kem Sewell, NJ •Tracy Anita Wolff Clemson, SC \r\nChemistry \r\nTeresa Dianne Bagwell _______ Clinton, SC Lagette Marie Holmes ------~ Beaufort, SC \r\nReeshemah Lynn Beaty Chester, SC Dianne Michele LaRoche Charleston, SC \r\nRandall Chad Crittendon Hartwell, GA •Amy Suzanne Terrell Cincinnati, OH \r\nKevin Dwight Gripper Ridgeway, SC Geoffrey Todd Tetterton Camden, SC \r\nComputer Information Systems \r\nTommie Elaine Dean _______ Anderson, SC Darin Melville Rogers ________ McBee, SC \r\nWilburn Legare Hutto Ill St George, SC Christopher Todd Sherrer Greenwood, SC \r\nTracy Michelle Jolly Gaffney, SC \r\nComputer Science \r\n•Michael Scott Becker _______ Sumter, SC Perry Roland James ______ __ Lyman, SC \r\nWilliam Lawrence Chamblee Anderson, SC + •Malli<a Kapa! Calcutta, India \r\nMichael Lee Davis Liberty, SC Lawrence M. Ludwig West Islip, NY \r\nStephen Carl Dixon Gray Court, SC Robert Thurston Marr Clover, SC \r\nMark Aaron Essex Greenville, SC Brian Alexander Perch Falls Church, VA \r\nChristopher Darren Hoppe Nashua, NH Jana Anne Sinclair Walnut Creek, CA \r\nGeology \r\n•Nicholas Brandon Kidd ____ HartweN, GA \r\nMathematica I Sciences \r\n·sheryl Ann Elliott ________ Camden, SC Ronny M. Robinson _ _____ Spartanburg, SC \r\n•Neil Joseph Gibson Fernandina Beach, FL Jennifer Kay Sharps Summerville, SC \r\nDavid Edward Kitchen Mullins, SC Sandra Annette Short WaUace, SC \r\nBeth Evelyn Meehan Martinez, GA John Louth Welsh Ill Clearwater, SC \r\nMlcroblology \r\nKunvichet Chea. _________ Seneca, SC Michael Denril Hemingway ____ Brltton's Neck, SC \r\nBrantly Claude Collins Greenville, SC Leslie Hardin Hill Kingsport, TN \r\nLorna Ann Davidson Pickens, SC WiUiam David McDaniel Lake City, SC \r\nClint Alan Elliott Hemingway, SC Craig Steven Moser Anderson, SC \r\nPhysics \r\nJeffrey Wayne Blankenship --~~Sheldon, SC James Allen Glenn, _______ Charleston, SC \r\nJeffrey Lee Brock Greenwood, SC Paige Michelle Howard Mt Pleasant, SC \r\n•sarry Heath Cain Westminster, SC Charles Taylor Sutherland Ill Stoneville, NC "
    },
    {
        "page_number": "31",
        "text": "Pre-Professional StudlH \r\nJames Everett Hicks, Jr. _Fernandina Beach, FL \r\n•cum laude: A grade point ratio of 3.40 to 3.69 \r\n**Magna cum laude: A grade point ratio of 3. 70 to 3.89 \r\n***Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\n+Senior Departmental Honors: The students so designated have earned a B or better in the six to twelve credtts of \r\nhonors worl< at the upper division level in a program designed by their department. They have maintained a minimum \r\nGPA overall of 3.40. They appear in the line of march with an honors medallion on an orange and purple ribbon. "
    },
    {
        "page_number": "32",
        "text": "Historical State1nent \r\nClemson University is named for Thomas Green Clemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the Royal \r\nSchool of Mines in Paris (1828-1832). His early profession was that of a mining \r\nengineer; but circumstances diverted his interests into politics and the life of a \r\nsouthern planter, and he soon became an enthusiastic advocate of scientific agri\u0002culture. He had a career as a diplomat (charge d'affairs to Belgium, 1844-1852) \r\nand served as the first Superintendent of Agricultural Affairs in Washington (1860). \r\nAs a scientist he published numerous articles in the fields of mining, chemistry, \r\nand agriculture. His varied activities included his assistance in the founding of \r\nthe Maryland Agricultural College, his support of the Morrill Act, his leadership \r\nin South Carolina after the Civil War, and his part in founding Clemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, \r\na political figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an enrollment \r\nof 446. The first \"colleg_e prospectus\" announced only two four-year curricula, \r\nsupplemented by two two-year preparatory courses. Today the University has \r\nten major academic units. These are the College of Agricultural Sciences, the \r\nCollege of Architecture, the College of Commerce and Industry, the College of \r\nEducation, the College of Engineering, the College of Forest and Recreation \r\nResources, the College of Liberal Arts, the College of Nursing, the College of \r\nSciences, and the Graduate School. \r\nThe institution is an accredited member of the Southern Association of Col\u0002leges and Schools; various curricula are accredited by the National Architectural \r\nAccrediting Board, National League for Nursing, Society of American Foresters, \r\nAmerican Assembly of Collegiate Schools of Business, Accreditation Board for \r\nEngineering and Technology, and National Council for Accreditation of Teacher \r\nEducation. \r\nClemson is a land-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does exte~sive research at the main campus \r\nand at five agricultural experiment stations located in the State. The University \r\nis also heavily committed to a varied program of public service, including the \r\nwork of agricultural extension which has professional personnel located in each \r\nof the State's counties. "
    },
    {
        "page_number": "33",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    }
]