[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n12-22-1994\r\nClemson Commencement Program, December\r\n1994\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, December 1994\" (1994). Clemson Commencement Programs. 128.\r\nhttps://tigerprints.clemson.edu/comm_programs/128"
    },
    {
        "page_number": "2",
        "text": "CLEMSON UNIVERSITY \r\nGraduation Exercises \r\nDecember 22, 1994 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "Congratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for \r\nindividual graduates. Such expressions frequently detract from the \r\nrecognition due the next graduate in line. Your cooperation is respect\u0002fully requested. "
    },
    {
        "page_number": "4",
        "text": "Graduation \r\nThursday, December 22, 1994 \r\n11 :00 a.m. Littlejohn Coliseum \r\nORDER OF CEREMONIES \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation) \r\nInvocation \r\nRussell A. Johnson, Student Representative \r\nIntroduction of Trustees \r\nPresident Philip H. Prince \r\nConferring of Honorary Degrees \r\nPresident Philip H. Prince \r\nRecognition of the Deans of the Colleges \r\nProvost J. Charles Jennett \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident Philip H. Prince \r\nRecognition and Presentation of Awards \r\nClass of '39 Award for Excellence \r\nFrank W. Breazeale, Organist \r\nKevin Davidson, Soloist \r\nDr. C. C. Fain, Universny Marshal "
    },
    {
        "page_number": "5",
        "text": "HONORARY DEGREE \r\nCARROLL A. CAMPBELL, JR. \r\nDOCTOR OF LAWS \r\nThe Honorable Carroll A. Campbell, Jr., who has been called the maker of modern \r\ngovernorship in South Carolina, is the 112th person to occupy the Office of Governor \r\nof South Carolina. \r\nGovernor Campbell is only the second Republican in more than a century to attain \r\nthe state's highest office. He is the immediate past chairman of the National Governors \r\nAssociation, and the 1994 Almanac of American Politics calls him \" an exemplar of \r\ngoverning conservatism for the nation.\" \r\nGovernor Campbell has defined the modern governorship in South Carolina and \r\nhas positioned future governors to be major leaders in the development of public \r\npolicy for the state as well as leading the state on the national scene. He is one of the \r\nfew South Carolina governors to achieve a significant national reputation. \r\nBecause of his leadership in restructuring state government, the Office of Governor \r\nis a much stronger institution. Capping his three-year effort to reform state government, \r\nGovernor Campbell last year signed into law a sweeping overhaul plan that stream\u0002lined 79 agencies into 17, creating major new efficiencies and accountability measures. \r\nThe governor is recognized at home and across the nation as a leader in educa\u0002tion reform. He was a driving force behind the Cutting Edge, a major package of higher \r\neducation initiatives, and Target 2000, which is known for its revolutionary measures \r\nthat grant de-regulation and flexibility to our best-performing schools. \r\nMr. Campbell's emphasis on literacy and the challenges of the global economy \r\nprompted him to develop the Governor's Initiative on Work Force Excellence, which \r\nhas provided basic skills and literacy training at the work place to thousands of South \r\nCarolinians. \r\nUsing his home state and personal experience on these issues, Governor Camp\u0002bell championed the cause of \" lifelong learning\" as co-chair of the National Gover\u0002nors Association Task Force on Education and co-chair of the governors' historic edu\u0002cation summit with the president. In this role he was co-author - along with then\u0002Governor Bill Clinton - of the six ambitious goals that arose from that meeting with \r\nPresident Bush. \r\nThe governor's national leadership did not end when the goals were drafted \r\nand approved. He is former chairman of the National Education Goals Panel and past \r\nco-chairman of the National Council on Education Standards and Testing. \r\nHis person-to-person style as a salesman for South Carolina, traveling from the \r\nPacific Rim nations to the European Commonwealth, has helped produce an unprece\u0002dented $22 billion in capital investments for the state over the last seven and a half \r\nyears and more than 230,000 new jobs. The American Economic Development Council \r\nhonored him with its 1994 Excellence in Economic Development award for his hard \r\nwork and successful innovations. \r\nIn June 1992 Governor Campbell completed three years of intense, frequently \r\nsecretive negotiations with the German carmaker BMW, resulting in the company's \r\ndecision to build its first manufacturing plant outside Bavaria in Greer. It was the \r\nsingle largest economic development project announced in the United States that year. \r\nClemson University salutes Governor Campbell for a distinguished career of public \r\nservice to his state and nation. It is a distinct privilege for Clemson University to award \r\nthe honorary degree, Doctor of Laws, to Governor Carroll Campbell. "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nJOHN W. DRUMMOND \r\nDOCTOR OF LAWS \r\nThe Honorable John Drummond of Ninety Six, veteran state legislator, decorated \r\nWorld War II fighter pilot and successful business executive in Greenwood, has served \r\nin the General Assembly for the past 30 years. \r\nSenator Drummond has long been a well-respected legislator who is listened to \r\nby friends and colleagues alike around South Carolina. His legislative interests cover \r\na wide range of issues, including governmental reorganization. \r\nIn his prestigious position as chairman of the Senate Finance Committee and a \r\nmember of the Budget and Control Board, Senator Drummond oversees the annual \r\npreparation and passage of the Senate's version of the state appropriations bill. \r\nAs a public servant, he has sought to use his legislative influence constructively. \r\nSenator Drummond has worked well both with Democratic and Republican governors \r\nand legislatures. Not a fierce partisan, he is known as one who tries to put the public \r\ninterest above partisanship. \r\nHis political career was launched in 1965 with his election to the South Carolina \r\nHouse of Representatives. Two years later, he was elected to the state Senate and \r\nhas served continuously since then. \r\nAs a businessman in his native Greenwood, he owns and operates a BP oil distri\u0002butorship, serving as president of BP Oil Company and president of Greenwood Petro\u0002leum Company. \r\nDuring World War II, Captain Drummond served as a fighter pilot with the 405th \r\nfighter bomber group in England, France and Germany. His decorations include the \r\nDistiguished Flying Cross, two Purple Hearts, the Air Medal nine times, three Battle \r\nStars and the Presidential Citation. \r\nIn addition to the Finance Committee and Budget and Control Board, Senator \r\nDrummond also serves on the following: Fish, Game and Forestry Committee (first \r\nvice-chairman); Labor, Commerce and Industry Committee (first vice-chairman); Agri\u0002culture and Natural Resources Committee; Rules Committee; Interstate Cooperation; \r\nthe Operations and Management Committee; and the Reorganization Commission \r\n(chairman). \r\nSenator Drummond has received numerous honors and awards throughout his \r\ndistinguished legislative career. Recent ones include: induction into the Greenwood \r\nCounty Hall of Fame by Greenwood Area Chamber of Commerce (1992); recipient of \r\nthe Order of The Palmetto from Governor Carroll A. Campbell, Jr. (1992); named \r\nSenator of the Year by the S. C. Student Legislature (1993); dedication of The John \r\nDrummond Complex, Lander University (1994); dedication of the John W. Drummond \r\nEngineering Industrial Technologies Center, Piedmont Technical College (1994); named \r\nLegislator of the Year by the S. C. Student Legislature (1994). \r\nSenator Drummond has long been a good legislative friend to Clemson Univer\u0002sity and has served on the Clemson University Board of Visitors and held membership \r\nin IPTAY since 1949. \r\nClemson University holds Senator John Drummond's achievements and service \r\nto the people of South Carolina in the highest regard and wishes to express its deep \r\nand sincere appreciation for all he has done for this University through his years of \r\nservice in the General Assembly. In recognition of this and all he has meant to the \r\ncitizens of South Carolina, Clemson University presents the honorary degree, Doctor \r\nof Laws, to Senator John Drummond. "
    },
    {
        "page_number": "7",
        "text": "HONORARY DEGREE \r\nJOSEPH A. SHIRLEY \r\nDOCTOR OF HUMANITIES \r\nClemson alumnus and benefactor Joseph A. Shirley is a Clemson man in the \r\ntruest sense of the word. \r\nBorn in rural Greenwood County, he arrived at Clemson as a student with a \r\nstrong desire for an education. Mr. Shirley worked his way through four years of \r\ncollege, graduating in 1940 with a Bachelor of Science degree in textile chemistry. \r\nHe used his Clemson experience to enjoy professional and financial success. \r\nKnown as Col. Shirley to his many friends in the Clemson family, he served his \r\ncountry for 30 years in the Army. During World War II he parachuted into Normandy \r\nand the Netherlands as an airborne infantry commander. He later served as a nuclear \r\nweapons officer. \r\nIn a quiet and unassuming way, Col. Shirley has become one of the largest \r\nbenefactors in Clemson's history. In 1981 he began making significant donations to \r\nthe Clemson University Libraries in honor of his mother, Callie Jones Shirley, naming \r\nthe endowment he established for her. \r\nToday, the Callie Jones Shirley Library has grown to more than $1.7 million, and \r\nmost of this has been given by Col. Shirley. The endowment which he created is \r\ncritical to the Libraries' ability to provide much needed information to its users. \r\nHe was one of the first million-dollar donors to Clemson . Being a true philanthro\u0002pist, he lives modestly in order to continue his support to the institution in which he \r\nbelieves - the institution that believed in him more than 50 years ago. \r\nService and loyalty are virtually synonymous with Joe Shirley, as they have been \r\nintegral parts of his life. He believes in Clemson and its mission and has been a \r\nconsistent supporter since his retirement from the military in 1970. \r\nMr. Shirley's support of the Libraries will forever benefit future generations of \r\nstudents, faculty and staff as well as the entire upstate community. His selection of \r\nthe library as an area worthy of support was insightful, as the library supports all \r\nareas of the University. His undeterred loyalty is also shown through his involvement \r\non the College of Liberal Arts Alumni Advisory Committee, the Library Development \r\nAdvisory Committee and the Clemson University Foundation Board of Directors of \r\nwhich he is an honorary member. \r\nFriends know him as an individual of great principle and conviction who invests \r\nhis resources only in organizations and causes in which he believes. Mr. Shirley has \r\nmade a lifelong commitment of service, generosity and loyalty to Clemson, and his \r\nunyielding support, concern and love for the University have been an important part \r\nof its continued success in the development arena. \r\nIn recognition of his remarkable life of service to his country and his support of \r\nand commitment to the highest academic quality of Clemson University, we present \r\nthe honorary degree, Doctor of Humanities, to Joe Shirley. "
    },
    {
        "page_number": "8",
        "text": "BOARD OF TRUSTEES \r\nBi I ly L. Amick, Chairman------------------------------------Bate sbu rg \r\nLawrence M. Gressette, Jr., Vice Chairman------------Columbia \r\nLouis P. Batson, Jr. -------------------------------------------Gree nvi I le \r\nJ. J. Britton ----------------------------------------------------------Su mt er \r\nW. G. Deschamps, Jr. --------------------------------------Bishopville \r\nHarold D. Kingsmore ----------------------------------------------Aiken \r\nLouis B. Lynn ---------------------------------------------------Co I um bi a \r\nPatricia H. McAbee------------------------------------------McCo rm ick \r\nThomas B. McTeer, Jr. ---------------------------------------Columbia \r\nBuck Mickel ----------------------------------------------------G reenvi lie \r\nJoseph D. Swann --------------------------------------------G reenvi lie \r\nAllen P. Wood ---------------------------------------------------Florence \r\nTrustees Emeriti \r\nFletcher C. Derrick, Jr. --------------------------------------Charleston \r\nWilliam N. Geiger, Jr. -----------------------------------------Columbia \r\nPau I W. McAliste r------------------------------------------------Lau re ns \r\nPau I Quattlebaum, Jr. --------------------------------------C harl esto n \r\nJames C. Self------------------------------------------------G ree nwood \r\nD. Leslie Tindal -----------------------------------------------Pinewood \r\nJames M. Waddell, Jr.----------------------------------------- Beaufort \r\nADMINISTRATIVE OFFICERS \r\nPhilip H. Prince---------------------------President \r\nJ. Charles Jennett-----------------------Provost and Vice President \r\nfor Academic Affairs \r\nManning N. Lomax----------------------Vice President for \r\nAdministration and \r\nSecretary of the Board \r\nof Trustees \r\nG. Jay Gogue ----------------------------- Acting Vice President for \r\nAgriculture and Natural \r\nResources and Vice \r\nPresident for Research \r\nDavid R. Larson--------------------------Vice President for \r\nBusiness and Finance \r\nGary A. Ransdell-------------------------Vice President for \r\nInstitutional Advancement \r\nAlmeda Jacks-----------------------------Vice President for Student \r\nAffairs "
    },
    {
        "page_number": "9",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, Trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, a \r\nsenior faculty member, with the college baton, described under University Regalia. \r\nFollowing the marshal is the college banner bearer. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the American \r\nCouncil on Education, are as follows: \r\nCollege Colors Dlsclpllne \r\nAgriculture Maize Agriculture \r\nArchitecture Brown Fine Arts \r\nLilac Architecture \r\nCommerce & Industry Copper Economics \r\nDrab Business \r\nEducation Light Blue Education \r\nEngineering Orange Engineering \r\nForest & Recreation Russet Forestry \r\nResources Sage Green Recreation Education \r\nLiberal Arts Dark Blue Philosophy \r\nWhite Letters & Humanities \r\nCream Social Science \r\nLibrary Lemon Library \r\nNursing Apricot Nursing \r\nSciences Golden Yellow Sciences \r\nStaff Purple & Orange Academic Support \r\nCollegiate faculty follow their banner in order of academic rank wearing academic costumes of \r\nmedieval origin. Those who have received their degrees from institutions outside the United States \r\nwear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions are specified \r\nby a uniform code maintained by the American Council on Education. Caps are black and are usually \r\nmortar boards with tassels. Doctors of Philosophy wear gold tassels usually of metallic thread; other \r\ndegrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also black, \r\nare longer than bachelors. Older gowns have sleeves that terminate at the elbow while those since \r\n1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like sleeves. The front is \r\nmarked by velvet panels and the sleeves are marked by three velvet bars. While most gowns are \r\nblack with black velvet, one variation is to replace black velvet with velvet in the discipline color. A \r\nsecond variation is a colored gown usually of the university's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awarding institution. \r\nFirst, degree level is signified by the size of the hood with bachelors' smallest, masters' larger, and \r\ndoctors' quite large and of a different shape. Clemson does not award hoods to bachelors. The width \r\nof the velvet trim also conveys the degree. Secondly, the degree is indicated by the color of the trim \r\nedging the hood to form the throat over the gown. The most frequently seen is dark blue, which \r\ndesignates the doctor of philosophy (Ph.D.) degree. Finally, the color of the hood's lining specifies the \r\nawarding institution. The colors are displayed in combinations that are drawn from heraldry. Notice \r\nthat the Clemson University hood is lined with purple through which is an orange chevron (a \"V\"). \r\nAlthough many combinations are duplicated by dozens of insitutions, Clemson is presently the only \r\ninstitution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastical, or military regalia as set \r\nforth by their professions. They are preceded by the University Marshal. Clad in a gown of office in \r\ngold and purple, the marshal wears no hood and bears the University mace. At the ceremony's close, \r\nthe faculty do not exit as a part bf the recessional but are dismissed, along with students and guests, \r\nwhen the marshal leaves the coliseum. "
    },
    {
        "page_number": "10",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of \r\nClemson University and must be present at any convocation where the \r\nUniversity, through its delegated members, is acting officially. At any \r\nofficial convocation such as commencement, the University Marshal, \r\ncarrying the mace, precedes the President into the assembly. The mace \r\nrests before the President's chair or speaker's stand throughout the \r\nceremony, and its removal from the assembly at the close of a \r\nconvocation is symbolic of the official withdrawal of the University and, \r\nthus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the \r\nceremonial maces carried by heads of state and church in the Middle \r\nAges. Its basic clublike shape, however, is much more ancient, probably \r\ngoing back to man's prehistory. It is made of walnut wood and silver, \r\nwith the seal of the University in gold and the University colors \r\nrepresented by insets of cornelian (orange) and amethyst (purple). \r\nAmethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in \r\nthe office of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the \r\nwhole body of the institution. Clemson's chain and seal are made of \r\nsilver and gold, and cornelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \r\n\"staffs of office\" which were carried by the senior members of \r\ndepartments of state or church. They display the seal of the University \r\nand the symbolic color of the discipline to which the college belongs. \r\nClemson's batons are made of walnut wood and silver with the various \r\ndisciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert \r\nEbendorf. Mr. Ebendorf is twice winner of the Tiffany Award and one of \r\nthe most acclaimed goldsmiths of our era. The enamel plaques for the \r\nbatons were executed by the late Professor Marshall C. Bell, and the \r\nlapidary work was executed by the late Mr. C. C. Wilson of Clemson \r\nUniversity. "
    },
    {
        "page_number": "11",
        "text": "Coat of Arms \r\nDesigned by Clemson University graphic artist, Connie Floyd, \r\nthe coat of arms represents the historic three-fold mission of this \r\ninstitution: teaching, research and service. \r\nPictured on the cover, the coat of arms is divided into three parts. \r\nThe bottom contains a series of open books representing the \r\nconcept of teaching as the basis of the land-grant university. The \r\nwhite of the books and the purple of the background designate the \r\nteaching mission of the University as it is achieved through \r\nundergraduate and graduate instruction. \r\nThe upper portion of the shield contains two sets of calipers and \r\nwheat sheaves illustrating the measurement system for research, \r\nas well as Clemson's tradition in agriculture and Extension. The \r\nthree symbols - the books, calipers and wheat sheaves - also \r\nrepresent the humanities, technology and science. \r\nThe entire shield is joined by a small orange center shield \r\nbearing a white tiger mask symbolizing the abiding spirit of \r\nClemson. \r\nThe crest is a gold palmetto tree, which emphasizes Thomas \r\nGreen Clemson's desire that Clemson become \"the people's \r\nuniversity\" for South Carolinians. It rises from a band of purple, \r\norange, white and gold. The outer pair of colors, purple and gold, \r\nare the official colors of the University; the inner pair, orange and \r\nwhite, are Clemson's student colors. "
    },
    {
        "page_number": "12",
        "text": "CANDIDATES FOR DOCTORS' DEGREES \r\nA. WAYNE BENNETT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURAL SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nAgronomy \r\nSambasiva Rao Mylavarapu Hyderabad, India \r\nB.Sc., Andhra Pradesh Agricultural Universtty; M.Sc., Govind Ballabh Pant University of Agriculture \r\nDissertation: Variabiltty of Soil Water Flow in Disturbed and Undisturbed Soils \r\nAdvisor: Dr. V. L. Quisenberry \r\nAnimal Physiology \r\nPatrick David Burns Lexington, KY \r\nB.S., West Virginia Universtty; M.S., Clemson Universtty \r\nDissertation: Effects of Nutritional Restriction on Immunological and Biological LH Release and on Luteal Cell Size in Beef \r\nCows \r\nAdvisor: Dr. J. C. Spitzer \r\nApplied Economics \r\nRoger Clifton Bradley ___________________________ New Vineyard, ME \r\nB.S., M.Ed., Bob Jones University \r\nDissertation: A Fiscal Theory of Hyperinflation \r\nAdvisor: Dr. W. R. Dougan \r\nEntomology \r\nHilario Distor Justo, Jr. Laguna, Philippines \r\nB.S.A., Universtty of the Philippines; M.S., Gregorio Araneta University \r\nDissertation: Parasttism and Predation on Eggs of Nezara viridula (L.) (Heteroptera: Pentatomidae) and Dispersal of Its \r\nMajor Parastte, Trissolcus basalis (Wollaston) (Hymenoptera: Scelionidae). in Coastal South Carolina \r\nAdvisor: Dr. B. M. Shepard \r\nFood Technology Wen-Dee Chiang, _______________________________ Clernson, SC \r\nB.S., Tunghai Universtty; M.S., Clemson Universtty \r\nDissertation: Continuous Hydrolysis of Casein in a Formed-in-Place Membrane Reactor \r\nAdvisor: Dr. A. L. Thomas \r\nPlant Physiology \r\nCharles Jordan Graham ____________________________ Montalba, TX \r\nB.S., M.S., Texas A & M Universtty \r\nDissertation: Influence of Aluminum on Selected Biochemical Processes of Peach \r\nAdvisor: Dr. G. L. Reighard \r\nCOLLEGE OF COMMERCE AND INDUSTRY \r\nDOCTOR OF PHILOSOPHY \r\nTextlle and Polymer Science \r\nAllison Ann Neidert Athens, GA \r\nB.S., M.S., Universtty of Georgia \r\nDissertation: The Ozonation of the Vinyl Sulsome and Hydrolyzed Derivatives of C.I. Reactive Blue 19 and C.I. Reactive \r\nBlack Size \r\nAdvisor: Dr. M. Drews "
    },
    {
        "page_number": "13",
        "text": "COLLEGE OF EDUCATION \r\nDOCTOR OF EDUCATION \r\nVocatlonal and Technical Education \r\nMelissa Hawkins Marcus Seneca, SC \r\nB.S., M.S .. Clemson University \r\nDissertation: An Investigation of the Impact of Entrapreneurial Programs Within Fortune 500 Companies on Relevant \r\nFinancial Indicators \r\nAdvisor: Dr. C. H. Isbell \r\nCharlene Fite Watton Greenville, SC \r\nB.S., University of South Carolina; M.S .. Clemson University \r\nDissertation: Effects of an Informational Support Strategy on Levels of Perceived Stress for Primary Family Caregivers of \r\nAlzheimer's Patients \r\nAdvisor: Dr. B. V. Burkett \r\nPortia Smart Weston Taylors, SC \r\nB.S .. M.S., Jacksonville State University \r\nDissertation: The Effects of Advisor Training on Retention, Student Satisfaction with Advising Services, and Advisor \r\nSatisfaction with the Role of Advising \r\nAdvisor: Dr. D. G. Tesolowski \r\nCOLLEGE OF ENGINEERING \r\nDOCTOR OF PHILOSOPHY \r\nAgricultural Engineering \r\n(AgricuHural Engineering is jointly administered by the College of \r\nAgricultural Sciences and the College of Engineering.) \r\nGwi-Hyun Lee -~~~~~~~~~~~~~----------------Clemson , SC \r\nB.S., Kangweon National University; M.S., lnha University \r\nDissertation: Light Irradiation Effects on Tomato Ripening \r\nAdvisor: Dr. J. M. Bunn \r\nCeramic Engineering \r\nGregory A. Grabert Lakenheath, England \r\nB.S .. Clemson University \r\nDissertation: The Effect of Processing Parameters on the Electrical Properties of the 2223 Bismuth-Based High T \r\nSuperconductors \r\nAdvisor: Dr. G. H. Haertling \r\nChemical Engineering \r\nJames William Klett_ 77.,----,;--------------------------Stuart, FL \r\nB.S., M.S., Clemson University \r\nDissertation: Heat Transfer in Carbon/Carbon Composite Materials \r\nAdvisor: Dr. D. D. Edie \r\nJohn Joseph McHugh ~~--~~~~--~-~--------------- Wilmington , DE \r\nB.C.E., University of Delaware; M.S .. University of Toledo \r\nDissertation: The Development of Orientation in Mesophase Pitch During Fiber Formation \r\nAdvisor: Dr. D. D. Edie \r\nJames Anthony Newell~~-~~~~-~-~~-~-~----------- Turtle Creek, PA \r\nB.S., Carnegie-Mellon University; M.S., Pennsylvania State University \r\nDissertation: The Conversion of Poly P-Phenylene Benzobisoxazole (PBO) to Carbon Fiber \r\nAdvisor: Dr. D. D. Edie \r\nClvll Engineering \r\nHazem M. Elzarka. ~-~~~----------------------- Cairo, Egypt B.Sc., M.Sc., Ain Shams University \r\nDissertation: Object Oriented Methodology Applied to Materials Management Systems \r\nAdvisor: Dr. L. C. Bell "
    },
    {
        "page_number": "14",
        "text": "Electrlcal Engineering \r\nYing-Cho Lai Taipei, Taiwan \r\nB.S., National Taipei lnstttute of Technology; M.S., Clemson University \r\nDissertation: Maximum-Likelihood Spectral Estimation and Adaptive Filtering Techniques wtth Application to Airborne \r\nDoppler Weather Radar \r\nAdvisor: Dr. E. G. Baxa \r\nJun Zhu .,..,---,---,-,-.,.-----,,--=-=-=-c~~..,.--0---0--,---=---.,.--------------Nanjing, China \r\nB.E., Huanzhong Universtty of S & T; M.E., Nanjing Auto Research \r\nDissertation: Fault Location and Diagnosis on Electric Power Distribution Feeders \r\nAdvisor: Dr. D. L. Lubkernan \r\nEngineering Mechanics \r\nCart Quinn Rousseau~--,---,--,..,.-~--,--,~----,----,~-~--,-------- Weatherford, TX \r\nB.S., Texas A & M Universtty; M.S., Virginia Polytechnic lnstttute & State Universtty \r\nDissertation: A Crttical Review and Clar~ication of Grifftth's Fracture Theory \r\nAdvisor: Dr. J. G. Goree \r\nlndustrlal Engineering \r\nSteven Thomas Lofgren .-=----,,---,--...,..,--=---o7-=---,-~-,----,-=--,-----,--------Beavercreek, OH \r\nB.S., Untted States Air Force Academy; M.S., Air Force lnstttute of Technology \r\nDissertation: Household Hazardous Products; Industrial Design and Analysis \r\nAdvisor: Dr. W. G. Ferrell \r\nJudith Irene McKnew-..,...,...,.-----,,---------------------------Six Mile, SC \r\nB.S., M.S., Clemson Universtty \r\nDissertation: The Determination of Safety Stock in a Multi-Echelon Production System \r\nAdvisor: Dr. R. P. Davis \r\nMaterlals Science and Engineering \r\nKyle Dean Frischknecht Livermore, CA \r\nB.S., Cal~ornia Polytechnic State Universtty-San Luis Obispo; M.S., Rensselaer Polytechnic Institute \r\nDissertation: Laser Assisted Chemical Vapor Deposttion of Fibers \r\nAdvisor: Dr. R. J. Diefendorf \r\nMechanical Engineering Shih-Yi Lu _____________ __________________ Taoyuan, Taiwan \r\nB.S., Chinese Culture Universtty; M.S., Clemson Universtty \r\nDissertation: Dynamic Behavior of a Slider-Crank Mechanism with a Flexible Coupler and Drive Train \r\nAdvisor: Dr. I. Haque \r\nShyh-Jen Wang'.-=-..,.--,--,.,,.-,---,..,,,......,,--.,.----,,..,...,,....-=---.,..,-,---,,----------- Taipei, Taiwan \r\nB.S., National Taiwan lnstttute of Technology; M.S., Clemson Universtty \r\nDissertation: Fatigue of Ductile Materials Subjected to Non-Zero Mean Stresses \r\nAdvisor: Dr. M. W. Dixon \r\nCOLLEGE OF FOREST AND RECREATION RESOURCES \r\nDOCTOR OF PHILOSOPHY \r\nForest Resources \r\nJohn William Edwards Clemson, SC \r\nB.S., West Virginia Universtty; M.S., Clemson Universtty \r\nDissertation: Resource Partttioning Between Sympatric Populations of Southern Fox Squirrel and Gray Squirrel in the \r\nGeorgia Piedmont \r\nAdvisor: Dr. D. C. Guynn \r\nGeorge Anthony Hernandez Clemson, SC \r\nB.S., Universtty of Kentucky; M.S., Clemson University \r\nDissertation: Shoot Growth of Two- and Three·· Year Old Loblolly Pine (Pinus taeda) wtth Simulated Tip Moth Damage \r\nAdvisor: Dr. A. E. Miller \r\nRichard Kent Myers --...,..,-..,.----,,----------------- --------Anderson, SC \r\nB.S., M.For., Clemson Universtty \r\nDissertation: Coastal Plain Plant Communtties Response to Fire-Hurricane Interactions \r\nAdvisor: Dr. D. H. Van Lear "
    },
    {
        "page_number": "15",
        "text": "Parks, Recreation, and Tourism Management \r\nMiller Grant Cunningham --------~~~-----------------S.eneca, SC \r\nB.S., Duke University; M.S., University of South Carolina \r\nDissertation: An Evaluation of the South Carolina Coastal Management Program \r\nAdvisor: Dr. R. H. Becker \r\nLarry Ray Lawrence Vicksburg, MS \r\nB.S., M.S., Texas A & M University \r\nDissertation: Preference for Outdoor Recreation Activities in 1965, 1972, and 1982; An Age Cohort Analysis \r\nAdvisor: Dr. R. H. Becker \r\nCOLLEGE OF SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nBiochemistry \r\nMary Lou Crowl-Powers Greenville, SC \r\nB.S., University of South Carolina; M.S., Indiana University \r\nDissertation: Determination of Equilibrium Constants for Heterogeneous Macromolecular Interactions Using Laser Light \r\nScattering \r\nAdvisor: Dr. J. K. Zimmerman \r\nStanley Cranfield Lorbach _ _ ________ __________________ Taylors, SC \r\nB.S., Clemson University \r\nDissertation: Molecular Physiology of the Thobacilli \r\nAdvisor: Dr. J. M. Shively \r\nKent Ronald Mltchell Cincinnati, OH \r\nB.S., M.S., North Dakota State University \r\nDissertation: Correlation of Porcine Cordceptus Aromatase mRNA Levels with Feto-Material Growth Factor and Receptor \r\nmRNA Expression \r\nAdvisor: Dr. A. G. Abbott \r\nChemistry John David Orr Anderson ___ ___________ _____ _________ Augusta, GA \r\nB.S., Bob Jones University \r\nDissertation: The Synthesis and Chemistry of Fluorinated Alkoxides and Diketones \r\nAdvisor: Dr. D. D. DesMarteau \r\nNuh-Tome Huang Taipei, Taiwan \r\nB.S., Fu Jen Catholic University \r\nDissertation: Synthesis Characterization and Excited State Properties of Polyazine Metallopolymer Complexes of \r\nTransition Metals \r\nAdvisor: Dr. J. D. Petersen \r\nSeth Clayton Rasmussen Milton, WA \r\nB.S., Washington State University \r\nDissertation: Synthesis and Design of Conjugated Organic Metallopoly Containing Ruthenium Chromophoric Units \r\nAdvisor: Dr. J. D. Petersen \r\nMathematical Sciences \r\nMark E. Cawood North Manchester, IN \r\nB.S., Manchester College; M.S., Clemson University \r\nDissertation: Development and Stability Analysis of Algorithms for Robust Pole Assignment of Linear Multi-input Systems \r\nAdvisor: Dr. C. L. Cox \r\nMicrobiology Tzuen-Rong Jeremy Tzeng ___________ _______ _________ Clemson, SC \r\nB.S., Tunghai University \r\nDissertation: The Genetics of the Bioremediation of Phenanthvene in CRE 7 (Pseudomonas Ceparia) \r\nAdvisor: Dr. E. L. Kline "
    },
    {
        "page_number": "16",
        "text": "Physics \r\nMichael Joseph Carter_~~~~-~~-~----------------- Spartanburg, SC \r\nB.S., Wofford College; M.S., Clemson Universtty \r\nDissertation: An Analytical Model for the Study of Traveling Ionospheric Disturbances \r\nAdvisor: Dr. L. M. Duncan \r\nLei Chen Clemson, SC \r\nB.S., Fudan Universtty \r\nDissertation: Monte-Carlo Treatment of Predicting Proton-Induced Dark Current on Charge-Coupled Devices \r\nAdvisor: Dr. P. J. McNulty \r\nKanta Das Calcutta, India \r\nB.Sc., University of Calicut; M.Sc., Indian lnstttute of Technology-Bombay; M.S., Clemson Universtty \r\nDissertation: Third Order Elastic Constants of NbSe3 and TaS3 \r\nAdvisor: Dr. G. X. Tesserna \r\nJames Elliot Keener Greenville, SC \r\nB.S., Clemson Universtty; M.S., Colorado State Universtty \r\nDissertation: Detection of Lightning in Tropical Thunderstorms wtth Doppler Radar \r\nAdvisor: Dr. C. W. Ulbrich \r\nSrilal Mudttha Weerasinghe Kandy, Sri Lanka \r\nB.Sc., Universtty of Peradeniya; M.S., Clemson Universtty \r\nDissertation: Multiphonon Energy Exchange in Atom-Surface Scattering \r\nAdvisor: Dr. J. R. Manson \r\nzoology \r\nThomas George Lamb Greenville, SC \r\nB.S., Bob Jones Universtty; M.S., Universtty of West Florida \r\nDissertation: Dispersal and Compelttive Ability of a Genetically Modttied Rhizobacterium, Pseudomonas aureofaciens, In \r\nField and Laboratory Systems \r\nAdvisor: Dr. D. W. Tonkyn \r\nLouise Marie Weber~~~~~~~-~~ ~~----------------Fort Wayne, IN \r\nB.S., Saint Mary's College; M.S., University of Notre Dame \r\nDissertation: Foraging Ecology and Conservation of Shorebirds in South Carolina Coastal Wetlands \r\nAdvisor: Dr. S. Haig "
    },
    {
        "page_number": "17",
        "text": "CANDIDATES FOR EDUCATION SPECIALIST \r\nAND MASTERS' DEGREES \r\nA. WAYNE BENNETT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURAL SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nSteven Richard Cabe _ _ ____ __ Tiger, GA Felicia Lynn Knowlton _____ __ Plano, TX \r\nMASTER OF AGRICULTURE \r\nGary Bowen Goss ___ _____ Clinton, SC Thomas Boyne Platt _ _ _____ Clemson, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nElizabeth Theora Kennedy ____ Charleston, SC John Angus Martin ___ ____ Brooklyn, NY \r\nSophie Lemesre Clairmarais, France Jeffrey Christopher Terry Bel Air, MD \r\nAgronomy \r\nBharat Bhushan Reddy Chintapally ___ Clemson, SC Ralph Dennis Johnson _____ Galivants Ferry, SC \r\nRobert Eugene Etheridge, Jr. Bowman, SC Andrew Keeton York, SC \r\nAnimal and Food Industries \r\nJacqueline Marie Peltz _______ Adena, OH Linda Voller Reasonover ____ _ Wrightsville, GA \r\nAquaculture, Fisheries, and Wiidiife Biology \r\nWilliam Forney Dukes, Jr. ____ Orangeburg, SC Carol Ann Seals ________ Mt Pleasant, SC \r\nEntomology \r\nJohn Riser Monroe Fountain Inn, SC \r\nEnvironmental Toxicology \r\nMax Aaron Feken _ _ ___ __ ~- Tulsa, OK \r\nJulie Ann Hoover Clarkston, WA \r\nSteven Barclay Wall _____ ___ Amarillo, TX \r\nTravis Kent Warren Radford, VA \r\nVincent Anthony Leopold Boerne, TX Catharine Adams Williams Sumter, SC \r\nRobert R. Troup Lancaster, OH Pattie Dawn Wood New Bedford, MA \r\nNutrition \r\nEric Kan Altom ___ ______ Cookeville, TN Sheng Zhang _ _______ _ Clemson, SC \r\nYan Liu Clemson, SC \r\nPlant Pathology \r\nWalter Childs Derrick _____ West Columbia, SC Thomas Kenneth Mitchell ____ _ Baltimore, MD \r\nCOLLEGE OF ARCHITECTURE \r\nMASTER OF ARCHITECTURE \r\nJane Ellen Besley ________ Plainfield, IL Theodore Joseph Nourie ____ _ Cincinnati, OH \r\nJonathan Spencer Dixon Trujillo, Peru Hao Wang Clemson, SC \r\nMASTER OF CITY AND REGIONAL PLANNING \r\nFasihAhmad~~---- -Lahore, Pakistan Lee Edwin Smith _______ Kingston , TN \r\nJames Bradley Clark Arlington, TX Toru Yokomizo Kanagawa, Japan \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nCraig Daniel Capano South Hamilton, MA Timothy Neil Heichelbech, _ ___ _ ,Bloomington, IN \r\nChanes Scott Duvel St Petersburg, FL \r\nMASTER OF FINE ARTS \r\nDavid London Tillinghast Seneca, SC "
    },
    {
        "page_number": "18",
        "text": "COLLEGE OF COMMERCE AND INDUSTRY \r\nMASTER OF BUSINESS ADMINISTRATION \r\nKart Lee Borneman Simpsonville, SC Craig Roger Laher _ ______ Pueblo West, CO \r\nMichael Paul Burkholder Newark, DE Steven Robert Lapham Jasper, NY \r\nKeith Bryan Burriss Laurens, SC Franck Diego Magnet Breteche, France \r\nWilliam Thomas Carpenter Anderson, SC Sudhakar Rao Mattu Balappa Madras, India \r\nKimberly Jean Coleman Greenville, SC Leonard Kenneth Moody Greenwood, SC \r\nTonya Denise Craig Charlotte, NC Rajive Jacob Ninan Bombay, India \r\nJane Crawford Crews North Augusta, SC Maureen Cecelia O'Neill Columbia, MD \r\nKeith Glennon Denny Westminster, SC Michael C>.Nens Hendersonville, NC \r\nElecta Durant Eaddy Greenville, SC Elizabeth Ann Packman Greenville, SC \r\nAndreas Ehring Bottrop, Germany Paige Heather Poltrack Dunwoody, GA \r\nLeith Anne Ellis Simpsonville, SC Jefferson L. Rice West Union, OH \r\nWilliam Douglas Ellison Williamston, SC Karen Susanne Roach Greenville, SC \r\nJeffery Lee Ethridge Milledgeville, GA Delica Larose Sanders Chester, SC \r\nEmmanuelle Favennec Quimper, France Douglas Lee Scaife Anderson, SC \r\nLinda Lee Finn Walhalla, SC Peggy O'Neal Sells Knoxville, TN \r\nChristopher Thomas Fletchall Anderson, SC Sean Christopher Sheeran Wyckoff, NJ \r\nJayne A. Foeller Columbus, OH Brian Nelson Smith HartsvUle, SC \r\nSuzanne Noel Gaertner Greenville, SC Lawrence Edward Smith, Jr. Summerville, SC \r\nBrian Michael Gil< Columbia, SC Linda Otto Smith Anderson, SC \r\nStanley Elliott Greer Taylors, SC Glenn Forrest Stockstill Greenville, SC \r\nRaymond Mittord Griffin Simpsonville, SC Dirk Klaus Stugg Easley, SC \r\nStephen Eugene Harshbarger ___ Simpsonville, SC Carolyn Teal Walhalla, SC \r\nMark Goodwin Heggie Hickory Tavern, SC Todd Peter Wandtke Gahanna, OH \r\nJames A. Hoyle Central, SC Jeffrey Allen West Greenville, SC \r\nMarco Iannaccone Ponte Di Piave, Italy Bruce Eugene Whelchel Gaffney, SC \r\nGlenn Alan Kermes Simpsonville, SC Pascal Philippe Widmer Beligneux, France \r\nMark Anthony Kruse Franklin Park, IL Wendell Garry Wilde Simpsonville, SC \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nJames Randolph Blake _____ ~ Fork Union, VA Maureen Anne O'Reilly _______ .Hartwell, GA \r\nRalph Edward Duncan Spartanburg, SC John William Stanfield Walterboro, SC \r\nPaul Eugene Kruse Ypsilanti, Ml Hsing-Chin Yu Lawrenceville, GA \r\nElizabeth Ann Medina Miami, FL \r\nMASTER OF ARTS \r\nEconomics \r\nKameswara Rao Chltti ____ Visakhapatnam, India Carmen Urizar ___________ Guatemala \r\nRamanan Laxminarayan Madras, India Xin Zhang Seneca, SC \r\nEllen Weeks Saltzman Clemson, SC \r\nMASTER OF SCIENCE \r\nlndustrlal Management \r\nSougata Banerjee _ _______ Calcutta, India \r\nKevin Tallysmlth Batson Covington, GA \r\nMelissa Lavette Leach ------~Marietta, GA \r\nVivek Bhaskar Naiknavare Clemson, SC \r\nTimothy Richard GalJreath Seneca, SC T. Brian Nigro Seneca, SC \r\nRodgers Kenyon Greenawalt Sumter, SC Deborah Denise Sellaway Columbia, SC \r\nJason Cline Hollttield Bostic, NC William Thomas Sheridan, Jr. Charleston, SC \r\nTextlle Chemistry \r\nQingning Feng Clemson, SC Hanfeng Huang _________ Taipei, Taiwan \r\nAna Josefina Dias Fernandes_ Maputo, Mozambique \r\nTextlle Science \r\nMargaret Jean Watters Sparta, NJ \r\nCOLLEGE OF EDUCATION \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\nCelina Mullenix ---------Elberton, GA Fran Ridgeway Oakley _______ Elberton, GA \r\nMASTER OF EDUCATION \r\nAdministration \r\nMerle Leigh Twiddy Faulk------,--. Greer, SC \r\nBrad Vincent Gennaro Anderson, SC \r\nKurt Donald Kreuzberger West Union, SC \r\nAnita Gayle Looper Dacusville, SC \r\nand Supervision \r\nDevon Dale Smith _______ Greenwood, SC \r\nJoe Dan Strickland Carnesville, GA \r\nKristi Leigh Vanderford Union, SC \r\nSusan Blodgett Whiten Walhalla, SC "
    },
    {
        "page_number": "19",
        "text": "Counseling and Guidance Services \r\nCorey Renell Amaker Lexington, SC \r\nLori Anne Berrios Due West, SC \r\nEleanor McCourry Miller ____ __ Whltmire, SC \r\nRobin Lyn Moody Anderson, SC \r\nJoan Bass Britton Taylors, SC Johnnie S. Phillips Greenwood, SC \r\nDonald Edward Childs, Jr. Greenville, SC Gary Steven Plonk Clemson, SC \r\nMargaret Elizabeth Fore Latta, SC \r\nJean Solesbee Forte Greenville, SC \r\nKaren Hood Powell Seneca, SC \r\nLou Wingo Rogers Pickens, SC \r\nJames Jennings Foster Spartanburg, SC \r\nRebecca Earle Garren Greenwood, SC \r\nBessie Renee Skenteris Greenville, SC \r\nScot Alan Sloan Woodruff, SC \r\nPatricia Lynn Godwin New Concord, OH \r\nNyleeche Neekono Khalia Green ___ Anderson, SC \r\nRebecca Sue Hancox Seneca, SC \r\nTracie Lynn Thomas Anderson, SC \r\nJennifer Lee Thompson Charleston, SC \r\nAmanda Pitts Tumblin Central, SC \r\nStacy Jeanine Jones Abbeville, SC \r\nMarietta Fowler Lawson Spartanburg, SC \r\nKathy J. Wells Greenville, SC \r\nLeslie Bari Whiten Greenville, SC \r\nSheryl Lolltha Mattress Anderson, SC Christine Worrell Greenville, SC \r\nElementary Education \r\nStephanie Porterfield Brown _____ Elberton, GA Sylvia Yvonne Scott _______ Anderson, SC \r\nElizabeth Ann Holder Six Mile, SC Amy Martin Smith Hartwell, GA \r\nKimberley Scarborough McCoy Belton, SC Melissa Alewine Stephens Anderson, SC \r\nReading \r\nTammy Murray ______ Lone Star, SC \r\nSecondary Education \r\nEdwin Earl Chase, Jr. _______ La Grange, NC Rebecca Skaggs Ramsey _______ Greer, SC \r\nCarmen Sue Nelon Brevard, NC \r\nSpecial Education \r\nLisa Ann Bellamy _______ Myrtle Beach, SC Elizabeth Pettett Etheridge _____ Greenville, SC \r\nLisa Shirley Brown Anderson, SC Edna Katherine Styles Liberty, SC \r\nKristen Mostoller Duvall Greenville, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nAnnetta Allen ~------~Greenville , SC Reginald DeVinci Hawthorne _ ___ Anderson, SC \r\nMarie Casarella Anderson Greenwood, SC Rachell Evette Holston Columbia, SC \r\nAngela Lynn Arve Walhalla, SC Janet Waldron Holz Walhalla, SC \r\nJoseph Calvin Avant Charleston, SC Robyn Gambrell Knox Belton, SC \r\nThomas David Baxter Greenville, SC Melissa Jane Littleton Appleton, WI \r\nJenntter Chipukites Benson Anderson, SC Lisa Annette Mace Marion, NC \r\nMichael Edward Botkins Central, SC Dennis Alan McCay Decatur, IL \r\nMartha Ruth Cole Pendleton. SC LaSonya Melissa McPherson Ridgeland, SC \r\nJana Gail Copeland Greenville, SC Phillip-Michael Devon Payton Trenton, NC \r\nTalya Tanika Corprew Chesapeake, VA Heather 0 . Phillips Oak Ridge, TN \r\nRhonda Denise Deaton Seneca, SC Kevin Randall Rice Cullowhee, NC \r\nDaniel Cassell Durham Pickens, SC Tammie King Roe Belton, SC \r\nSara E. Foster Greenville, SC Micky Jeaneen Rogers Walhalla, SC \r\nTony Ray Gaines Liberty, SC Ruth Kelly Taylor Pendleton, SC \r\nBarbara Christine Goeller Yorktown, VA Kristen May Valentine Boca Raton, FL \r\nJames Clinton Graves Charleston, SC Curtis Clyde Yant, Jr. North Charleston, SC \r\nTina Sue Haskin Greenwood, SC \r\nMASTER OF INDUSTRIAL EDUCATION \r\nMiriam Hayes Alexander _______ Pickens, SC Robert Adolf Sloan -------- Walhalla, SC \r\nValerie Anne Drews Simpsonville, SC David Brooks Smith Gaffney, SC \r\nGarrett Parnell Hattaway Grovetown, GA Karthikeyan Srinivasan Madras City, India \r\nChiranth Nataraj Clemson, SC William Thomas Ware, Jr. Due West, SC \r\nDaniel Francis Richards Hingham, MA James Alexander Woody Belton, SC \r\nCOLLEGE OF ENGINEERING \r\nMASTER OF ENGINEERING \r\nCivil Engineering \r\nJohn Roland Cobb, Jr. -----~~Clemson, SC Glenn Stewart - ---------- Dunn, NC \r\nMichael Vandiver Horton Myrtle Beach, SC \r\nElectrical Engineering \r\nChristopher Joseph Reinhart _ __ Snow Camp, NC Jack Edward Stafford, Jr. _____ Elon College, NC \r\nEnvironmental Systems Engineering \r\nMarc Dominik Barbe _ ______ Baltimore, MD Steven Donald Nestor _______ Greenville, SC \r\nStephanie Brau St Cloud, FL Stephen Kenneth Spitzer Margate, NJ \r\nRandall Albert Cozzens Spring Grove, PA Tammy Lynn Watson Bellingham, MA \r\nJohn Thomas Igoe Shoreham, NY "
    },
    {
        "page_number": "20",
        "text": "MASTER OF SCIENCE \r\nAgrlcultural Engineering \r\n(Agricuhural Engineering is jointly administered by the College of \r\nAgricultural Sciences and the College of Engineering.) \r\nJames Winthrop Price Athens, GA \r\nBioengineering \r\nJacqueline Marlene Allan _______ Bowie, MD Michael Scott McCaig _______ Fort Smith, AR \r\nNino Lawrence Bonavlto Bowie, MD Lance Allan Monroe Huntsville, AL \r\nDaniel Christopher Clupper Muncie, IN Mary Elizabeth Parker Anderson, SC \r\nJeffrey David Hulbert Terre Haute, IN Ming-yuh Wang Taipei, Taiwan \r\nCeramic Engineering \r\nRichard Trent Bates _______ -= Liberty, SC \r\nDeborah Lee Fulton Kingstree, SC \r\nMelissa Ann Long ___ _____ Ninety Six, SC \r\nJames Alan Snipes Hartsville, SC \r\nJohn Andrew Hoelzel Asheville, NC Jeffery Lee Stricker Van Wert, OH \r\nGregory Philip Kiss San Diego, CA Carlos Eduardo Villa Medellin, Colorrbia \r\nChemlcal Engineering \r\nDavid Joseph Koehl _______ Fort Wayne, IN Vinod Vemparala ____ _____ Hamihon, OH \r\nSachin Shashikant Sakhalkar Clemson, SC \r\nClvll Engineering \r\nVinay Ahuja~~=~ -----New Delhi, India Dana Pickett Mizzell _ _____ -= Charleston, SC \r\nNaresh Shankerlal Bhatia Clemson, SC Susan Supan Monroy Goose Creek, SC \r\nAnn Stevenson Cobb Clemson, SC Sreekanth Nandagiri Clemson, SC \r\nVictor Meredith Edwards Ill Anderson, SC Grant H.J. Nintzel Rockaway, NJ \r\nColleen Marie Elden Laurel, MD David Lambert Reynolds Sumter, SC \r\nBrian Lawrence Keener Greenville, SC Richard John Sands Anniston, AL \r\nSonal Subodh Kulkarni Clemson, SC lmtiazur Rahman Syed Visakhapatnam, India \r\nKent Allen Lackey Arlington, VA Daniel Brice Urquhart Greenwood, SC \r\nMatthew Todd Lindner Sumter, SC \r\nComputer Engineering \r\nRobert Hance Finley, Jr. ______ ~ Taylors, SC Ximing Zhang __________ Clemson, SC \r\nChristopher Lee Lynch Scranton, SC \r\nElectrical \r\nRamasamy Ananth Clemson, SC \r\nNivea Lopes Antao Goa, India \r\nMadhavan Bakthavatchalam __ Tambaram, Tamil Nadu \r\nPrashanth Prasanna Bangalore Clemson, SC \r\nElsworth Ernest Barrington, Jr. ___ Fayetteville, GA \r\nRamji Krishna Chandramouli Madras, India \r\nSudeshna Dasgupta Ghosh ___ West Bengal, India \r\nSuvasish Ghosh Calcutta, India \r\nRishikesh Venkata Kollipara Tustin, CA \r\nEngineering \r\nMatthew Jason Leeling _____ Harker Heights, TX \r\nRamana Mellacheruvu Clemson, SC \r\nVinay Jagdishchandra Pande Clemson, SC \r\nSanjay Ramakrishna Pillay Hyderabad, India \r\nGudoor S. Reddy Hyderabad, India \r\nPradeep Kumar Singh Clemson, SC \r\nSubodh Upreti Royston, GA \r\nJohn Anthony Willoughby Nichols, SC \r\nEngineering Mechanics \r\nLynn Bailey Klett Aiken, SC \r\nEnvironmental Systems Engineering \r\nBarbara A. Anderson _ ____ _ _ Kettering, OH Matthew James Marshall Pittsburgh, PA \r\nJulia Anne Batchelor Evans, GA David Joseph Meunier ______ Cumberland, RI \r\nDavid Michael Bennert Marion, AL Paul Scott O'Neal Piedmont, SC \r\nLe~ Andrew Busby Simpsonville, SC Robert Giles Ragsdale, Jr. Vienna, WV \r\nWilliam Otis Crews, Jr. Yemassee, SC Mary Anne Redican North Massapequa, NY \r\nHenry Ho Derstine Harleysville, PA James Paul Scheffler Phoenix, NY \r\nEdward James Gall St Clair, PA Deborah Leigh Simril Lake Wylie, SC \r\nHeidi Michelle Greene Simpsonville, SC Christian Mark Thelander Sterling Heights, Ml \r\nKenneth Joe Hewlett Toledo, OH Hollie Sherman Vollmar Greenville, SC \r\nAnn Marie Hooks Clinton, SC Christopher Todd WooHolk Columbia, SC \r\nRobert Donald Maner Winston-Salem, NC \r\nIndustrial \r\nSamir Baja.._· ---,,.,..-.,-----------.,, Delhi, India \r\nAnil Mohandas Bhat Clemson, SC \r\nMuralidhar Budagavi Clemson, SC \r\nShivanand Maruti Divekar Borrbay, India \r\nDavid Todd Hague Richardson, TX \r\nEngineering \r\nYeshonath Geethanath Hiryur ____ Baroda, India \r\nVikram Raghunandan Joopelli Houston, TX \r\nMatthew Hayden Littleton Canton, Ml \r\nDevendra Yeshwant Satoskar Clemson, SC \r\nMurali Krishna Yellamraju Rochester Hills, Ml \r\nMaterlals Science and Engineering \r\nShawn David Knowles ______ East Berne, NY Michael David Walker _ _ ______ .Mauldin, SC "
    },
    {
        "page_number": "21",
        "text": "Mechanlcal \r\nJohn Leonard Allen, Jr. Clemson, SC \r\nSudipto Bagchi Calcutta, India \r\nMuralidharan Balasubramanian Madras, India \r\nRajat Charan New Delhi, India \r\nSandeep Sharma Chellapilla Calcutta, India \r\nSiva S. Dariverrula Acworth, GA \r\nGregory Alexander Failla Cincinnati, OH \r\nRobert Scott Floyd Charleston, SC \r\nMahendrakumar Ganesan Coimbatore, India \r\nSaikat Ghosh Calcutta, India \r\nSudipta Bimal Ghosh Dearborn Heights, MD \r\nDureen Kumar Baglur Jayaram _ __ Bangalore, India \r\nEngineering \r\nSandeep Sudhir Joshi Clemson, SC \r\nnmothy Patrick Martin Leesburg, VA \r\nBalan Nagarajan Bombay, India \r\nGanesh Ram Narasimhan Madras, India \r\nRajesh Sarvotham Nayak Bangalore, India \r\nKendrick Eugene Richardson Six MUe, SC \r\nAmandeep Singh Clemson, SC \r\nBabuji Krishnaswamy Tamarapoo ___ Madras, India \r\nSayeejee Sree Ravi Tatineni ___ Vijayawada, India \r\nSunder Sasha Venkat Vaduri __ Andra Pradesh, India \r\nPrabhakar Vuyyuru Clemson, SC \r\nCOLLEGE OF FOREST AND RECREATION RESOURCES \r\nMASTER OF PARKS, RECREATION, AND TOURISM MANAGEMENT \r\nJennifer Lynn Cooke ______ --:Greenville, SC Daniel Alan Lentz _______ Charleston, SC \r\nMichael Gardiner, Jr. Charleston, SC Robert Henry Patterson, Jr. Anderson, SC \r\nDaniel John Hautala Ml Morris, Ml Dana Ginn Poole Roswell, GA \r\nTracey D. Lee Seneca, SC \r\nMASTER OF SCIENCE \r\nForest Resources \r\nTerrell Talmage Baker Ill Orlando, FL Timothy Henderson Chesnut ____ Gaylesville, AL \r\nThomas Andrew Barnes Angola, IN Donna Sherrard Leonard Asheville, NC \r\nPARKS, RECREATION, AND TOURISM MANAGEMENT \r\nChristina Susi Burrell Easley, SC William Marshall Rutlin. ______ Blacksburg, VA \r\nCOLLEGE OF LIBERAL ARTS \r\nMASTER OF ARTS \r\nEngllsh \r\nMatthew Alexander Banash _____ Levittown, PA Susan Jane Scott -------~Clemson, SC \r\nLoraine Edge DeRoy Charlotte, NC Naomi Jean Taylor Spartanburg, SC \r\nDaniel Eric Quattlebaum Spartanburg, SC \r\nProfessional Communication \r\nLaura Kaye Blume _______ Spartanburg, SC Kaushiki Maitra. __________ Seneca, SC \r\nCarol Anne Hayes Greenville, SC \r\nCOLLEGE OF NURSING \r\nMASTER OF SCIENCE \r\nNursing \r\nDeborah Lee Hart Aiello _ ______ Asheville, NC Paula Bradshaw Martin _______ Anderson, SC \r\nElizabeth Hunter Fallat Greer, SC Joan B. Sprague Greenville, SC \r\nLaura Lee Hamel Mauldin, SC Mary Pund Williams Seneca, SC \r\nJanice Garrison Lanham Seneca, SC "
    },
    {
        "page_number": "22",
        "text": "COLLEGE OF SCIENCES \r\nMASTER OF SCIENCE \r\nChemistry \r\nSteven Barry Heaton ______ Goose Creek, SC Susan Adele Lewis --------- Dillon, SC \r\nComputer \r\nAshraf Mohamed Abdelbar Cairo, Egypt \r\nDevang Nandkumar Adhvaryu _ _ Ahmadabad, India \r\nJoon Yong Chung Williamston, SC \r\nKalpesh Harlvadan Dharia Bombay, India \r\nJames Alan Drenter Davenport, IA \r\nMurali Earagolla Boca Raton, FL \r\nSanjay Sridhar Karnath Mangalore, India \r\nLoren Douglas Larsen Salt Lake City, UT \r\nJohn Lloyd Warrington, England \r\nScience \r\nJasbir Manotra __________ Clemson, SC \r\nPrabhakar Narayanaswamy Charlotte, NC \r\nPrathima Raghavan Bangalore, India \r\nVijay Ranjan Ghaziabad, India \r\nCharles Wayne Roberson Elon College, NC \r\nNandakumar Sankaran Clemson, SC \r\nSeshkumar Venkat Sayani Clemson, SC \r\nMuralidhar Sringari Mysore, India \r\nHydrogeology \r\nAndrew Thomas Hoak -----~~Hamburg, NY David Eric Kroening _______ Green Bay, WI \r\nApril Lynda James Sudbury, Ontario \r\nMathematica! Sciences \r\nRussell Dean Albright. _____ Grand Ledge, Ml Amy Chaffee Hatfield _______ Toledo, OH \r\nPhilip Joseph Breuer Augusta, GA \r\nMicrobiology \r\nCarol Lynn Besco _______ Goose Creek, SC Trevor Gardner Phister _______ St Charles, IL \r\nGuofu Fang Shanghai, China Mitzi Yvette Shearer Cumming, GA \r\nAsok Manavazhi Seneca, SC \r\nPhysics \r\nDaren Sean Blythe Fredericksburg, VA Robert Scott Moran Spartanburg, SC \r\nTracy Dawn Krishnan Eastanollee, GA Wanda Kepp Moran New Orleans, LA \r\nLloyd Scot Larson Adrian, Ml Chris I. Sanderson Emporia, KS \r\nDavid Anthony Lee Philadelphia, PA Kanchana Sethu Clemson, SC \r\nAdauto Jose Boianca Lourenco ___ Greenville, SC Joel Christopher Wojciechowski _ __ Rochester, NY \r\nNing Luo Shengyang, China \r\nzoology \r\nEmily Katherine Bair ___ _ ___ Rochester, NY Joy Anne Schmertmann. ______ Gainesville, FL "
    },
    {
        "page_number": "23",
        "text": "CANDIDATES FOR BACHELORS' DEGREES \r\nCOLLEGE OF AGRICULTURAL SCIENCES \r\nTHOMAS ROSS WILKINSON, Dean \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nJames Vincent Caggiano, Jr. ----=- Cowpens, SC Ashley Wayne Rawl ,..,,.--,---------,Lexington, SC \r\nMatthew Dillard Copeland Spartanburg, SC Waldemar Andreas Wirsig Quito, Ecuador \r\nAgricultural Education \r\nDavid Jason Duncan ______ Westminster, SC John Harmon Holladay lll ______ Manning, SC \r\nJoseph Michael Gleason Fork, SC Krista Powell Price Fair Play, SC \r\nAgricultural Mechanization and Business \r\nMilton Ariail Lowder Sumter, SC \r\nAgronomy \r\nWilliam Edwin Dargan Ill Darlington, SC \r\nAn Ima I Industries \r\nJennifer Denise Arrington _____ Greenville, SC \r\nDavid Clyde Brooks Fountain Inn, SC \r\nKelly Elizabeth Lee _______ Spartanburg, SC \r\nJason Carlisle Spitzer Fair Play, SC \r\n.. Angela Marie Gasser Alexandria, VA Raymond Randolph Stabler St Matthews, SC \r\n.. Michael Wade Haley Sumter, SC Christopher Robert Talley Salem, SC \r\nJeremy Victor Kessel Murrells Inlet, SC \r\nAquaculture, Fisheries, and Wiidiife Biology \r\n'Christopher David Baumann _ ___ St Stephen, SC \r\nAttred Benjamin Crouch, Jr. Rock Hill, SC \r\nMargaret Emily Gibson Charleston, SC \r\nMatthew Robert Kinloch Laurel, MD \r\nJohn Franklin McMakin, Jr. Lyman, SC \r\nGeorge Christopher Muckenfuss __ Summerville, SC \r\nKevin Larry Ream Si11'4'.>sonville, SC \r\nChartes Edward Waldrop, Jr. Easley, SC \r\nFood Science \r\n'Buffy Rubylyn Britt _______ Anderson, SC Mamie Elizabeth Weaver _____ Mt Pleasant, SC \r\nHortlculture \r\nZack Clemenceau Clarkson Ill ____ Columbia, SC Kevin Michael O'Shea ____ Hilton Head Island, SC \r\nDwight Ashley Davis Batesburg, SC Christopher Scott Owens Spartanburg, SC \r\nThomas Horace Fallaw Leesville, SC Sarah Perrin Queen Clemson, SC \r\nAshleigh Marvelle Goza Mayesville, SC Christopher Lynn Ray Lexington, SC \r\nDaniel Bruce Keeran Central, SC David Lyman Smith Spartanburg, SC \r\nRobert Tripp Merritt, Jr. Easley, SC Devin Joel Smith Gilbert, SC \r\nJoseph Ashley Muns Georgetown, SC Luke Pat Yoder Greenville, SC \r\nAnne Grace Newton Bennettsville, SC \r\nPackaging Science \r\nKenneth Albert Folse _______ Holly Hill, SC Bradley Jason Hice _______ Tega Cay, SC \r\nCOLLEGE OF ARCHITECTURE \r\nJAMES FRAZIER BARKER, Dean \r\nBACHELOR OF ARTS \r\nDesign \r\nPaul John Green ________ Huntington, NY Karen Lynn Streib ______ Hendersonville, NC \r\n'Robert Todd Jordan Johnsonville, SC Marshall Brady Williams Camden, SC \r\n'Marie-Josee Julie Lapierre Coral Springs, FL \r\nBACHELOR Jenn~er Anne Bagnal _ _____ Spartanburg, SC \r\nSusan Paige Jacobs Myrtle Beach, SC \r\nGeorge Richard O'Hara, Jr. Georgetown, SC \r\nOF FINE ARTS \r\n'Jennifer Lynn Smith~~-----Mt Pleasant, SC ' Shannon Elizabeth Smith Mt Pleasant, SC \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\n'Julie A. Althoff _ _____ Columbia, SC "
    },
    {
        "page_number": "24",
        "text": "BACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nBrett Erik Carlson _______ Isle of Palms, SC Thomas Martin Fridy _______ Greenville, SC \r\nWiliam Edward Clark Ill Santee, SC Bryan Robert Goodwin Easley, SC \r\n•Alvin Cecil Collins Ill Seneca, SC .. Timothy Randolph Griffin Clemson, SC \r\nBarret William Foust Charlotte, NC John Thomas Young, Jr. Spartanburg, SC \r\nDesign \r\nPaul Anthony Acom, _______ Pendleton, SC David Michael McPherson _ ___ _ Pendleton, SC \r\nDavid Arthur Anderssen Charleston, SC Martin Brantlee Moser Cary, NC \r\nJeffrey Scott Carpenter Travelers Rest, SC Scott Harold Owens Pickens, SC \r\nJonathan Wade Dobson Camden, SC Mark Allen Sanders Avon, CT \r\n.. Rudi Danny Elert Wayne, NJ David Spicer Sharpe Bemus Point, NY \r\nDavid S. Frederick Branchville, SC Jenn~er Jill Shirey Leesville, SC \r\nCOLLEGE OF COMMERCE AND INDUSTRY \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nCarlos Alberto Aceituno ______ Santiago, Chile Keith James Oswald __ ~--Pompton Lakes, NJ \r\nJohn Andrew Cottingham Dillon, SC Matthew Stevens Rainsford Edgefield, SC \r\nKatherine McNeal Harris Fredericksburg, VA Christopher Alan Sperry Atlanta, GA \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nJulie Renee Abbott------~ Columbia, SC •Julie Christine Kier __ ~ _ ____ Gastonia, NC \r\nPeter Avitabile New Fairfield, CT Timothy James Leaumont, Jr. Duluth, GA \r\nDavid William Carey, Jr. Taylors, SC Jennifer Louise Lytle Seneca, SC \r\nPeter Denman Dubuque Greenwood, SC Amy Patricia Mahaffey Key West, FL \r\nKenneth Dwight Dukes Anderson, SC Kristen Elizabeth McNamee Columbia, SC \r\nJeremy Richard Erling Simsbury, CT Felecia Faye Powell McClellanville, SC \r\n••Jan Mclane Gilchrist Greenville, SC Nimarata Nikki Randhawa Bamberg, SC \r\nTony Gene Gillespie, Jr. Lyman, SC ·usha Dianne Riddle Greenville, SC \r\nRobin Elzona Graves Britton's Neck, SC .. Heather Alexander Rogers Pendleton, SC \r\nDenise Ann Helms Aiken, SC Steven James Ryan Syracuse, NY \r\nWilliam Everette Hines Aiken, SC Paul James Saxenmeyer Sewell, NJ \r\nDavid Charles Horton West Columbia, SC Randal Wayne Smith Lexington, SC \r\nVanita Yvette Johnson Pendleton, SC Ronald Cleland Taylor, Jr. Greenville, SC \r\nLisa Deray Jolley St Matthews, SC •Allison Rae Ward Lancaster, SC \r\nMarcus Tyrone Jones Spartanburg, SC Rebecca Ann Wrenn Fountain Inn, SC \r\nBrent Christopher Kearney Greenville, SC \r\nEconomics \r\nKilon Forrest Cowles -----~~Pittsburgh, PA John Frederick Heims _______ Sea Girt, NJ \r\nMarl< Hunter Dease Fountain Inn, SC Lisa Ann Lieberman Virginia Beach, VA \r\n+ .. • Jennaea Leigh Denhardt Vandalia, OH Nora Marie McCafferty East Norristown, PA \r\nLori Leigh DeVall Williamston, SC J. Michael Mccourt East Hampton, NY \r\nMichael Todd Eydenberg Mechanicsburg, PA John Wesley McHenry Ill Summerville, SC \r\nMichelle Nicole Ghadban Manassas, VA Amanda Cameron Sanchez Arcadia, CA \r\nFinancial Management \r\nRichard Lawrence All ____ Hilton Head Island, SC Steven Wayne Johnson, ______ Jonesville, VA \r\nJohn Eric Balderson Dacusville, SC Eve Lowery Joy Anderson, SC \r\nWalter Clinton Barker Walhalla, SC Mary Kathryn Kopczyk Seneca, SC \r\nChristopher Eron Beard Greenville, SC Mary Elizabeth Littleton Roanoke, VA \r\n+ .. Brian Andrew Blackburn Anderson, SC Joseph Thomas Malieckal Clemson, SC \r\nGary Lamont Brown Charleston, SC Jackson Harris McMullan Cornelia, GA \r\nDavid Bruce Burns Aiken, SC Mark Andrews Mogge Dothan, AL \r\n•John Stanley Case, Jr. Anderson, SC Nicole Marie Pokryfka Charleston, SC \r\n'Erin Renee Chura Woodbridge, VA Jeffrey John Proper Chester, VA \r\nNicole Lauren Detuelo Easley, SC Mark Clifford Pulley Caracas, Venezuela \r\nDavid Alan Fisher Liberty, SC William Ashley Scharr Richmond, VA \r\nPerry Lawson Hopper, Jr. Columbia, SC Jason Elliot Tate Greer, SC \r\n'K. Lynn Howard Easley, SC Lawrence Paul Thompson Ill Anderson, SC \r\nPhilip E. Howley, Jr. Norlh Wales, PA Eric Matthew Wood Glen Burnie, MD \r\nBrian Whittier Hurd Laurel, MD "
    },
    {
        "page_number": "25",
        "text": "lndustrlal Management \r\nLe Porte Donald Brooks ______ Bishopville, SC \r\nScott Ian Broomall Florence, SC \r\nJames Dewey Mullinax _____ ---, Winnsboro, SC \r\nDarryl L. Robinson Lumber City, GA \r\nPatrick Edward Dean Annapolis, MD Raymond Blake Tannery Anderson, SC \r\nMichael Jonathan Drummond Williamsport, PA Brian Keith Tillotson Greenville, SC \r\nJohnathan Mark DuBose Sumter, SC Paul Loring Wilson Summerville, SC \r\nSteven Michael Long Augusta, GA Paul E. Wrona Simpsonville, SC \r\nJames Andrew Lynch Spartanburg, SC Eric Jayson Young Piedmont, SC \r\nManagement \r\nDominick Antonio Baird Pickens, SC Heather Noel McGee Columbia, SC \r\nPaul Anthony Caputo Essex Fells, NJ Amy Lane McGuire Springfield, VA \r\nPhilip Salvatore Caputo Ill Essex Fells, NJ Alisa Dawn Mims Anderson, SC \r\nLisa Renee Clifton Anderson, SC Carlos Manuel Morejon Fort Lauderdale, FL \r\nSedecia Sojourner Cook Gilbert, SC Rewis Aubrey Morris Marion, SC \r\nDayton Brice Cox Loris, SC Carin Susanne Myles Parkersburg, WV \r\nJames Monroe Cox Spartanburg, SC Douglas W. Pollard Chester Springs, PA \r\nLawrence Taylor Garick Ill Orangeburg, SC David Mark Rhyne Clemson, SC \r\nHugh Timothy Grady Easton, MD William Spence Richardson Lexington, SC \r\nEdward Garland Gravely Clemson, SC Michael Joseph Riley Anderson, SC \r\n+ .. Heather Jean Hajduk Havelock, NC Cory Andrew Rodgers Waynesboro, VA \r\nLee McGavock Heller Upper Saddle River, NJ Charles Allen Rowell, Jr. Charleston, SC \r\nJames Morrison Hills Ill Charleston, SC Christopher Kyle Scott Salisbury, MD \r\nGerard George Horstmann Ill Babylon, NY Tanya Scott Charleston, SC \r\nGina Marie Jackson Charleston, SC Thomas Harry Selander Charleston, SC \r\nWilliam Joseph Kennedy IV Cheraw, SC John Whijworth Shaw Sumter, SC \r\nEdward Bratton Land, Jr. Charlotte, NC James Michael Spielberger Miller Place, NY \r\nWilliam Lawrence Laval IV Columbia, SC Sean Brian Stanton Lebanon Township, NJ \r\nMary Lynn Patrick Lee Summerton, SC David Elizarde Sumera, Jr. Beaufort, SC \r\nHee Jeoung Lim Seoul, Korea Brian Scott Varn Hilton Head Island, SC \r\nTobin Michael Logel Piedmont, SC Taffron Nachotae Vereen Johnsonville, SC \r\nStephanie Nicole Maddox Easley, SC Lou Ann Waldrop Newberry, SC \r\nChristopher Beamon Mahaffey Decatur, GA Dana Leigh Webb Mt Airy, MD \r\nChristopher Douglas Mahn Conway, SC Julie Lynn Wissing Seminole, FL \r\nFreeman Rudolph Matthews ___ New Orleans, LA Jennifer McKecknie Woggon _ Hilton Head Island, SC \r\nMarketing \r\nNorman A. E. Baker Buenos Aires, Argentina John Paul Laird _ _ ______ Birmingham, AL \r\nCynthia Anne Banisch Edgewater, MD Heather Lyn Langendorfer Maumee, OH \r\nJeffrey Wayne Bowyer Greenwood, SC Nathan Emerson Manning Wilmington, DE \r\nPatrick Joseph Broome Rock Hill, SC Jason Patrick Manwaring Spartanburg, SC \r\nJill Suzanne Bryan Goose Creek, SC Michael Morgan Mayhew Middletown, NJ \r\nJoel Patrick Catalano Edinboro, PA Amy Kathryn McConnell Pendleton, SC \r\n+' .. Richard Faist Challen, Jr. Snellville, GA Robert William McDavid Clemson, SC \r\nChristiane Jean Conrad Springfield, VA Ashley Yvonne Moore Greenville, SC \r\nChristopher Charles Cooney Denville, NJ Francis Mitchen Ott Ill Rowesville, SC \r\nChristy Pace Copeland Greenville, SC Robert Ledford Redmond Seneca, SC \r\nMichael Kenneth Fleming Mclean, VA Monica Louise Shaw Columbia, SC \r\nCraig Michael Fleury Montvale, NJ Marc Joseph Sklar Columbus, GA \r\nRandall Wayne Gaymon Florence, SC Joseph John Somma Stamford, CT \r\nKim Marie Hajduk Havelock, NC Robert Andrew Stockhausen Elm Grove, WI \r\nKeri Lynn Henderson Corning, NY Sandra Ellen Trautwein Marlboro, NJ \r\nWilliam Clarence Higginbotham Ill __ Orangeburg, SC Kenneth Edward Wills Mauldin, SC \r\nTextile Chemistry \r\nJohn Alan Baggott ___ Virginia Beach, VA \r\nTextile \r\nLori Alicia Hal.I_ --,-----,----------·Batesburg, SC \r\nJannice Colletta Jackson Greenville, SC \r\nScott Antawio Pendergrass Fort Mill, SC \r\nEric David Reinking Rock Hill, SC \r\nManagement \r\nJeremy Stephen Thomas _______ Fort Mill, SC \r\nCandace Margaret Weber Union, SC \r\nDevonne Williams Sumter, SC \r\nTextile Science \r\nlrfan Hanif __________ Karachi, Pakistan Patrice Kelly Nazzaro ________ Ramsey, NJ "
    },
    {
        "page_number": "26",
        "text": "COLLEGE OF EDUCATION \r\nBOBBY GUINN WIXSON, Acting Dean \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\nLaura Ann Ballentine _______ Clemson, SC Diamond Yvette Gethers ______ Eutawville, SC \r\nJulia Hawkins Bishop Seneca, SC Janice Kimberly Green Beaufort, SC \r\nStephanie Hazen Boles Greenville, SC ••Margaret Carol Johnson Greenville, SC \r\nNanette Rebecca Brown Bethune, SC Heather Marie Kelly Columbia, SC \r\nAm/ Carla Canaday Bowman, SC Karen Michele Olivier Summerville, SC \r\n... Brenda Ragland Currie Clemson, SC 0Ann Carol Sieverdes Clemson, SC \r\nAllyson Kay Dixon Walhalla, SC Tracy Lee Smart Ridge Spring, SC \r\nJennffer Lynn Ellis Inman, SC •Jennifer Hope Topping Stuart, FL \r\nElementary \r\n.. Tracy Allen Alexander Easley, SC \r\nSusan West Atkiss Dallas, TX \r\nMonica Charlene Bailey Hartsville, SC \r\nRobin Michelle Barrett Central, SC \r\nKimberly Nicole Baxley Barnwell, SC \r\nKimberly Ellenburg Burgess Pickens, SC \r\nCynthia Ellen Carroll Larchmorrt, NY \r\nMary Kathryn Carter Cheraw, SC \r\nAlissa Jayne Clapper Redlands, CA \r\n°Kimberly Ann Cromer Greenville, SC \r\nLane Stiles Cumbus Greenville, SC \r\nPamela Evette Davis Manning, SC \r\nJenn~er Renee Foreman Roswell, GA \r\nJennifer Lynn Frazier Greenville, SC \r\nWanda Dale Gause Irmo, SC 0\r\nShelley Renee Goldstein Charleston, SC \r\nKristen Renee Hill Fort Mill, SC \r\nKady Faith Jacobs-Moss __ St Thomas, Virgin Islands \r\nWade Hampton Jordan Ill Johnsonville, SC \r\nSecondary \r\nAlicia Renee Alston ------~~Sumter, SC \r\n'Lauri Nicole Atchley Spartanburg, SC \r\nRonda Jo Ball Irmo, SC \r\nBryan Arrthony Clevenger Newberry, SC \r\nAlicia Farr Clinger Easley, SC \r\nJames Ray Fidler Sumter, SC \r\nBrian Ketth Franklin Laurens, SC \r\n'Brandon Lee Garrett Laurens, SC \r\nCynthia Ann Harwood Fredericksburg, VA \r\nMichael Brent Lancaster Spartanburg, SC \r\nMichael Ashley Land Asheville, NC \r\nAndrea Lynn Leaphart West Pelzer, SC \r\nMilton Melanchton Malkus IV Cambridge, MD \r\nEducation \r\nBecky Ann Kesler ________ Newberry, SC \r\nJulie Ann Kunze Hilton Head Island, SC \r\n°Christina Dawn LeMay Easley, SC \r\n•Amy Berit Lenhart Alpharetta, GA \r\n.. Betty Ann Martin Seneca, SC \r\nShelby Lyn McGovern Arlington, VA \r\nDonna Jennings Merritt Easley, SC \r\nStacey Ann Metz Anderson, SC \r\nValerie Frances Pate Greenville, SC \r\n•Allyson Caroline Reeves Charleston, SC \r\nDonna Denise Robinson Marietta, SC \r\nTonya Rabon Seay Lugoff, SC \r\nMelinda Kristine Strain Gaffney, SC \r\nSusan Laura Streeter Fort Lauderdale, FL \r\nCraig Alexander Tarnbini Easley, SC \r\nSharon Rene Todd Conway, SC \r\nAngela Diane Ware Spartanburg, SC \r\nCrystal Denise Whtte Westminster, SC \r\nJennifer Erin Wilson Columbia, SC \r\nEducation \r\nTheresa Amanda Marshall. ____ Orangeburg, SC \r\nJenn~er Elaine McGinn Marshfield, MA \r\nRandy Allen Morris Landrum, SC \r\nCarl Bryce Nelson Lenexa, KS \r\nDavid Lopez Reese Hopkins, SC \r\n' °Kimberly Monisha Richburg Summerton, SC \r\nGrant Scott Steenrod West Chester, PA \r\nAngela Paulette Thrift Mayo, SC \r\nBradley Evans Watson Lyman, SC \r\nClaude Ayers Watson IV Columbia, SC \r\nTara Nicole Watson Chesterfield, SC \r\n.. Kindra Elizabeth Wills Saluda, SC \r\nBryan Eugene Woody Pickens, SC \r\nSpecial Education ... Gail Norment Craddock~ ____ Anderson, SC Laura Elizabeth Davis ________ Taylors, SC \r\nBACHELOR OF SCIENCE \r\nGraphic Communications 0\r\nMarcy Ann Amason _______ Greenville, SC Caryn Lee Jenkins ________ _ Aiken, SC \r\nScott Alan Bibb Seneca, SC Michael Shane Kisner Studley, VA \r\nBeverly Dawn Bowden Camden, SC Ami Nicole Lesh Ellicott City, MD \r\nBrian Richard Cook Laurens, SC Steven Maurice Lewis Marietta, GA \r\nCassandra Gayle Cook W!nnsboro, SC Sarah Elizabeth McNorrill Aiken, SC \r\nDarren Walter Cumming Naples, FL Kevin John Peters Clemson, SC \r\nCorrnac Finnerty Mullingar, Ireland Kristie Lynn Seiverth Melbourne Beach, FL \r\nAndrew Kirk Gommer Greenville, SC Anthony Scott Thrift Pickens, SC \r\nJoseph Lloyd Hill Columbia, SC Julie Renee Weed Lexington, SC \r\nDominic Francisco Ibarra Greenville, SC Christopher Emil Williams Orangeburg, SC \r\nIndustrial Education \r\nMichael James Carlson ______ Greenville, SC Harold Bryan Rowland Central, SC \r\nCharles Cleveland Eberhart Spartanburg, SC Lewis Wendell Usher Atlarrta, GA \r\nWarren Timothy Forney Rutherfordton, NC 0\r\n'Edward Carson Wheaton, Jr. ___ Grantteville, SC \r\nCaroline Hudgins Goree Asheville, NC Stephen Bernard Wynn Winnsboro, SC "
    },
    {
        "page_number": "27",
        "text": "Mathematics Teaching \r\nJohn Joseph Aluza ______ New Bedford, MA Hubert Chamblee McClure _____ Anderson, SC \r\nMickey Ray Edmonds Joanna, SC Robyn Sue Scott Seneca, SC \r\nMichael William Hamilton Greensboro, NC Timothy Brant Strickland Piedmont, SC \r\nScience Teaching \r\nNancy McDonald Hicklin ______ Winnsboro, SC \r\nChadwick Lawson Marett Anderson, SC \r\nCynthia Elaine Allen _______ ~ Central, SC \r\nRobert William Blanton Blacksburg, SC \r\nPaila Marie Carr Easley, SC Maureen Dolores Webb Ramsey, NJ \r\nKimberly Faye Eldridge Fort Mill, SC \r\nCOLLEGE OF ENGINEERING \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF SCIENCE \r\nAgricultural Engineering \r\n(Agricultural Engineering is jointly administered by the College \r\nof Agricultural Sciences and the College of Engineering.) \r\nMorgan Teige Elliott _______ Summerton, SC ... Jason Lavern Poston _______ Gresham, SC \r\nBrian Walker Hill Moncks Corner, SC Karyn Nicole Woottolk Columbia, SC \r\nTracy Kathleen McKee Columbus, OH \r\nCeramic Engineering \r\n•Allan Baynham Barnes Williston, SC Alicia Sherryetta Mobley ______ Winnsboro, SC \r\nThornton Allen Barrow, Jr. Columbia, SC Scott Timothy Morin North Brookfield, MA \r\nTerence Anthony Caliguire Barnegat, NJ Brian Russell Scott Brookeville, MA \r\n+ .. Kimberty Gail Christmas ___ Ormond Beach, FL James Matthew Shealy Prospertty, SC \r\nWilliam Chet Crowley Greenville, SC Melvina Yvette Sumter Columbia, SC \r\nArmond Edward D'Alessandro North Charleston, SC \r\nJason Benjamin Harris - Savannah, GA \r\nWilliam Samuel Warden Isle of Palms, SC \r\nAndrew John Wills Barnwell, SC \r\nPerry Ballenger Henderson, Jr. ___ Greenville, SC Gregory Neil Yourkievttz Taylors, SC \r\nMary Jene Tobler Kayser Mobile, AL \r\nChemical Engineering \r\nChristopher Michael Barr _____ Spartanburg, SC Jeffrey Michael Siebert:------_Jamestown, NC \r\nRussell Wesley Cothran Inman, SC Chartes Ernest Taylor IV Orangeburg, SC \r\nClvll Engineering \r\nFreddia Charlene Bartless Greenwood, SC Stacey Lynn Oxendine Manning, SC \r\nRobert McVernon Baysden Irmo, SC Philip David Quillin II Virginia Beach, VA \r\nChris David Bishop Spartanburg, SC James Kevin Reed Buford, GA \r\nMttchell Martinez Blanco Goose Creek, SC Thomas Donovan Reed Easley, SC \r\nGeorge Tilley Bull Lexington, SC Lee Stanley Robertson Rock Hill, SC \r\nMark Denver Cathey Candler, NC Kevin Ray Ross Easley, SC \r\nJohn Andrew Connelly Simpsonville, SC Christopher John Sable Suwanee, GA \r\nCharles Christopher Eberhart Anderson, SC Derek Zane Schlotterback Simpsonville, SC \r\nMark Touton Elliott Rimini, SC •william Cart Schwartz II Moore, SC \r\nRobert Hamilton Ellis Chipley, FL •Jeffrey Charles Sciaudone Newtown, CT \r\nJennifer Patricia Felder Lexington, SC Christopher Ryan Stacy Asheville, NC \r\n+•Robert James Greenwald Greenville, SC Bobby Wayne Stanfill Greenwood, SC \r\n+•Matthew Michael Gustis Marietta, GA +• .. David Lee Stricklin, Jr. Cheraw, SC \r\nHieronymous Hamilton Columbia, SC Edward Joseph Teodosio Ansonia, CT \r\nGlen Donald Heagerty Summerville, SC .. Douglas Howard Truluck, Jr. ___ Charleston, SC \r\nValerie Elizabeth Holmes Greenville, SC Denise Elizabeth Turner Fort Mill, SC \r\nRobert Wayne Leap, Jr. Charleston, SC Dustin Swain Turner Varnville, SC \r\nWade David Lewis North Myrtle Beach, SC .. Kevin Michael Vaughan Hanahan, SC \r\nJeffrey Clark Lindsey Greenville, SC Kevin Lewis Webber Orangeburg, SC \r\nCart Robert Lawrence Mangrum ___ Amissville, VA Edward P. Weber, Jr. Hilton Head Island, SC \r\nJeffrey Neal McCracken Canton, NC Bryan Jeffrey Williams Summerville, SC \r\nEdward Kelly Medlock Spartanburg, SC Candice Sherree Williams Lancaster, SC \r\nVerley Craig Metts Batesburg, SC David Geoffrey Wilson Houston, TX \r\nChristopher Stephen Morin ___ North Augusta, SC Julie Anne Youngblood Fort Mill, SC \r\nComputer Engineering Lisa Renee Adams ________ Clemson, SC Curtis Anthony Holmes _____ Overtand Park, KS \r\nMarjorie Portia Anderson Columbia, SC ••Joseph Willis Logan Greenwood, SC \r\nParker Monroe Burden Greenville, SC Christopher J. Pappas Easley, SC \r\nJoseph James DelCollo Holland, PA Karen Marie Rekuc Edison, NJ \r\nDavid Adam Feig New York, NY ••Robert Lee Willis Valdese, NC "
    },
    {
        "page_number": "28",
        "text": "Electrlcal \r\nWilliam Thomas Anniss Ill ----- Seneca, SC \r\nRobert Henry Breland Denmark, SC \r\nWillie Sherman Callaham McCormick, SC \r\nBruce Randall Carter Savannah, GA \r\n·David Patrick Cullen Spartanburg, SC \r\nWarren Everett Dixon Jackson, SC \r\nKevin Jermaine Duck Greenville, SC \r\nMichael Wayne Enderson Hickory, NC \r\nKenneth Lamont Evans Columbia, SC \r\n+··Matthew Glenn Feemster York, SC \r\nRichard Parker Flaspoehler Greenville, SC \r\nRobert Franklin Higbe Ill Andrews, SC \r\nErastus Ivey Ill Columbia, SC \r\nScott Ketth Jackson Ladson, SC \r\nEngineering \r\nAhmed Fouad Kamel Cairo, Egypt \r\nChristopher Paul King Westminster, SC \r\nRoger Ray Lanagan Sioux Ctty, IA \r\nSamuel Dickson O'Brien Columbia, SC \r\nJohn Thomas Rutledge Sunset, SC \r\n••Daniel Mark Smtth Fredericton, New Brunswick \r\nTravis Vernon Spoon;;--- Hodges, SC \r\nEbonia Denise Washington Eastover, SC \r\nTerriel Danyelle Watson Columbia, SC \r\nJohn Francis White Ravenel, SC \r\nJerry Mark Whitfield Anderson, SC \r\nKevin Wilson Womack Greenville, SC \r\nAntonio Devon Woods Clio, SC \r\nRichard William Youngblood Anderson, SC \r\nEngineering Analysls \r\nSamantha Cochran Dellinger _____ Concord, NC Jason Donald Stroud ________ Lyman, SC \r\nTttus Pierre Gibbs Pamplico, SC \r\nlndustrlal \r\nKevin Blaine Brown Moncks Corner, SC \r\nEngineering \r\nEric David Mossbrook ______ Nicholasville, KY \r\nBrian William Delaney ___ Washington Township, NJ Alison Beth Rankin Aiken, SC \r\nTimothy Sean Kelley Mendham, NJ Alonzo Antonio Rogers Camden, SC \r\nAngelia Francine Ladd Easley, SC Paige Richards Shuping Greenville, SC \r\nChristopher David Lorinovich Charlotte, NC LeNelle Holland Tanner Greenville, SC \r\nMechanlcal Engineering \r\nStacy Elizabeth Barton Ogdensburg, NJ Jason Jerrod Jenkins ______ Orangeburg, SC \r\nJoseph Allan Brock Seneca, SC Paul Thomas King, Jr. Florence, SC \r\nMichael Stuart Brock Katy, TX Gary George Marshall Westminster, SC \r\nWade Alan Buehler Seminole, FL Randy Ray Massey Taylors, SC \r\nShane Thomas Bulman Roebuck, SC Michael George McElmurray Clemson, SC \r\n•Andrew Kevin Charles Columbia, SC Stephen Bradley Meredith Spartanburg, SC \r\nGregory Scott Clemson Florence, SC +•sandon Kyle Moore North Augusta, GA \r\nEric James Cline North Charleston, SC Edie Elizabeth Morgan Spartanburg, SC \r\nJason Chadwick Collins Anderson, SC Philip Wayne Neal Heath Springs, SC \r\nGeorge Edward Connaughton __ North Augusta, SC Jorge Pacheco Rodriguez Ecstepec, Mexico \r\nKevin James Conner Rocky Point, NY Frank Michael Page Easley, SC \r\nBrian Andrew Cope Newark, DE Gregory Tyrone Rivers Cordova, SC \r\nFrank A. Cornelius Monroe, NY Stephen Thomas Schill Greer, SC \r\nHoward Holbrook Curtis Centreville, VA Carl Vaughan Schmidt, Jr. Greenville, SC \r\nKevin Stefan Douglas Hartsville, SC •Deborah Diane Smtth Spartanburg, SC \r\nMatthew Dean Farmer Charleston, SC Hugh B. Smtth Gaffney, SC \r\nSean Gainey Chesterfield, SC Andrew Michael Thorne Walhalla, SC \r\nSteven John Gnegy Summerville, SC Jacqueline Jones Todd Easley, SC \r\nStanley Dean Grijfis Anderson, SC Chad Michael Werts Fayetteville, NC \r\nRodney Pernell Hammonds Ridge Spring, SC William Darrell Whtte, Jr. Columbia, SC \r\nAlice Hill Greenville, SC Nicholas Daryl Williams Greenville, SC \r\nArthur Benjamin Hughes Greenwood, SC ··Lawrence Otis Williamson Greenville, SC \r\nJennifer S. lliria Summerville, SC Melony Armstrong Young Greenwood, SC \r\nCOLLEGE OF FOREST AND RECREATION RESOURCES \r\nG. JAY GOGUE, Acting Dean \r\nBACHELOR OF SCIENCE \r\nForest Products \r\nKenneth Nathaniel Session _____ Andrews, SC Byron Taylor Yancey Ill _ _____ Pound Ridge, NY \r\nDonald Thomas Sherman Latta, SC \r\nForest Resource Management \r\nClaude Jones Alexander _____ Greenwood, SC \r\n•peter Michael Balthazor Columbia, SC \r\nRichard Kirkland Gibson-----=- Rock Hill, SC \r\nJohn Leanard Haney Summerville, SC \r\nJames Baxter Cash Easley, SC Melissa Craddock Means West Columbia, SC \r\nDeborah Kaye Deas McClellanville, SC \r\nParks, Recreation, and \r\nDana LeRonne Abernathy ---~-~Clem on , SC \r\nTourism Management \r\nJulie Ann Dombal. _ ___ _ _ ___ .Hillsdale, NJ \r\nPaul Martin Bagwell, Jr. Hendersonville, NC Bryan Anthony Garcia Haymarket, VA \r\nTeresa Annette Brown Lodge, SC William Brent Griffin Lilburn, GA \r\nAmanda Cathey Anderson, SC Carol Stacy Hammond Fort Mill, SC \r\nTara Anne Coleman Pamplico, SC Paula Rene Harris Clemson, SC \r\nCatherine Mims DeMars St Matthews, SC James Gregory Hood Anderson, SC \r\nTimothy Michael Doddridge Burke, VA Veronica Ann Huffman Easley, SC "
    },
    {
        "page_number": "29",
        "text": "Parks, Recreation, and Tourism Management (continued) \r\nChristine Helene Jackson, _____ Vicksburg, MS Margaret Hope Mclure, ________ lm10, SC \r\n.. Gary Michael Johnson Fort Myers, FL Michael Kevin Phillips Seneca, SC \r\nGerald D. Johnson Kershaw, SC Dana Terese Puckett Kingston, TN \r\nMichael Lee Judd Easley, SC Charlotte Waters Westminster, SC \r\nRhonda Leigh Keisler Lexington, SC Andrea Barr White Newberry, SC \r\nPeter Usher Kennedy Hartsville, SC Colby Nelson Wood Pittsburgh, PA \r\nRobin Lynn McKay Charleston, SC Julie Elizabeth Wrenn Fountian Inn, SC \r\nAmy Hope Mclure lm10, SC \r\nCOLLEGE OF LIBERAL ARTS \r\nJAMES FRAZIER BARKER, Acting Dean \r\nBACHELOR OF ARTS \r\nEnglish \r\nJohn Michael Bailey Simpsonville, SC Brett Lance Kicklighter ________ Inman, SC \r\nEdan Ballantine Hihon Head Island, SC Jill Ann Lingenfelter Miami, FL \r\nDavid Justin Brauns Ocean City, MD +'Stacy Lanae Murray Augusta, GA \r\nDavid Gerald Cotugno ___ Upper Saddle River, NJ Nathaniel Marsh Peirce Sherborn, MA \r\nRobert Von Doster Lancaster, SC Kim Lien Strohman Annapolis, MD \r\nAshley Marie Jacobs Georgetown, SC Chad Blanton Thompson Anderson, SC \r\nHistory \r\n' Jessica Irene Benjamin ______ Clemson, SC Judith Elaine Jordan Charleston, SC \r\nAnsley Perry Chapman Florence, SC 'Christopher Conrad Long __ Colorado Springs, CO \r\nMelanie Jill Correll Cassatt, SC +' .. Tricia Love Gilbert Quirk Seattle, WA \r\nElizabeth Nash Gray Columbia, SC Paul Miles Ridgway Jacksonville, FL \r\nBlythe Blackston Hamihon Seneca, SC Dawn Marie Sheridan Charleston, SC \r\nMonique Pate Harris Greenville, SC Tara Vanessa Stevenson West Union, SC \r\nKatharine Allison Johnson Greenville, SC ... William Jacob Watkins, Jr. Seneca, SC \r\nLanguage and International Trade \r\n'\"Kathryn Elizabeth Benda ____ Tallahassee, FL Richard Paul Pehz Walkersville, MD \r\nTheresa Colleen Benson Simsbury, CT Robert Verner Phillips, Jr. Charlotte, NC \r\n.. Maria Demetriou Newark, DE Gina Marie Pitta Carlisle, PA \r\nKristie Carol Gantt Lexington, NC ' Shannon Leigh Pittman Spartanburg, SC \r\nHeyward Frederick Glenn Jenkinsville, SC Tomas Vincent Rodriguez ___ West Palm Beach, FL \r\nShannon Deone Hampton Columbia, SC Laurie Lynn Rucker Swansea, SC \r\nJohn Elliott Hughes Jacksonville, FL ' Nancy Elizabeth Solomon Danbury, CT \r\nErica Elaine Hull Newberry, SC William Scott Speights Atlanta, GA \r\nShannon Bochette Owens Bishopville, SC Douglas Patrick Warner Clemson, SC \r\nModern Languages \r\nPatricia Koch ___________ Clark, NJ Crayton Neville Silsby ____ ___ Houston, TX \r\nPolltlcal \r\nCynthia Renee Bamberg ----- Denmark , SC \r\nMatthew Charles Beadling Piscataway, NJ \r\nMatthew Christian Belger Ramsey, NJ \r\nMary Beth Gossett Greer, SC \r\nScience \r\nJoshua Daniel Martin ~------Ridgewood , NJ \r\nJohn Christopher Partin Clemson, SC \r\nJames Edward Scott IV McClellanville, SC \r\nRebecca Anne Steifle Greenwood, SC \r\nPsychology \r\nThomas Matthew Addison _____ Cottageville, SC Leigh Ann Mccrary .,...., _ ____ Travelers Rest, SC \r\nAllison Anders Charleston, SC David Leigh McDaniel Norfolk, VA \r\nCynthia Renee Beatty Seneca, SC Kashia Alexandra Orlando Miami, FL \r\nDeanna Anne Bishop Greer, SC Michael Arthur Phillips Anderson, SC \r\nMargaret Melanie Byrum lm10, SC .. Debbie Michelle Rhyne Greenville, SC \r\nSherry Darlene Crain Greenville, SC Paul Clifford Shivery Ill Fairlax, VA \r\nErica Renee Dilsaver Beaufort, SC Ted Cox Thomas Betton, SC \r\nLaura Elisabeth Foster North Granby, CT Aimee Lynn Wade Carlisle, PA \r\nThomas Patrick Grindstaff Simpsonville, SC Elaine Wheaton Anderson, SC \r\nDonna Shireen Lyles Camden, SC Jeffrey Brian Wilson Anderson, SC \r\nTammy Autry McCall Autryville, NC \r\nSocio logy \r\nBarbara Marie Austin ------- Greer, SC Jenntter Susan Kottka ____ Ocean Township, NJ \r\nSherry Brooks Gaston, SC Elizabeth A. Martin Union, SC \r\nAnne Leize Campbell Memphis, TN Mary Kathryn Mcintyre North Olmsted, OH \r\nBrian George Fahnle Greenville, SC Satira Antonika Milam Simpsonville, SC \r\nJoe Bennett Floyd, Jr. Green Sea, SC Louis J. Potenza Wayne, NJ \r\nPhillip David Hewlett Anderson, SC Derek Stevens Zeigler Sumter, SC \r\nSpeech and Communication Studies \r\nWallace Christopher Hodge __ Hihon Head Island, SC Ryan Jeffrey Jones _______ Charleston, SC "
    },
    {
        "page_number": "30",
        "text": "DOUBLE MAJOR \r\nEnglish and History \r\nGuiHord Harrison Walpole __ Johns Island, SC \r\nHistory and Polltlcal Science .. Kalinthia Rene Dillard _ __ Greenville, SC \r\nPsychology and Soclology \r\n•Julie Martin Taylor Anderson, SC \r\nPsychology and Spanish \r\nLesley Williams Douglas ___ Anderson, SC \r\nPsychology and Speech and Communication Studies \r\nJames A. Carling Quaker Hill, CT \r\nCOLLEGE OF NURSING \r\nOPAL SHEPARD HIPPS, Dean \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\nAimee Jo Guanlao ________ Richlands, VA Marci Donya Mac Vean _______ Oakton, VA \r\nSusan Ann Haseltine Alexandria, VA William Campbell Mclain IV Columbia, SC \r\nLeslie Jeannette Laird Morris, IL Joby Michele Simpson Greenville, SC 0\r\nMelissa Anne Lyons Columbia, SC Leslie Anne Story Anderson, SC \r\nNursing \r\n... Ingrid Carla Baldwin ------~Toccoa , GA Tammy Rene Martin ________ Roebuck, SC \r\nKristin Lee Blackwell Lake Wylie, SC 0Dale Petty Mauldin Seneca, SC \r\nLa Tonya Nicole Brown Port Royal, SC Caroline Louise McMillian Tifton, GA \r\nChristi Marie Cape Anderson, SC Susan Elaine Moore Sumter, SC \r\n•Joy Ruth Carter Timmonsville, SC Catherine Jeanne Nutt Parsippany, NJ \r\nConchetta Leatrice Cole Cheraw, SC Cathleen Renee Patrick Liberty, SC \r\nKristine Cook Park Ridge, NJ + .. D. Shannon Pierce Greenville, SC \r\nBeth Kern Demos Greenville, SC Maureen Elizabeth Rider Columbia, SC \r\nSonia Daunita Dennis Florence, SC Jenn~er Michelle Rogers Clemson, SC \r\nRuth Hudspeth Douglas Easley, SC Carol Elizabeth Royals Greenville, SC \r\nWalter Thomas Doyle Ill Badham, SC ·connie Clark Simpson Abbeville, SC \r\nIris Lynn Felder Charleston, SC William Kader Simpson Greenville, SC \r\nJohn-Morgan Fromme! Piedmont, SC Stacey April Hart Smith Seneca, SC \r\n°Kerry Kelley Harper Walhalla, SC Wendy Ann Soltis Fords, NJ \r\nChristopher Daniel Hill Honea Path, SC Dawn Michele Stoltz Orangeburg, SC \r\nDarrell Luke Holland Townville, SC Pamela Renee Thompson Anderson, SC \r\n•sandra L. Jacobs Anderson, SC Pamela Carol Vaughn Anderson, SC \r\nCrystal Harriet James Liberty, SC Stephanie Ravan Vess Greenville, SC \r\nKristi Butts Kelley Seneca, SC Desiree Denise Williams Newberry, SC \r\nAngela Kay Kent Anderson, SC Tonia Michelle Wortey Fair Play, SC \r\nLinda Yi LaPointe Myrtle Beach, SC \r\nCOLLEGE OF SCIENCES \r\nBOBBY GUINN WIXSON, Dean \r\nBACHELOR OF ARTS \r\nBlologlcal Sciences \r\nJohn Charles Compton ______ Anderson, SC Morgan Anderson Norris ______ St George, SC \r\nKerri Lyn Forrest Charleston, SC 0\r\nLaurie Anne Townsend Anderson, SC \r\nShawn Ian Moon High Point, NC \r\nComputer Science \r\nJames Dennis Chapman _____ Goose Creek, SC Ray Harper, Jr. _ _ _______ Anderson, SC \r\n••Brian Peter Cieslak Coral Springs, FL \r\nMathematlcal Sciences \r\nSheila Eugenia Hamby _ __ Greenville, SC \r\nPhysics \r\nJonathan Edward Felger _ __ Charleston, SC "
    },
    {
        "page_number": "31",
        "text": "BACHELOR OF SCIENCE \r\nBiochemistry \r\nLeland Mccarley Bryson _______ .Seneca, SC + .. Eric Leighton Klett _______ Columbia, SC \r\nMelissa Ann Dempster Lexington, SC 0lina Marlo Presutti Des Plaines, IL \r\nAlan Ray Harper Greenville, SC +•Justin Thomas Reese Altoona, PA \r\nDavis Harrelson Ill Mullins, SC Rebecca Lynn Townsend Inman, SC \r\nBiological Sciences \r\n·wayne Lowell Amsbary _____ Parkersburg, WV Christopher Gill Goodier _____ New Orleans, LA \r\nKerry Patrice Ball Kingsport, TN Mary Paula Petty Landrum, SC \r\nRichie Lewis Burke Woodruff, SC Maria Lynn Pugia Longs, SC \r\nTimothy Robin Dutton Anderson, SC \r\nChemistry \r\nTrudy Lee Creasy ________ Greenville, SC Kimberli Dennise Lollis ______ Greenville, SC \r\nPeter John Delorme Nome, AK .. Mark Eugene Whitten Inman, SC \r\nComputer Information Systems Nancy Carol Deese _ _______ Mauldin, SC Trina Joy Moore ______ ___ __ Irmo, SC \r\nBenjamin Joseph Marsella Winter Springs, FL James Preston Poole Charleston, SC \r\nKhang Lamont Martin Seneca, SC 0Michael Andrew Stover Greenville, SC \r\nComputer Science \r\nGregory Walter Denisowski _ _ ___ Charleston, SC Marc Paffrath Oburg, _ _______ Kinnelon, NJ \r\nShannon Elizabeth Duncan Chapin, SC Chris J. Pappas Easley, SC \r\nDaryl Craig Huckabee Bethune, SC Francis Horace Smith, Jr. Irmo, SC \r\nPamela Delores Ketter Darlington, SC James Russell Terry Clemson, SC \r\nJames Douglas Mays Camden, SC David Blake Werts Laurens, SC \r\nPa'Oultha LaFaye Mitchell Belton, SC \r\nGeology \r\nRichard Allen McFaul _______ Glenelg, MD Ronnie Lance Watson _______ Easley, SC \r\nMary Tamara Oates Woodruff, SC \r\nMathematlcal Sciences \r\nJeffrey Scott Buys ________ Columbia, SC Ginger Leigh Smyre. _________ Greer, SC \r\nBrian Patrick Cromer Seneca, SC Jacinta Monique Warren Sparta, GA \r\nMedlcal Technology \r\nAllison E. Bays. _ _ ______ Bethlehem, PA Tanya Maureen Taylor _______ Donalds, SC \r\nKenneth Verdelis Ford Charleston, SC \r\nMicrobiology \r\nWilliam Tyler Coleman, _______ Jackson, MS James Christopher Manos ______ Hickory, NC \r\nKevin Wales Gilstrap Greenville, SC Yolanda Renee Martin Columbia, SC \r\nDeanna Rae Hygema Cayce, SC Jennifer Erin Peelman Estill, SC \r\nBrian Thomas Kinsey Winston-Salem, NC Valerie Elaine Sellers Elloree, SC \r\nRebecca Andrea Lee Easley, SC Sharnder Denise Washington Holly Hill, SC \r\nPhysics \r\nAmy Wright Ahl _____ _ ___ Rock Hill, SC Joseph Alston Miller, Jr. _ _____ Greenwood, SC \r\n+ .. Mark Steven Bolding Birmingham, AL + .. ' Timothy Edward Ott Laurens, SC \r\n+'Jeffrey Earl McDonald Anderson, SC Michael Allan Powell Seneca, SC \r\n'Cum laude: A grade point ratio of 3.40 to 3.69 \r\n.. Magna cum laude: A grade point ratio of 3.70 to 3.89 \r\n... Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\n+Senior Departmental Honors: The students so designated have earned a B or better in the six to twelve credits \r\nof honors work at the upper division level in a program designed by their department. They have maintained a \r\nminimum GPA overall of 3.40. They appear in the line of march with an honors medallion on an orange and purple \r\nribbon. "
    },
    {
        "page_number": "32",
        "text": "Hlstorlcal Statement \r\nClemson University is named for Thomas Green Clemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the Royal \r\nSchool of Mines in Paris (1828-1832). His early profession was that of a mining \r\nengineer; however, circumstances diverted his interests into politics and the life \r\nof a southern planter, and he soon became an enthusiastic advocate of scientific \r\nagriculture. He had a career as a diplomat (charge d'affairs to Belgium, 1844-\r\n1852) and served as the first Superintendent of Agricultural Affairs in Washington \r\n(1860). As a scientist he published numerous articles in the fields of mining, \r\nchemistry and agriculture. His varied activities included his assistance in the \r\nfounding of the Maryland Agricultural College, his support of the Morrill Act, his \r\nleadership in South Carolina after the Civil War, and his part in founding Clemson \r\nUniversity. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as a \r\nnational shrine. \r\nThe academic program at Clemson College began in 1893 with an enrollment \r\nof 446. The first \"college prospectus\" announced only two four-year curricula, \r\nsupplemented by two two-year preparatory courses. Today the University has \r\nten major academic units. These are the College of Agricultural Sciences, the \r\nCollege of Architecture, the College of Commerce and Industry, the College of \r\nEducation, the College of Engineering, the College of Forest and Recreation \r\nResources, the College of Liberal Arts, the College of Nursing, the College of \r\nSciences, and the Graduate School. \r\nThe institution is an accredited member of the Southern Association of \r\nColleges and Schools; various curricula are accredited by the National \r\nArchitectural Accrediting Board, National League for Nursing, Society of \r\nAmerican Foresters, American Assembly of Collegiate Schools of Business, \r\nAccreditation Board for Engineering and Technology, and National Council for \r\nAccreditation of Teacher Education. \r\nClemson is a land-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is also \r\nheavily committed to a varied program of public service, including the work of \r\nagricultural extension which has professional personnel located in each of the \r\nState's counties. "
    },
    {
        "page_number": "33",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "34",
        "text": "Note: Candidates appearing in this program are not certified grad\u0002uates. Likewise, academic honor designations are based upon per\u0002formance prior to final grades. Both certification of graduation and \r\nhonor designations must come from the Registrar of the University. \r\n******** \r\nFirst Aid A First Aid Station is located at Portal 0. \r\nEvacuation System Littleiohn Coliseum is equipped with a fire alarm \r\nevacuation system. In the event of activation, as noted by sustained \r\nhorns and strobe lights, please proceed to the closest available exit. \r\nRemain outside the building until fire officials deem the building safe \r\nto re-enter. \r\nNo Smoking Smoking is prohibited in the seating area of Littlejohn \r\nColiseum. Cigarette receptacles are provided around the outer con\u0002course. "
    }
]