[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n12-21-1995\r\nClemson Commencement Program, December\r\n1995\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, December 1995\" (1995). Clemson Commencement Programs. 129.\r\nhttps://tigerprints.clemson.edu/comm_programs/129"
    },
    {
        "page_number": "2",
        "text": "CLEMSON UNIVERSITY \r\nGraduation Exercises \r\nDecember 21, 1995 \r\nCle1nson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "Congratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for \r\nindividual graduates. Such expressions frequently detract from the \r\nrecognition due the next graduate in line. Your cooperation is respect\u0002fully requested. "
    },
    {
        "page_number": "4",
        "text": "Graduation \r\nThursday, December 21, 1995 \r\n11:00 a.m. Littlejohn Coliseum \r\nORDER OF CEREMONIES \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation.) \r\nInvocation \r\nElisa Lashunn Dixon, Student Representative \r\nIntroduction of Trustees \r\nPresident Constantine W. Curris \r\nConferring of Honorary Degrees \r\nPresident Constantine W. Curris \r\nRecognition of the Deans of the Colleges \r\nProvost J. Charles Jennett \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident Constantine W. Curris \r\nRecognition and Presentation of Awards \r\nClass of '39 Award for Excellence \r\nFrank W. Breazeale, Organist \r\nKevin Davidson, Soloist \r\nDr. C. C. Fain, University Marshal "
    },
    {
        "page_number": "5",
        "text": "BOARD OF TRUSTEES \r\nLawrence M. Gressette, Jr., Chairman ____ Columbia \r\nAllen P. Wood, Vice Chairman Florence \r\nBilly L. Amick Batesburg \r\nLouis P. Batson, Jr. Greenville \r\nJ. J . Britton Sumter \r\nLeon J. Hendrix, Jr. New York, NY \r\nHarold D. Kingsmore Aiken \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee McCormick \r\nLeslie G. McCraw Irvine, CA \r\nThomas B. McTeer, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nTrustees Emeriti \r\nFletcher C. Derrick, Jr. __________ Charleston \r\nW. G. DesChamps, Jr. Bishopville \r\nWilliam N. Geiger, Jr. Columbia \r\nPaul W. McAlister Laurens \r\nBuck Mickel Greenville \r\nPaul Quattlebaum, Jr. Charleston \r\nJames C. Self Greenwood \r\nD. Leslie Tindal Pinewood \r\nJames M. Waddell, Jr. Columbia \r\nExecutive Secretary to the Board of Trustees \r\nManning N. Lomax \r\nADMINISTRATIVE OFFICERS \r\nConstantine W. Curris _________ __ President \r\nJ. Charles Jennett Provost and Vice President for \r\nAcademic Affairs \r\nB. K. Webb ________ Interim Vice President for \r\nAgriculture, Natural \r\nResources and Research \r\nGary Ransdell ____ Vice President for Administration \r\nand Advancement \r\nAlmeda Jacks ____ Vice President for Student Affairs "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nDOCTOR OF LETTERS \r\nJACK C. MCCORMAC \r\nSouth Carolinian and Clemson Professor Emeritus Jack McCormac consistently \r\nhas been one of the most effective and highly regarded classroom teachers at the \r\nUniversity, but he has gained his greatest recognition as an author of textbooks. He \r\nhas published seven major texts and is considered to be among the leading authors \r\nof engineering texts in the world. \r\nProfessor McCormac was born in Columbia and earned undergraduate and \r\ngraduate degrees in civil engineering at The Citadel and at the Massachusetts \r\nInstitute of Technology. He joined the faculty at Clemson where he taught civil \r\nengineering for 36 years. He attained the level of full professor and was named to a \r\nprestigious alumni distinguished professorship, winning great praise from his \r\nstudents for his teaching style, enthusiasm and his ability to motivate them. \r\nProfessor McCormac has written and published several editions of texts on \r\nsubjects of structural analysis, structural steel design, reinforced concrete design and \r\nsurveying. His textbooks have been adopted at more than 500 colleges and \r\nuniversities around the world and have been translated into five languages. More \r\nthan 750,000 texts authored by him have been sold. In addition, he has written parts \r\nof several significant engineering handbooks. \r\nHis worldwide reputation as a distinguished civil engineer educator has helped \r\nClemson solidify its position as an outstanding undergraduate education institution. \r\nHis many honors and awards include an endowed alumni professorship, AT&T \r\naward from the American Society for Engineering Education, Educator of the Year \r\nfrom the Piedmont Chapter of the S.C. Society of Professional Engineers, a national \r\ncitation from the American Institute of Steel Construction, a chapter honor member of \r\nChi Epsilon (civil engineering honor society), Distinguished Practicing Engineering \r\nAward from Tau Beta Pi and Distinguished Alumnus of The Citadel. \r\nProfessor McCormac embodies those ideals that Clemson University values. \r\nHis wide recognition and respect as an author and educator place him in a unique \r\nposition to represent Clemson and its educational mission to audiences throughout \r\nthe world. \r\nIt is indeed a most significant occasion when Clemson University recognizes \r\nand honors one of its own with the presentation of an honorary doctorate for eminent \r\nachievement in scholarship and genuine service to the world academic community. \r\nWe all are extremely proud of the enormous impact he has made on civil engineering \r\neducation through his many textbooks as well as his teaching of several thousand \r\ncivil engineering students in his years at Clemson. \r\nWe hold Professor Emeritus Jack McCormac and his lifetime achievements in \r\nthe highest esteem, and it is a distinct privilege to honor him with the presentation of \r\nthe Doctor of Letters. "
    },
    {
        "page_number": "7",
        "text": "HONORARY DEGREE \r\nDOCTOR OF LAWS \r\nTHOMAS SAMUEL MOORMAN, JR. \r\nAir Force General Thomas S. Moorman, Jr., whose family ties to Clemson are rooted in the \r\nearly days of the college itself, is vice chief of staff, Headquarters, U.S. Air Force, Washington, \r\nD.C. \r\nGeneral Moorman, who was promoted to general on August 1, 1994, has served in a variety \r\nof intelligence and reconnaissance-related positions within the United States and worldwide. \r\nWhile stationed at Peterson Air Force Base, Colorado, in 1982, he became deeply involved in \r\nplanning and organizing the establishment of Air Force Space Command. As commander and \r\nvice commander of Air Force Space Command, General Moorman was responsible for operating \r\nmilitary space systems, ground-based radars and missile warning satellites, the nation's space \r\nlaunch centers at Patrick Air Force Base, Florida, and Vandenberg Air Force Base, California, the \r\nworldwide network of space surveillance radars, as well as maintaining the Intercontinental \r\nBallistic Missile force. \r\nGeneral Moorman was born in Washington, D.C., and received his undergraduate \r\neducation at Dartmouth College, where he earned a bachelor's degree in history and political \r\nscience and was commissioned through the Air Force Reserve Officer Training Corps as a \r\ndistinguished military graduate in 1962. General Moorman also has a master's degree in \r\nbusiness administration from Western New England College (1972), and a master's degree in \r\npolitical science from Auburn University (1975). \r\nIn 1995 General Moorman received the prestigious Dr. Robert H. Goddard Memorial Trophy \r\nfor his contributions to the nation's space program. The recipient is chosen annually for great \r\nachievement in advancing space flight programs which contribute to U.S. leadership in \r\nastronautics. \r\nAlthough not a Clemson alumnus, General Moorman's ties to Clemson historically have \r\nbeen very strong, and his is one of Clemson's historic family names. His grandfather, Thomas S. \r\nMoorman, graduated as a member of Clemson's first class in 1896, became a career officer, and \r\nyears later returned to Clemson as colonel and professor of military science and tactics. He later \r\nheld the position of commandant. Since that time the Moorman family has continued a direct \r\nrelationship to Clemson. \r\nGeneral Moorman's father, also named Thomas, is now a retired Air Force lieutenant \r\ngeneral living in Colorado Springs where he served his last assignment as superintendent of the \r\nAir Force Academy. The honoree's uncle, Robert Moorman, graduated from Clemson and served \r\nas a faculty member, was head of the engineering mechanics department, and coached the \r\nUniversity golf team. \r\nAn aunt, Betty Moorman, worked in the University's business and finance office for 34 years \r\nand is now retired and lives in Clemson. Another aunt, the late Marie Moorman Grimes, was a \r\nsecretary to Dean Sams of the former School of Engineering. The Moorman tradition at Clemson \r\ncontinued as the general's son, John Moorman, graduated from Clemson in 1992. \r\nWe hold General Thomas Moorman and his lifetime achievements in the highest esteem, \r\nand it is a distinct privilege to honor him for his untold contributions to our nation's defense and \r\nto the unparalleled success of the U.S. space program. We present him the honorary degree of \r\nDoctor of Laws. "
    },
    {
        "page_number": "8",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and \r\nhonored guests of the University. Faculty enter by college and each college is \r\npreceded by its marshal, a senior faculty member, with the college baton, described \r\nunder University Regalia. \r\nFollowing the marshal is the college banner bearer. Each banner is a \r\ncombination of colors that declare the disciplines taught in that college . These \r\ncolors, which were established by the American Council on Education, are as \r\nfollows: \r\nCollege \r\nAgriculture, Forestry and Life \r\nSciences \r\nArchitecture, Arts and \r\nHumanities \r\nBusiness and Public Affairs \r\nEngineering and Science \r\nHealth, Education and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and Orange \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitecture \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocial Sciences \r\nLibrary \r\nAcademic Support \r\nCollegiate faculty follow their banner in order of academic rank wearing \r\nacademic costumes of medieval origin. Those who have received their degrees from \r\ninstitutions outside the United States wear costumes specified by the awarding \r\ninstitutions. \r\nThe academic costumes of faculty whose degrees are from United States' \r\ninstitutions are specified by a uniform code maintained by the American Council \r\non Education. Caps are black and are usually mortar boards with tassels. Doctors of \r\nPhilosophy wear gold tassels usually of metallic thread; other degrees wear black or \r\ndiscipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' \r\ngowns, also black, are longer than bachelors. Older gowns have sleeves that \r\nterminate at the elbow while those since 1960 have sleeves extended to the wrist. \r\nDoctors' gowns are full, with bell-like sleeves. The front is marked by velvet panels \r\nand the sleeves are marked by three velvet bars. While most gowns are black with \r\nblack velvet, one variation is to replace black velvet with velvet in the discipline \r\ncolor. A second variation is a colored gown usually of the university's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the \r\nawarding institution. First, degree level is signified by the size of the hood with \r\nbachelors' smallest, masters' larger, and doctors' quite large and of a different \r\nshape. Clemson does not award hoods to bachelors. The width of the velvet trim also \r\nconveys the degree. Secondly, the degree is indicated by the color of the trim edging \r\nthe hood to form the throat over the gown. The most frequently seen is dark blue, \r\nwhich designates the doctor of philosophy (Ph.D.) degree. Finally, the color of the \r\nhood's lining specifies the awarding institution. The colors are displayed in \r\ncombinations that are drawn from heraldry. Notice that the Clemson University \r\nhood is lined with purple through which is an orange chevron (a ''V\"). Although \r\nmany combinations are duplicated by dozens of institutions, Clemson is presently \r\nthe only institution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastical, or \r\nmilitary regalia as set forth by their professions. They are preceded by the \r\nUniversity Marshal. Clad in a gown of office in gold and purple, the marshal \r\nwears no hood and bears the University mace. At the ceremony's close, the faculty \r\ndo not exit as a part of the recessional but are dismissed, along with students and \r\nguests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "9",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of \r\nClemson University and must be present at any convocation where the \r\nUniversity, through its delegated members, is acting officially. At any \r\nofficial convocation such as commencement, the University Marshal, \r\ncarrying the mace, precedes the President into the assembly. The mace \r\nrests before the President's chair or speaker's stand throughout the \r\nceremony, and its removal from the assembly at the close of a \r\nconvocation is symbolic of the official withdrawal of the University and, \r\nthus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the \r\nceremonial maces carried by heads of state and church in the Middle \r\nAges. Its basic clublike shape, however, is much more ancient, probably \r\ngoing back to man's prehistory. It is made of walnut wood and silver, \r\nwith the seal of the University in gold and the University colors \r\nrepresented by insets of carnelian (orange) and amethyst (purple). \r\nAmethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in \r\nthe office of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for \r\nthe whole body of the institution. Clemson's chain and seal are made of \r\nsilver and gold, and cornelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \r\n\"staffs of office\" which were carried by the senior members of \r\ndepartments of state or church. They display the seal of the University \r\nand the symbolic color of the discipline to which the college belongs. \r\nClemson's batons are made of walnut wood and silver with the various \r\ndisciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert \r\nEbendorf. Mr. Ebendorf is twice winner of the Tiffany Award and one of \r\nthe most acclaimed goldsmiths of our era. The enamel plaques for the \r\nbatons were executed by the late Professor Marshall C. Bell, and the \r\nlapidary work was executed by the late Mr. C. C. Wilson of Clemson \r\nUniversity. "
    },
    {
        "page_number": "10",
        "text": "Coat of Arms \r\nDesigned by Clemson University graphic artist, Connie Floyd, the \r\ncoat of arms represents the historic three-fold mission of this \r\ninstitution: teaching, research and service. \r\nPictured on the cover, the coat of arms is divided into three parts. The \r\nbottom contains a series of open books representing the concept of \r\nteaching as the basis of the land-grant university. The white of the books \r\nand the purple of the background designate the teaching mission of the \r\nUniversity as it is achieved through undergraduate and graduate \r\ninstruction. \r\nThe upper portion of the shield contains two sets of calipers and \r\nwheat sheaves illustrating the measurement system for research, as \r\nwell as Clemson's tradition in agriculture and Extension. The three \r\nsymbols - the books, calipers and wheat sheaves - also represent the \r\nhumanities, technology and science. \r\nThe entire shield is joined by a small orange center shield bearing a \r\nwhite tiger mask symbolizing the abiding spirit of Clemson. \r\nThe crest is a gold palmetto tree, which emphasizes Thomas Green \r\nClemson's desire that Clemson become \"the people's university\" for \r\nSouth Carolinians. It rises from a band of purple, orange, white and \r\ngold. The outer pair of colors, purple and gold, are the official colors of \r\nthe University; the inner pair, orange and white, are Clemson's student \r\ncolors. "
    },
    {
        "page_number": "11",
        "text": "CANDIDATES FOR DOCTORS' DEGREES \r\nA. WAYNE BENNETT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nApplied Economics \r\nCora Susan Moore Florence, SC \r\nB.S., Francis Marion University; M.A., Clemson University \r\nDissertation: Nonlinearity and Business Cycle Fluctuations \r\nAdvisor: Dr. G. P. Dwyer \r\nGary Reed Stratton Harrodsburg, KY \r\nB.S., University of Kentucky; M.S., Murray State University \r\nDissertation: Quasi-Public Good Externalities Associated with White-Tailed Deer: A Modified IPM Economic \r\nModel \r\nAdvisor: Dr. W. Smathers \r\nDarrin Michael Webb Richland, MS \r\nB.S., M.S., Mississippi State University \r\nDissertation: Adjustment Costs, Space, and Rural Development: An Empirical Test and Implications \r\nAdvisor: Dr. J. C. Hite \r\nSu Yang ____________________________________ Beijing, China \r\nB.S., Beijing University; M.S., University of Maryland at Baltimore \r\nDissertation: A Comparison of Variable Annuity and Mutual Fund Performances \r\nAdvisor: Dr. M. T. Maloney \r\nEntomology \r\nJames Emory Mann II Gainesville, GA \r\nB.S., Shorter College; M.S., Clemson University \r\nDissertation: Effect of Early Season Flower Bud Loss on Maturity, Yield and Quality of Cotton, Gossypium \r\nhirsutum (L.) in South Carolina \r\nAdvisor: Dr. S. G. Turnipseed \r\nEnvironmental Toxicology \r\nJonathan McGhee Akins Anderson, SC \r\nB.S., M.S., University of Arizona \r\nDissertation: Porphyrin Profiles in the Nestling European Starling (Sturnus vulgaris): A Biomarker of Field \r\nContaminant Exposure \r\nAdvisor: Dr. M. J. Hooper \r\nNicholas William Gard Kirkland, WA \r\nB.S., University of Guelph; M.S., McGill University \r\nDissertation: Induction of Immunotoxicity and Mixed Function Oxygenase Activity as Biomarkers of \r\nExposure to Environmental Contaminants in the Deer Mouse (Peromyscus maniculatus) \r\nAdvisor: Dr. M. J. Hooper \r\nAnthony William Hawkes Ely, NV \r\nB.S., University of Montana; M.S., Clemson University \r\nDissertation: Northern Bobwhite (Colinus virginianus) Response to Treatment of a South Carolina Pine \r\nPlanation with Arsenal Applicators Concentrate \r\nAdvisor: Dr. R. J. Kendall \r\nJames Edward Warren West Plains, MO \r\nB.S., M.S., University of Missouri \r\nDissertation: Effect of Heavy Metals on Insects Immunity and the Host/Pathogen Relationship \r\nAdvisor: Dr. S. J. Klaine \r\nForest Resources \r\nAudimar Pastores Bangi Clemson, SC \r\nB.S., M.S., University of Philippines \r\nDissertation: Fundamental Properties of Acetylated Structural Flakeboard from Juvenile Wood \r\nAdvisor: Dr. D. N. Hon \r\nRichard Kent Myers Anderson, SC \r\nB.S., M.For., Clemson University \r\nDissertation: Coastal Plain Forest Plant Community Response to Hurricane-Fire Interactions \r\nAdvisor: Dr. D. H. VanLear "
    },
    {
        "page_number": "12",
        "text": "Genetics \r\nXingping Zhang Clemson, SC \r\nB.S., Gansu Agricultural University; M.S., Northwestern Agricultural University \r\nDissertation: Male-Sterile ms Mutant: Characterization and Utilization in Watermelon Breeding \r\nAdvisor: Dr. B. B. Rhodes \r\nMicrobiology \r\nGeeta Vedantam Kumar Calcutta, India \r\nB.S., M.S., Clemson University \r\nDissertation: Responses of Human Peripheral Blood Mononuclear Cells to UV Irradiation: Role of Medium \r\nComponents \r\nAdvisor: Dr. L. L. Larcom \r\nPlant Pathology \r\nBeryl Bernstein Tucson, AZ \r\nB.S., University of Arizona; M.S., Clemson University \r\nDissertation: Fungicide Sensitivity, RELP Analysis and Morphology of the Fungi Causing Peach \r\nAnthracnose and Latent Infection in Peach Fruit \r\nAdvisor: Dr. E. I. Zehr \r\nPlant Physiology \r\nNeeraj Srichand Ahuja Madras, India \r\nB.E., M.S., Bir la Institute of Technology and Science \r\nDissertation: Carbohydrate Metabolism or Organogenic Cultures of Nicotiana tabacum L. vav.Burley 21 \r\nAdvisor: Dr. N. D. Camper \r\nTonya Cherie McKinley Avis, PA \r\nB.S., Lock Haven University of Pennsylvania; M.S., Pennsylvania State University \r\nDissertation: Factors Affecting Seed Germination of the Terrestrial Orchid Goodyera repens (Fernald) and \r\nthe In Vitro Culture of Orchidaceous Mycorrchimae \r\nAdvisor: Dr. N. D. Camper \r\nZoology \r\nJennifer Elaine Frick Balsam Grove, NC \r\nB.S., Clemson University \r\nDissertation: Reproductive Biology, Gonadal Microanatomy, and Parental-Embryonic Interactions in the \r\nViviparous Holothurian Echinoderm Synaptula Hydriformis \r\nAdvisor: Dr. J. P. Wourms \r\nJody Matthew Myers Eunice, LA \r\nB.S., M.S., Louisiana State University and Agricultural and Mechanical College \r\nDissertation: Immunohistochemical Studies on the distribution and Ultrastructure: Ultrastructural \r\nCharacteristics of Phosphoprotein Secretory Cells in the mantle Epithelium of the American Oyster, \r\nCrassostrea virginica \r\nAdvisor: Dr. A. P. Wheeler \r\nJames Thomas Wetzel Clinton, SC \r\nB.S., Point Park College; M.A., Sonoma State University \r\nDissertation: On the Functional Morphology Epidermal Modifications in the Skin-Brooding Fishes: \r\nPlatystacus Solenostomus and Hippocampus \r\nAdvisor: Dr. J . P. Wourms \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nDOCTOR OF PHILOSOPHY \r\nIndustrial Management \r\nSubodh Pandurang Kulkarni~~~~~~~~~~~~~~~~~~~~~~~~~~~~Clemson, SC \r\nB.P.H., M.P.H., University of Bombay; M.S., Clemson University \r\nDissertation: Evaluation of Restructuring Alternatives: A Transaction Cost Approach \r\nAdvisor: Dr. J. 0. Fiet "
    },
    {
        "page_number": "13",
        "text": "COLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nBioengineering \r\nMeng Deng Chengdu, China \r\nB.E., Wuhan University; M.E., Institute of Aero Materials \r\nDissertation: Effects of Reinforcement and Irradiation on Thermal and Mechanical Properties of Ultrahigh \r\nMolecular Weight Polyethylene \r\nAdvisor: Dr. S. W. Shalaby \r\nCeramic Engineering \r\nJohn Prentiss Sanders Summerville, SC \r\nB.S. , M.S., Clemson University \r\nDissertation: Transport of Internally Generated S02 Emissions Through Porus Clay Ceramics \r\nAdvisor: Dr. D. Brosnan \r\nChemical Engineering \r\nMark Logan Crowder Terre Haute, IN \r\nB.S., Rose-Hulman Institute of Technology; M.S., Clemson University \r\nDissertation: Development of a Spiral Wound Membrane Module Made with Woven Hollow Fiber Fabric \r\nAdvisor: Dr. C. H. Gooding \r\nAshay Arvind Dani Bombay, India \r\nB.Ch., University of Bombay; M.S., Clemson University \r\nDissertation: Experimental Characterization and Modeling of Electrical Percolation Phenomenon in Short \r\nFiber Composites \r\nAdvisor: Dr. A. A. Ogale \r\nChemistry William Kenneth Banner _____________________________ Pasadena, MD \r\nB.S., Gettysburg College \r\nDissertation: Analogues to 7 and 8 - Tetranhyde - cannabinols \r\nAdvisor: Dr. J. Huffman \r\nGreg Wayne Drake _____________________________ Hendersonville, NC \r\nB.S., University of North Carolina-Asheville \r\nDissertation: Reactions of Main Group Cationic Clusters \r\nAdvisor: Dr. J. W. Kolis \r\nLi Li Hegang, China \r\nB.S., M.S., Beijing Medical University \r\nDissertation: Application of Partial Least - Squares in Multicomponent Colorimetric Analysis \r\nAdvisor: Dr. R. R. Williams \r\nCivil Engineering \r\nYan Yan Beijing, China \r\nB.S., Wuhan University; M.S., Institute of Water Conservancy and Hydroelectric Power Research \r\nDissertation: Laterally-Averaged Numerical Modeling of Fluid Mud Formation and Movement in Estuaries \r\nAdvisor: Dr. E. J. Hayter \r\nComputer Science \r\nRoland H. Untch Chicago, IL \r\nB.A., Mundelein College; M.S., De Paul University \r\nDissertation: Schema-based Mutation Analysis: A New Test Data Adequacy Assessment Method \r\nAdvisor: Dr. M. Harrold \r\nElectrical Engineering \r\nAbdel-Ghani Awad Daraiseh Clemson, SC \r\nB.S., University of Jordan; M.S., Clemson University \r\nDissertation: Packet Combining and Adaptive Erasure Processing for Wireless Spread-Spectrum packet Data \r\nNetworks \r\nAdvisor: Dr. C. W. Baum \r\nCatherine Louise Freeman ____________________________ Sierra Vista, AZ \r\nB.S., M.S., University of Arizona \r\nDissertation : Analysis of Stri pline Fed Slot Arrays \r\nAdvisor: Dr. C. M. Butler \r\nMohamed Suleman Moosa.--::-7::-c--:-----------------------Durban, South Africa \r\nB.S., M.S., University of Natal \r\nDissertation: Integrated Circuit Early Failure Simulation \r\nAdvisor: Dr. K. F. Poole "
    },
    {
        "page_number": "14",
        "text": "Electrical Engineering (continued) \r\nKhaled Mamdouh Shaaban Central, SC \r\nB.S., M.Sc., Assiut University \r\nDissertation: Design and Analysis of a Class of Recurrent Networks Using Feedforward Mapping Properties \r\nAdvisor: Dr. R. J. Schalkoff \r\nLiancheng Wang _ _,_-..,,.--,---.,--,---,,,,------------------------ Clemson, SC \r\nB.S., M.S., Shandong Polytechnic University \r\nDissertation: On-line Detection of Power System Instability \r\nAdvisor: Dr. A. A. Girgis \r\nXiaomei Yang Guangdong, China \r\nB.C.D., M.E.S.D., National University of Defense Technology \r\nDissertation: Computations of Magnetic Field Produced by an Underground Pipe-type Cable \r\nAdvisor: Dr. X. B. Xu \r\nEngineering Mechanics \r\nJie Jenny Yuan Clemson, SC \r\nB.S.E., Beijing University \r\nDissertation: Analytical and Experimental Evaluation of the Interphase and Interface in Carbon Fiber \r\nComposites \r\nAdvisor: Dr. J. M. Kennedy \r\nEnvironmental Systems Engineering \r\nRaed Mohammad El-Farhan Amman, Jordan \r\nB.S., University of Missouri-Rolla; M.S., Clemson University \r\nDissertation: Contaminant Plume Effects on the Soil Sorption and Release Characteristics of Heavy Metals \r\nAdvisor: Dr. A. W. Elzerman \r\nTimothy Gage Ellis Baltimore, MD \r\nB.S., Drexel University; M.S., Georgia Institute of Technology \r\nDissertation: The Use of Batch and Fed-batch Respirometric Techniques for Determining Extant Kinetic \r\nParameters Describing Single and Multiple Substrate Biodegradation \r\nAdvisor: Dr. C. P. L. Grady, Jr. \r\nSusan Marie Morgan _______________________________ Highland, IL \r\nB.S., Southern Illinois University at Carbondale \r\nDissertation: Metal and Acid Recovery Options for the South Carolina Plating Industry \r\nAdvisor: Dr. C. M. Lee \r\nMaterials Science and Engineering \r\nKyle Dean Frischknecht Livermore, CA \r\nB.S., California Polytechnic State University-San Luis Obispo; M.S., Rensselaer Polytechnic Institute \r\nDissertation: Laser Assisted Chemical Vapor Deposition of Fibers \r\nAdvisor: Dr. R. J. Diefendorf \r\nRussell Albert Johnson ________________________________ Clinton, IA \r\nB.S., University of Iowa; M.S., Clemson University \r\nDissertation: Absorption of Oxalate Polymers \r\nAdvisor: Dr. M. J. Drews \r\nKerry Elizabeth Robinson ----------------------------- Fife, Scotland \r\nB.S., M.S., Clemson University \r\nDissertation: A Structural Analysis of Carbon Fibers for Thermal Management \r\nAdvisor: Dr. D. D. Edie \r\nMathematical Sciences \r\nLaurel Louise Carpenter ______________________________ Ridgecrest, CA \r\nB.S., Bob Jones University; M.S., Clemson University \r\nDissertation: Designs and Cades from Hyperovals \r\nAdvisor: Dr. J. D. Key \r\nJacek A. Korycki _______________________________ Warsaw, Poland \r\nB.S., Warsaw Technical University \r\nDissertation: Norm-relaxed Method of Feasible Directions \r\nAdvisor: Dr. M. M. Kostreva \r\nKarin Elisabeth Vorwerk ___________________________ Clausthal, Germany \r\nDip., Technical University of Berlin \r\nDissertation: Frequency Domain Methods in Distributed Parameter Systems \r\nAdvisor: Dr. J. Brannan "
    },
    {
        "page_number": "15",
        "text": "Mechanical Engineering \r\nKan Cui Beijing, China \r\nB.M.E. , Shanghai University of Technology; M.S., Clemson University \r\nDissertation: On Configurations of Equations of Motion for Multi-body Systems \r\nAdvisor: Dr. I. Haque \r\nJia Mi Shanghai, China \r\nB.S., M.S., Fudan University \r\nDissertation: Numerical Simulation of Gas Dynamics in High Pressure Gas Atomization \r\nAdvisor: Dr. R. S. Figliola \r\nEmilia Cerna Mladin ____________________________ Bucharest, Romania \r\nB.S., Polytechnic Institute of Bucharest \r\nDissertation: Instantaneous Convective Heat Transfer to Submerged Pulsating Jets \r\nAdvisor: Dr. D. A. Zumbrunnen \r\nDeborah Va lerie Pence Helena, MT \r\nB.S., M.S., Clemson University \r\nDissertation: Studies of Heat Transfer and Chaos in a Gas-Fluidized Bed With An Opposing Oscillatory Flow \r\nAdvisor: Dr. D. E. Beasley \r\nJames William Post II Greenville, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Modeling, Simulation and Testing of Automobile Power Steering Systems for the Evaluation of \r\nOn-Center Handling \r\nAdvisor: Dr. E. H. Law \r\nPhysics \r\nYu-Li Chang Hsin-Chu, Taiwan \r\nB.S., National Cheng Kung University . \r\nDissertation: Application of MST Radar Wind Estimation Techniques to the Study of Gravity Waves in the \r\nTroposphere and Lower Stratosphere \r\nAdvisor: Dr. M. F. Larsen \r\nLei Chen Shanghai, China \r\nB.S., Fudan University \r\nDissertation: Monte-Carlo Treatment of Predicting the Proton-Induced Dark Current on Charged-Coupled \r\nDevices \r\nAdvisor: Dr. P. J. McNulty \r\nKanta Das Calcutta, India \r\nB.Sc., University of Calcut; M.Sc., Indian Institute of Technology-Bombay; M.S., Clemson University \r\nDissertation: Third Order Isothermal Elastic Constraints of NbSe3 and TaS3 and Low Temperature Anomaly \r\nin TaS3 \r\nAdvisor: Dr. G. Tessema \r\nTextile and Polymer Science \r\nClaudia Kimberly Joy Nowak Cameron Park, CA \r\nB.S., California State University; M.S., University of California-Davis \r\nDissertation: Specific Interactions Between Electrically Conducive Polypyrrole and Nylon 6, 6 \r\nAdvisor: Dr. R. Gregory "
    },
    {
        "page_number": "16",
        "text": "COLLEGE OF HEALTH, EDUCATION AND HUMAN DEVELOPMENT \r\nDOCTOR OF EDUCATION \r\nVocational and Technical Education \r\nVernon Lory Prosser Spartanburg, SC \r\nB.S., Clemson University; M.Ed., University of South Carolina \r\nDissertation: School-to-Work System Development as Perceived by Vocational Directors in States Receiving \r\nFederal Implementation Grants \r\nAdvisor: Dr. C. Isbell \r\nDonald Toy Williams York, SC \r\nB.S., Clemson University; M.Ag.Ed., Clemson University \r\nDissertation: The Effects of Freshman Focus, a High School Introductory Course Upon Freshman at York \r\nComprehensive High School \r\nAdvisor: Dr. J. G. Harper \r\nDOCTOR OF PHILOSOPHY \r\nEducational Leadership \r\nPatricia Cale Calkins Rock Hill, SC \r\nB.S., Florida State University; M.A., Winthrop College \r\nDissertation: Evaluating the Transfer Function Between the Technical Colleges and the Senior Public \r\nColleges System of South Carolina \r\nAdvisor: Dr. R. Marion \r\nDoris Daniel Cole. _______________ ________________ Williamston, SC \r\nB.A., Columbia College; M.Ed., Ed.S., Clemson University \r\nDissertation: Inducting New Principals: South Carolina Superintendents' Views \r\nAdvisor: Dr. R. Marion \r\nParks, Recreation and Tourism Management \r\nIngrid Eleanore Schneider Sioux Falls, SD \r\nB.S., M.S., University of Minnesota \r\nDissertation: Describing Differentiating and Predicting Visitor Response to On-site Recreation Conflict \r\nAdvisor: Dr. W. E. Hammitt \r\nErcan Sirakayac __________________________________ Izmir, Turkey \r\nB.S., Dokuz Eylul University; M.S., Clemson University \r\nDissertation: Voluntary Compliance of Eantour Operator with the Ecotourism Guidelines \r\nAdvisor: Dr. R. W. McLellan "
    },
    {
        "page_number": "17",
        "text": "CANDIDATES FOR MASTERS' DEGREES \r\nA. WAYNE BENNET!', Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nRoger Brian Ashley Belton, SC Mickey Paul Cummings. _____ Blairsville, GA \r\nRobert Nelson Brewer, Jr. ____ Hiawassee, GA \r\nMASTER OF FOREST RESOURCES \r\nStephen Lee Potts _______ Clinton, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nKameran Lindsay Bailey _____ Seattle, WA Eric Stephens Bradford _____ Lexington, KY \r\nAgronomy \r\nJeffrey Robert Watts Sugar Land, TX \r\nAnimal and Food Industries \r\nChristina Noelle Hunt ______ Florence, SC Debra Dowd Robbins _____ Simpsonville, SC \r\nAnimal Physiology \r\nErik Michael Poole ____ Coconut Creek, FL \r\nAquaculture, Fisheries, \r\nDaniel Lee Allen Stinnett, TX \r\nWalter Raymond Boltin III ___ Orangeburg, SC \r\nDavid Alan Eargle Chapin, SC \r\nand Wildlife Biology \r\nAlexandra Kraham ,,...-------- Chatham, NY \r\nNicole Tasman McKay Clemson, SC \r\nJames David Westerhold Worden, IL \r\nBiochemistry Ribo Guo ___________ Pendleton, SC Sook V. Jeong _________ Pusan, Korea \r\nEnvironmental Toxicology \r\nJeannine Lynn Capizzi ______ Bellport, NY Cynthia Baird Fornstrom Cheyenne, WY \r\nLaura Anne Esman Portage, MI Whitney Erin Mashburn __ Fort McClellan, AL \r\nForest Resources \r\nWilliam Henry Brantley, Jr. ___ Greenville, SC Mark Brandon Tinsley Anderson, SC \r\nBruce Gregory Cole Columbia, SC Philip Randal Weatherford ___ Clarksburg, TN \r\nJ eannine Denise Maldonado ____ Clemson, SC Xianjin Zhang Tianjin, China \r\nBrett Dawn Wright Miley DeLand, FL \r\nHorticulture \r\nRajgopal M. Bhandary __ Bangalore, India \r\nMicrobiology \r\nKara Alane Brown ______ North Scituate, RI Joung-II Choi ______ Chonbuk, South Korea \r\nZoology \r\nWilliam David Young ___ Blythewood, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS AND HUMANITIES \r\nMASTER OF ARCHITECTURE \r\nStephen Michael Aldrich _____ Calhoun, GA Douglas Arthur Leckband -----.,,,_Atlanta, GA \r\nJill Ann Horton Atlanta, GA Wenying Zhang Beijing, China \r\nErnest Love Joyner IV Tupelo, MS \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nDennis C. Bausman Ackley, IA Richard Anthony Squillace ___ Amsterdam, NY \r\nCharles Benjamin Kahn Columbia, SC Thomas Edward Stokes III Columbia, SC \r\nMASTER OF FINE ARTS \r\nLoe Bao Cao Riverdale, GA \r\nMASTER OF ARTS \r\nEnglish \r\nRichard Barnwell Grimball, Jr. __ Charleston, SC Rosalie Denise Savage ______ Seneca, SC \r\nTara Leigh Harmon Lexington, SC J ack Terrence Vardy Clemson, SC "
    },
    {
        "page_number": "18",
        "text": "History \r\nRobert Telfer Barrett Clemson, SC Melanie Roseanne Pavich-Lindsay _ Decatur, GA \r\nChristopher Henson Chapman ___ Walhalla, SC Lewie Reece Fairbanks, AK \r\nMary Jane Farmer Wichita, KS Kelly Elaine Rusinack Uniontown, PA \r\nBlair Tracy Hinson Las Cruces, NM Benjamin Horton Severance Oakton, VA \r\nRaina Lynn Howell Henagar, AL Fengxia Tao Chongqing, China \r\nHaralambos Dimitrios Mihas Detroit, MI \r\nProfessional Communication \r\nTeresa Anne Ederer Fishman St Charles, MO \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nMASTER OF BUSINESS ADMINISTRATION \r\nGirdhar Arora Kanpur, India Raymond Glenn Kroll Menomonie, WI \r\nLarry Scott Barker Laurens, SC Terry Gene Lawrence Greenville, SC \r\nHelena Brandner Maribor, Slovenia Johnny Howard Macomson ___ Spartanburg, SC \r\nJane G. Broderick Easley, SC Jeevan Melroy Menezes Clemson, SC \r\nJ effrey Pierce Buzhardt Taylors, SC Jill Marie Parsons Greenville, SC \r\nGlenn Lawrence Cash Greenville, SC Debra Lynn Pittman Greenville, SC \r\nEdwin Stacey Cooley Williamston, SC David Lee Robb Greenville, SC \r\nCharles Anthony Dickerson ___ Williamston, SC Steven Joseph Robertson Greer, SC \r\nEnglish Kuhne Drews Charleston, SC Michael Mayo Sarvis Columbia, SC \r\nSanjeev Dubey Hyderabad, India June Stasney Sloan Travelers Rest, SC \r\nMichael Duane Dyar Greer, SC Jaroslav Slunecko Ljubljana, Slovenia \r\nLisa Johnson Foster Central, SC Deborah Roberts Stuckey Greenville, SC \r\nJuliane Acuff Giles Mauldin, SC John Boyd Thompson Greenwood, SC \r\nStephanie Grous Nantes, France Jonathan Alvin Walton Greenville, SC \r\nPriscilla Ramey Harrison Easley, SC Jeffrey Todd Weber Simpsonville, SC \r\nPeter J. Horgan Simpsonville, SC John Burnett Weber Greenville, SC \r\nMichelle Bannister Kennedy ___ Greenwood, SC J ayhue Franklin Weisner, Jr. ___ Laurens, SC \r\nAlojz Krapez Ljubljana, Slovenia \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nJan McLane Gilchrist ____ ..,,..._Greenville, SC Richard Gabriel Stoeppler ____ Spartanburg, SC \r\nJill Christine Rossi Davidsonville, MD Carter Grosvenor Thompson ____ Columbia, SC \r\nSusan Martha Stamey Clemson, SC Gloria Annette Thompson ____ Greenville, SC \r\nLynn Carter Stanfield Honea Path, SC Shannon Lee Weber Marietta, GA \r\nMASTER OF PUBLIC ADMINISTRATION \r\n(Master of Public Administration is jointly administered by \r\nClemson University and the University of South Carolina.) \r\nWilliam David Gray Easley, SC Gregory Paul Watson ______ Greenville, SC \r\nMASTER OF ARTS \r\nEconomics \r\nBrian M. Kropp ---------Fairfax, VA Timothy David Terrell ______ Florence, SC \r\nOktay Oksuzler Clemson, SC \r\nMASTER OF SCIBNCE \r\nApplied Sociology \r\nKory James Coonen _______ Kaukauna, WI Mary Ruth Myers _______ Greenville, SC \r\nIndustrial Management \r\nAndrew Patterson Cochran Atlanta, GA Ajit Kumar Mandal _______ Bensalem, PA \r\nJennifer Elisabeth Elliott Clinton, SC Dora Darlene Samuel Dillon, SC \r\nVishwaraj Gaitonde Clemson, SC Jay Thomas Sanders Chattanooga, TN \r\nGautam Nandkishore Jajodia ___ Bombay, India Ozan Taner Wiesbaden, Germany \r\nJack Edward Littlejohn III Gaffney, SC David G. Trembley Chicopee, MA "
    },
    {
        "page_number": "19",
        "text": "COLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCivil Engineering \r\nRobert Beryl Blackmon Six Mile, SC \r\nElectrical Engineering \r\nJohn Victor Battaglini _____ Philadelphia, PA Gregory M. Lawrence _______ Augusta, GA \r\nEnvironmental Systems Engineering \r\nJohn Thomas Igoe ________ Shoreham, NY Judith Malahaima Pelger _____ Pembroke, GA \r\nSteven Donald Nestor Greenville, SC \r\nMASTER OF SCIENCE \r\nAgricultural Engineering \r\n(Agricultural Engineering is jointly administered by the College of \r\nAgriculture, Forestry and Life Sciences and the College of Engineering and Science.) \r\nLigia Aura Jinescu ___ Bucharest, Romania \r\nBioengineering \r\nStephen Daniel Ainsworth _____ Delmar, NY Clare Eileen Shannon _____ .Falls Church, VA \r\nKevin William Hayes Clawson, MI Steven Todd Smith Cumberland, MD \r\nCeramic Engineering \r\nJohn Andrew Hoetzel _______ Asheville, NC John Patrick Lloyd _________ Central, SC \r\nByron Scott-Warren Holcombe Seneca, SC Todd Richard Miller Ann Arbor, MI \r\nChemical Engineering \r\nAnders Price Becklund ____ Jacksonville, NC John Martin Paulk _______ Manchester, TN \r\nRichard Michael Dayrit Goose Creek, SC David Lewis Rawson Bedford, OH \r\nOlt Emil Geiculescu Bucharest, Romania Clark Daniel Rodeffer Dallas City, IL \r\nAaron Paul Maybach Herndon, VA \r\nChemistry \r\nMichael Anthony DeTure ___ Winter Park, FL Brenton Y. M. Jong ________ Honolulu, HI \r\nCivil Engineering \r\nTravis Gregory Crane Brunswick, OH Andrew Douglas Stohs _______ Columbia, SC \r\nDenise Simmons Grant Charleston, SC Paul James Thompson Lahaina, HI \r\nYogesh Vrundavandas Sanghvi __ Bombay, India Michael Swanson Ulmer Greenville, SC \r\nComputer Engineering \r\nYang Cao ___ =--.,-------Clemson, SC Yehua Lu Owens -,------__,~Jiangsu, China \r\nJennifer Lanette Crowley Rome, GA Rammohan Sampath Udumalpet, India \r\nSimonjit Dutta Clemson, SC Sravan Kumar Vellanki Atlanta, GA \r\nAngela Simpson Garrison Roanoke, AL \r\nComputer Science \r\nMaximilian John Domeika ____ Tacoma, WA Mazin Omar Ramadan _______ Newark, DE \r\nSunil Madan Hingorani Bombay, India Vijay Ranjan Ghaziabad, India \r\nGan apathy Girish Konganda ____ Clemson, SC Laurie A. Smith Seneca, SC \r\nBenjamin Charles Messick ___ Fort Wayne, IN \r\nElectrical Engineering \r\nPaul Joseph Chiuchiolo, Jr. ____ Woburn, MA William Martin Riddle _____ Greenville, SC \r\nAlan Kent Daniel North Augusta, SC Robert Randol Roeder Camden, SC \r\nChenguang Gong Clemson, SC Poonam Singh rlington, VA \r\nChristos Karasiotos Athens, Greece Jonathan Hanes Williams Tampa, FL \r\nAlp Kustepeli Clemson, SC Zhihao Xing Clemson, SC \r\nYing Liu Alexandria, VA Korkut Yegin Tekirdag, Turkey \r\nRupal H. Parikh Surah, India \r\nEngineering Mechanics \r\nCharles Keith Downs _____ North Augusta, SC Jonathan Michael Pope ____ Valley Forge, PA "
    },
    {
        "page_number": "20",
        "text": "Environmental Systems Engineering \r\nMichael Edward Aire Spring Hill, FL Paul Joseph Meier Watertown, WI \r\nIGaus Peter Albertin Scottsdale, AZ Richard William Sanders II ____ St Louis, MO \r\nDavid Michael Bennert Marion, AL Pamela Beth Schultz Cumberland, RI \r\nHeather Dobbs Brent Taylors, SC Veronica Roseborough Taylor ___ Winnsboro, SC \r\nTimothy Edward Connor ___ Albuquerque, NM Christian Mark Thelander _Sterling Heights, MI \r\nSteven Michael Fehniger Rochester, NY James B. Thompkins Conway, SC \r\nRuth Ellen Hammervold Sunnyvale, CA Howard Thomas Uhal Mentor, OH \r\nJudith Katherine Hill Greer, SC Hollie Sherman Vollmar Greenville, SC \r\nRichard Bruce Lawson Spartanburg, SC Robert Allen Wilson Winter Haven, FL \r\nMichael Alan Maravelias Danvers, MA \r\nHydrogeology \r\nErik Robert Caldwell _______ Raleigh, NC Nicholas Brandon Kidd _____ .Hartwell, GA \r\nIndustrial Engineering \r\nShelia Kay Barnett Jackson, KY Tushar Sadanand Phondge Lilburn, GA \r\nSameer Bhagwat Bombay, India Vijay Kalyan Shanmuganandam \r\nSubbarao Pantulu Ivaturi_ Visakhapatnam, India Tamilnadu, India \r\nElmer Carlton IGebe Easley, SC \r\nMaterials Science and Engineering \r\nSebastien Azimzadeh _____ Valbonne, France Isabelle Michele Philippart _ Montpellier, France \r\nVincent Francois Isoard Nice, France \r\nMathematical Sciences \r\nAlok Aurovillian _________ Clemson, SC David Andrew England ____ Summerville, SC \r\nPaul Bradley Blair Berea, KY Juan Gerardo Gonzalez __ Ojuelus Jalisco, Mexico \r\nMechanical Engineering \r\nHenry Grady Ballard, Jr. ______ Easley, SC Kamesh Maruthi Tata __ Andhra Pradesh, India \r\nVenugopal Challa Hyderabad, India Mukundh Thirumalai Madras, India \r\nKevin Jerome Hall Charlotte, NC Shankar Venkataramani Detroit, MI \r\nKevin Kenealy Hart Sarasota, FL Kenneth Christopher Voronin __ Spartanburg, SC \r\nDavid McKinley Miller Glen Rock, PA Dibbon Keith Walters Aiken, SC \r\nJerry Mark Moore Grqves, TX Gregory Newton Wattis Voorhees, NJ \r\nPhysics \r\nJohn Thomas Corbitt _______ Greenville, SC Kevin Gaylynn Kindall _____ Greenville, SC \r\nClaude Frelechoz Clemson, SC Mark William Savage Muscatine, IA \r\nTextile Chemistry \r\nPamela Joy Wolfe ___ Winnepeg, Manitoba \r\nTextile \r\nJaichand Balasubramaniam ___ Tirupur, India \r\nAshish Shreekant Bokil Indore, India \r\nRajiv Jain Seneca, SC \r\nScience \r\nPensri Thongnopkhun ____ Bangkok, Thailand \r\nYogeshwar Karunakaran Velu _ Bangalore, India \r\nWen-Bin Yu Taipei, Taiwan \r\nCOLLEGE OF HEALTH, EDUCATION AND HUMAN DEVELOPMENT \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nWilliam Edward Bonsky Rochester, MI Evangeline Dongell Ledbetter Seneca, SC \r\nDennis Lee Caldwell Battle Creek, MI Debra Greene Lovelace Simpsonville, SC \r\nDonald Lee Campbell Anderson, SC Cheryl Ann Mallon Summerville, SC \r\nMary Alyce Neader Campbell ___ Greenville, SC Patricia A. Martin Charleston, SC \r\nMichael James Carlson ____ Simpsonville, SC Rachael Satterfield Matthews __ Simpsonville, SC \r\nJean Godwin Chandler Mt Pleasant, SC Patrick Bugbee McGehee Greenwood, SC \r\nGregory W. Clark St Stephen, SC Rosetta Givens Mitchell Goose Creek, SC \r\nJondia Delvonne Durham Greenville, SC Genell Johnson Owens __ North Myrtle Beach, SC \r\nMekel Lee Durham Anderson, SC Eric Charles Schwartz Alexandria, VA \r\nRebecca Woolston Shipps Eidson ___ Clemson, SC Sabrina Lynn Simpson Anderson, SC \r\nRonald Drew Ellis Clemson, SC David Linton Stephenson Laurens, SC \r\nLisa Margueritte Gatlin Pickens, SC Janet Elizabeth Suiter Anderson, SC \r\nBrenda Anne Humphreys Anderson, SC Stephen Monroe Taylor Greenville, SC \r\nElizabeth Mercer Kane Anderson, SC Wendy Denise Winborn Rock Hill, SC \r\nKristal Ann Kemppainen __ Cape Canaveral, FL Billie Kay Wingfield Petersburg, VA \r\nMASTER OF INDUSTRIAL EDUCATION \r\nJulie Ann Bauer --------..,,...-- Silex, MO Robert Ralph Krueger ________ Altoona, PA \r\nDerek Alan Brown Spartanburg, SC Mark Travaglini Greenville, SC \r\nMeredith Myers Drane Clemson, SC "
    },
    {
        "page_number": "21",
        "text": "MASTER OF PARKS, RECREATION AND TOURISM MANAGEMENT \r\nRobert Shelton Brookover IV Clemson, SC Nicole Leigh Herman Bucyrus, OH \r\nMelissa Wheeler Garvan Charleston, SC Kathleen Marie Murphy Allegany, NY \r\nLeslie Suzanne Goodwin Columbia, SC Robert Henry Patterson, Jr. ____ Anderson, SC \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nCharles Alexander Costner ____ Anderson, SC Charlotte Cynthia McLeod ____ Darlington, SC \r\nStanley Eugene Darnell Rabun Gap, GA \r\nCounseling and Guidance Services \r\nColleen Agnes Beagen Greenwood, SC Danika Rochelle Jackson Anderson, SC \r\nSteve J . Cheatham Philadelphia, MS Elizabeth B. McKinney Spartanburg, SC \r\nThwanda Littles Davidson Seneca, SC Kimberly Ozella McManus ___ Ridge Spring, SC \r\nScott Bradley Dennis Clemson, SC Kimberly Nicole Owens Pelzer, SC \r\nKory Donovan Duncan Batesburg, SC Nancy Anne Parker Danvers, MA \r\nWilliam Mark Duvall Greenwood, SC Queenna Johnson Patterson ___ Greenville, SC \r\nCarrie Hudson Edmonds Central, SC Paige Jemison Philp Knoxville, TN \r\nSandra Price Evans Greenwood, SC Carleton Thornton Pridgen ____ Anderson, SC \r\nCorryn Jones Fassino Seneca, SC Gregg Henry Prigerson New York, NY \r\nPatricia Ann Ferguson Yemassee, SC Patricia Anderson Rogers Reidville, SC \r\nSherry Linn Goodreau Greenville, SC Daman Edwin Shuman Brooklet, GA \r\nMichael Shane Gravley Easley, SC Stephanie Jo Spruill Beaufort, SC \r\nAndrea Lynn Harrill Greenville, SC Shanie Ann Tate Greenville, SC \r\nDavid Lewis Howard Greenville, SC Katrina Dawn Upton Greenville, SC \r\nDonald Christopher Hughes ___ Ware Shoals, SC Mary Ann Wingard Greenwood, SC \r\nHarvey C. Hughes Seneca, SC Lori Marie Woerner Toccoa Falls, GA \r\nElementary Education \r\nCynthia Ann Coker Simpsonville, SC Carol R. McCullough--------Seneca, SC \r\nKathryn Methvien Danner ___ Simpsonville, SC Jackie S. Morgan Eastanollee, GA \r\nShana Tate Eiland Seneca, SC Mary Theresa Schultz Greenville, SC \r\nJane W. Franks Hollywood, GA Karen White Shirley Seneca, SC \r\nPaige Doolittle Graham Pomaria, SC Joanna Burns Stegall Summerville, SC \r\nKimberly Colvin Martin Central, SC \r\nReading \r\nPamela Denise Andrews ______ Johnston, SC Kimberly Clark Lorimer Johnston, SC \r\nBetsy Mundy Dutton Abbeville, SC Terri Lorraine Lynch Mill Spring, NC \r\nStacy Dixon Fowler Clemson, SC Cassandra Murphy Padgett Trenton, SC \r\nCarol Ann Huneycutt Seneca, SC Trena Renee Pearson Greer, SC \r\nCheryl Lee Hutchinson Cayce, SC Jennie Stiner Rodgers Edgefield, SC \r\nLeslie Ann Key Aiken, SC Janet Timmerman Rushton ____ Johnston, SC \r\nSecondary Education \r\nFrederick Johnson Burgett _____ Decatur, IL Pauline Cox Greer __________ Belton, SC \r\nJanice Louise Fritz Easley, SC \r\nSpecial Education \r\nJulia Hawkins Bishop _______ ---'Seneca, SC Emma J. Pagels ___ ~~----~Toccoa, GA \r\nDoris Charlene Burris Walhalla, SC Pamela Mullinax Whitlock DeLand, FL \r\nDeborah S. Martin Griffin, GA \r\nMASTER OF SCIENCE \r\nNursing \r\nPamela Ann Collins ______ Spartanburg, SC Virginia Wester Reeves Greenville, SC \r\nSandra Gilley Dickson Kingsport, TN Sheryl Hart Sheriff Anderson, SC \r\nLaura Leigh Leary Simpsonville, SC Gwendolyn Gilbert Waldrop ___ Spartanburg, SC \r\nMichael Gaines Phillips Seneca, SC Linda Rae Woodward Erie, PA \r\nParks, Recreation and Tourism Management \r\nChristopher Douglass Jones __ Tullahoma, TN "
    },
    {
        "page_number": "22",
        "text": "CANDIDATES FOR BACHELORS' DEGREES \r\nCOLLEGE OF AGRICULTURE, FORESTRY AND LIFE SCIENCES \r\nTHOMAS EUGENE SKELTON, Acting Dean \r\nBACHELOR OF ARTS \r\nBiological \r\nGiovanna Margarita Aita Chiclayo, Peru \r\nJennifer Denise Daymude ___ Gaithersburg, MD \r\nEric Grayson Lane St Simons Island, GA \r\nSciences \r\nColleen Marie Snow Richmond, VA \r\n*Jeffrey James Stephens ___ Broken Arrow, OK \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nSteven Randolph Hynes ______ Paxville, SC Charles Milton Werner III _____ Mauldin, SC \r\nAgricultural Education \r\nScott Alexander Bell ______ Walterboro, SC Amanda Lee Migliore _______ Orlando, FL \r\nRussell Lee Mayfield Spartanburg, SC \r\nAgricultural Mechanization and Business \r\nBrian J effrey Crider Williston, SC David Boyd Owens ________ Mullins, SC \r\nWilliam Benjamin Oswald, Jr. __ Allendale, SC \r\nAgronomy \r\nRebecca Leigh Causey _______ Conway, SC Jason Eric Goff__,=-==-------Columbia, SC \r\nMichael Henry Chassereau Ehrhardt, SC George William Wise III Shafter, CA \r\nAnimal Industries \r\nJason Robert Craft ________ Conyers, GA \r\nCatherine Melissa Frey Charleston, SC \r\nShannon Grey Grantham Orlando, FL \r\nSusan Rebecca Haile Charleston, SC \r\nSteve Dale Hubbard Anderson, SC \r\nRobert James Hunter Gray Court, SC \r\nJill Brock Jennings Greer, SC \r\nAquaculture, Fisheries, \r\nMichael David Baron Spartanburg, SC \r\nSarah Katherine Culhane ____ Clearwater, FL \r\n*Carmen Diane Dickover Newark, OH \r\nDavis Lee Edwards Roswell, GA \r\nTracey Cameron Evans Rock Hill, SC \r\nMichael Jason Handy Seaford, DE \r\nMary Miles Harrelson Anderson, SC \r\nJames Harrison Hill, Jr. ___ North Augusta, SC \r\nPhilip Raymond Hines Abbeville, SC \r\nGregory Brian Kahn Voorhees, NJ \r\n*Crystal Melanie Knight Irmo, SC \r\nKathleen Elizabeth McLure Irmo, SC \r\nJustin Heath Moore Summerville, SC \r\nShannon Kennedy Owens ____ Greenville, SC \r\nElizabeth Ann Shaw Camden, SC \r\nShannon Lamar Willis ____ Fountain Inn, SC \r\nand Wildlife Biology \r\nBrian Dennis Jans Lynchburg, SC \r\nChristopher Michael McCorkle ___ Columbia, SC \r\n+••Jennifer Nicole Morgan ___ Salisbury, MD \r\n*Cynthia Maria Nichols ____ Simpsonville, SC \r\nFranklin Cebus Parker, Jr. Pelzer, SC \r\nJames Earle Roberson, Jr. ____ Greenville, SC \r\nMax Capper Sparwasser Mt Pleasant, SC \r\nDavid Bryan Wildman Lexington, SC \r\nAshley Rebecca Williams __ North Augusta, SC \r\nBiochemistry \r\nRonald Todd Budde Knoxville, TN Jimmy Landon Mixon _______ Piedmont, SC \r\n+*Ingrid Erika Christensen Jackson, CA Marc Alan Smith Seneca, SC \r\nJennifer Robin Lytle Hopkins, SC Huy Dinh Tran Greenville, SC \r\n+•••Jennifer Lynn Mehlman ___ Mauldin, SC \r\nBiological \r\nJohn Brian Brizendine Huntington, WV \r\nTravis Osborne Bruce Columbia, SC \r\nNelle Purcell Cooper Jackson, NH \r\nMatthew Manning Edwards Seneca, SC \r\nPhaedra Lavonya Geathers ____ Eutawville, SC \r\nMichael Shane Hawthorne Pelzer, SC \r\nChandra Noel Kreuzer __ Arlington Heights, IL \r\nSciences \r\nAmanda Jane Martin Britton's Neck, SC \r\nGregory Allen Roche Rock Hill, SC *Francisco Romero-Pastrana ___ Puebla, Mexico \r\nDina LeaAnn Sharpe Columbia, SC \r\nJason Benjamin Sheffield Marietta, GA \r\nShawn Sutherland Slate Cordova, TN \r\nCharlie Warren Timmerman, Jr. ___ Aiken, SC \r\nEntomology \r\nDavid Alan Jenkins Spartanburg, SC \r\nFood Science *Crystal Rebecca Gervais _____ Rock Hill, SC **Mareike Johanne Ressing_ Pinneberg, Germany "
    },
    {
        "page_number": "23",
        "text": "Forest Resource Management \r\nGeorge Nelson Boone _______ Fort Mill, SC Julian David Holliday Kingstree, SC \r\nJoel Winter Burgess Kingstree, SC Jeffery Hubert Johnson ___ Kings Mountain, NC \r\nJay Cochrane Burrell Tampa, FL Ryan Eugene Kirby Gaffney, SC \r\nDyuane Arnold Dukes Charleston, SC *Paul James Shannon Greer, SC \r\nHorticulture \r\nLyles Kirby Bridwell Greenville, SC **Kelly Jo Prevete Green Ridge, MO \r\nStephen Patrick Carroll Spartanburg, SC Davis Eric Pruitt Chesterfield, SC \r\nDavid Anderson Greene Greenville, SC Billy Brian Sarvis Loris, SC \r\nAndreas Karsten Haberkorn _ Williamsburg, VA Dwayne Michael Skelnik ____ Powdersville, SC \r\nRobert Sims Key Columbia, SC Paul Jaques Stroman Denmark, SC \r\nRussell John Lewandowski Seneca, SC Robert Ashley Vaughan Inman, SC \r\nJonathan Edward Mason _Greenville, SC Daniel Wayne Vincent Kershaw, SC \r\nGregory Keith Merritt Greenville, SC \r\nMedical Technology \r\nMonica Olympia Smith Hamer, SC \r\nMicrobiology \r\nFelicia Renee Gray Greenville, SC Ursula Demetriac Miller Clinton, SC \r\nBenjamin Ward Haynes ___ Parkersburg, WV Shawn Robert Patton Edgefield, SC \r\nLa'Charita Celandenese Jenkins _Greenville, SC Richard Boswell Bobbitt Robarge __ Anderson, SC \r\nCharisse LaFawn Mays Harleyville, SC \r\nPackaging Science \r\nJames Mitchell Brown ___ West Columbia, SC *David Charlton McFadden III _Spartanburg, SC \r\n*Robin Elizabeth Brown Greenwood, SC Julie Michelle Steer Ninety Six, SC \r\nWilliam Neil Jackson York, SC *Preston Chad Stephens Woodruff, SC \r\nAngela Renee Macomson Cowpens, SC *Rodney Malone Weaver ____ Spartanburg, SC \r\nPlant Pathology \r\nDavid Alan Jenkins Spartanburg, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS AND HUMANITIES \r\nJAMES FRAZIER BARKER, Dean \r\nBACHELOR OF ARTS \r\nEnglish *Kelly Elizabeth Barnes ______ Clemson, SC Amy Leeann Harrelson Taylors, SC \r\nAmelia Catherine Beck Thornton, CO Elizabeth Alma Holladay Toledo, OH \r\nKesty Dawn Bowers Belvedere, SC ***Melissa Charlotte Howe ___ Myrtle Beach, SC \r\nNilla Perry Cate Eastover, SC +**Cynthia Ann Owens Greer, SC \r\n+**Angela Lynne Craigo Greenwood, SC Rebecca Elizabeth Powell Seneca, SC \r\nChristopher Glenn Davis Sewell, NJ Kimberly Ann Pritchard Seneca, SC \r\nBirmagidra Marie Gainor Sumter, SC Monterria Teneka Witherspoon ___ Manning, SC \r\nRebecca Sloan Goodman Turbeville, SC \r\nHistory \r\nJennifer Lee Brown _______ Greenville, SC Bryan Gene Sharkey Ansonia, CT \r\nHolly Louise Hendrix Chagrin Falls, OH Albert Lawrence Stallings III ___ Columbia, SC \r\nAndrew Colin Johnson Greenville, SC Travis Bernard Washington ___ Blackville, SC \r\nCaryne Ellys Mesquita Summerville, SC \r\nLanguage and International Trade *Jean-Marc Bajoit _____ Charleroi, Belgium Karolina Jutkiewicz Rutherford, NJ \r\nJennifer Lee Bateman Pittsburgh, PA Julia Ann Long Salisbury, MD \r\nAndrew Mark Corley Edgefield, SC Brian Joseph Mach Kennesaw, GA \r\nAndrew Newton Dobson Seneca, SC Borislava Stefanova Tzvetkova __ Sofia, Bulgaria \r\nJoshua Brian Frazier Rock Hill, SC \r\nModern Languages \r\n*Sara Elizabeth Branch _____ Pittsburgh, PA ***Jennifer Rebecca Burriss ___ Anderson, SC \r\nMatthew Kirk Broyles Irmo, SC Joseph Adair Milam Anderson, SC \r\nPhilosophy \r\nTimothy Patrick Gumkowski __ Raleigh, NC "
    },
    {
        "page_number": "24",
        "text": "Speech and Communication Studies \r\nCorey Jamal Bell ________ Hopkins, SC Allison K Edwards _______ Voorhees, NJ \r\nCasey Suzanne Christensen David Willis Goff, Jr. Winchester, VA \r\n------~~--- Hilton Head Island, SC Jill Therese Jones Little Rock, AR \r\nAaron Brendan Cook ________ Clemson, SC Brian James Slattery Ormond Beach, FL \r\nMichael Thomas Cory, Jr. Moraga, CA Lara Ann Yaroszewski Spotsylvania, VA \r\nDOUBLE MAJOR \r\nEnglish and Sociology \r\nChandor Lavette Horton ____ Columbia, SC \r\nBACHELOR OF FINE ARTS \r\nJill Anne Sanders ________ Anderson, SC Robert Hugh Wilson _______ Anderson, SC \r\nBACHELOR OF LANDSCAPE ARCIDTECTURE *Terence Joseph Cleary _____ Greenville, SC Stacy Layne Wright _______ Greenville, SC \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nMadison Blake Brigman Newberry, SC Robert Wayne Trice, Jr. ______ Seaford, DE \r\nSean Michael Sullivan ___ Lake Hopatcong, NJ Kimberly Venise White Nashville, TN \r\nJames Gregory Taylerson Rock Hill, SC \r\nDesign \r\nKeith Paul Anderson Bloomingburg, NY Paul L. Rosen North Miami Beach, FL \r\nChristopher Michael Doud San Diego, CA James Gregory Taylerson Rock Hill, SC \r\nDaniel Thomas Douglas Bradford, PA James Nerion Taylor Johnsonville, SC \r\nKarl Edward Herbst Morristown, NJ Stephanie Denise Thomas __ Winter Haven, FL \r\nEvelyn Christina Luck Greenville, SC Robert Lynn Walton Greenville, SC \r\nMarc Angelo Mitterando ___ New Monmouth, NJ \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\n*Chad Christian Cousins Greenville, SC *Kurt Alan Swoboda ________ Victoria, TX \r\nMichael George Mooradian ____ Westmont, NJ \r\nPolitical Science \r\n+*Sara Elizabeth Branch ____ ~Pittsburgh, PA \r\nStephanie Ann Brooks Gainesville, FL \r\nWilliam Bradford Linn _______ Greer, SC \r\nChristopher Michael Maier Irmo, SC \r\nBrian Whitfield Cohn New Orleans, LA Thomas Elwood Martin Unionville, PA \r\nBrian P. DeSantis Hackettstown, NJ Nancy Ann Martorano Lodi, NJ \r\nAndrew Craft Kelly Carthage, NC **John Thomas Payne Roanoke, VA \r\nJulie Anne Lewis Tallahassee, FL Bradley Neil Whitfield Anderson, SC \r\nPsychology \r\nHeather Rene Aloway Summerville, SC Kristen Camille Kelley Auburn, AL \r\nAnne Marie Anthony Greenwood, IN *Kelly Joy Kuchar Columbia, SC \r\nLori Lee Bostick Columbia, SC Lana Renea Landess Anderson, SC \r\nNicholas Edward Bradberry Gaffney, SC Denise Marie Muire Fort Lauderdale, FL \r\n*Gracia Diane Burch Walhalla, SC Elizabeth Hall Nauss Columbia, SC \r\n*Keitina Gari Donahue Culloden, WV Calista Muriel Nodine Landrum, SC \r\nJanice Wai-Lin Gregory Monroe, NY +***Jennifer Ann O'Connor Roswell, GA \r\nDavid Michael Hill ___ Hilton Head Island, SC Jennifer Eileen Skyrm Cherry Hill, NJ \r\n*Deborah Lynne Irving ___ Hendersonville, NC Adam Jonathan Tesler ____ Silver Spring, MD \r\nLaTeesha Shunta Jackson Hopkins, SC Herbert Freeman Vaughn III __ Honea Path, SC \r\nTabitha La.Xavier Jeffcoat Swansea, SC Currie Marissa Whisenhunt ___ Charleston, SC \r\nJudith Johannah Johnson Hartsville, SC \r\nSociology \r\nSean Richard Andersen _______ Salem, SC Elizabeth Brown Owens West Union, SC \r\nKathryn Elaine Barnett Easley, SC Anita Jeanette Peeler Landrum, SC \r\nNeil Alan Blankenship Greenville, SC Katherine Walker Perry Anderson, SC \r\nJulie Anne Carpenter North Augusta, SC Matthew Eric Phillips Seneca, SC \r\nNeal Raymond Elgin Anderson, SC Sarah Cherry Ross Springfield, VA \r\nHarrison Stephen Evans Six Mile, SC ***Stacey Deanna Ruf Greenville, SC \r\nBeth McElroy Fallaw Gaffney, SC Daniel William Sawall Topsfield, MA \r\nJames William Lindsey Townville, SC Christopher David Seamands __ Springfield, VA \r\nTeddy Robert McNamara Danbury, CT Heather Alison Sherwood Annapolis, MD "
    },
    {
        "page_number": "25",
        "text": "Sociology (continued) \r\nJames Raymond Turner ____ Spartanburg, SC Patina Sharese Walton _______ Decatur, GA \r\nStephen Lamar Turner Buffalo, NY *Stacey Ann Willocks Longwood, FL \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nLaura Ann Banister Young Harris, GA *Henry Ralph Huthmacher, Jr._ Goose Creek, SC \r\nKimberly Sue Bisson Springfield, VA Deardra Mignonne Littlejohn ____ Gaffney, SC \r\n+*Laurie Ann Bradham Charleston, SC Andrea Tolson McCall Anderson, SC \r\nSara Tamara Tucker Burdick Easley, SC Russell Lee Medlin Starr, SC \r\nLynn Delores Campbell Starr, SC Christopher Ian Miller Aurora, IL \r\nJessica Mae Chapman Shady Spring, WV Darren Paul Miranda Manor Park, NY \r\nEric McKenzie Cobb Lake Wylie, SC Robert Lee Moore II Myrtle Beach, SC \r\nJason Andrew Cranford Columbia, SC *Eric Douglas Pitts El Paso, TX \r\nJennifer Leigh Dean Easley, SC James Michael Sheehy Annandale, VA \r\n+*Deana Gay Doughty Simpsonville, SC Carrie Marie Smith Greenville, SC \r\n***Maura Ann Gilmer Anderson, SC *Heather Anne Taylor ___ Salt Lake City, UT \r\nTiffany Joy Godwin Coward, SC James Lester Townsend III ___ Greenville, SC \r\n+**Virginia Marie Greenwell __ Walterboro, SC Mark Theodore Wert Malvern, PA \r\nTasha MaShaun Harvard Atlanta, GA **Charlene K. Wilder Orangeburg, SC \r\nWilliam Everette Hines Aiken, SC Eugenia Lee Woodall West Columbia, SC \r\nEconomics \r\nTad Michael Fox __________ Sparta, NJ Christopher Luis Page ______ Bethlehem, PA \r\nWendy Anne Gross Upper Marlboro, MD Bryan Paul Townsend Morristown, TN \r\n*Nabil Michael Kabbani Anderson, SC Travis Lane Williams Greenville, SC \r\nChristopher Todd Masters Roswell, GA \r\nFinancial Management \r\nEvans Bridges, Jr. Bennettsville, SC *David Scott Nunziato North Augusta, SC \r\nWalter Kirby Britt, Jr. Hartsville, SC Enayat William Oliver Decatur, GA \r\nRobert Brent Bryson Easley, SC Dale Larry Ouellette Southington, CT \r\nDavid Alan Cote Mt Laurel, NJ Claudia Renee Partin Greenville, SC \r\nJason William Cote Orangeburg, SC Shaun Thomas Plymale Stuart, FL \r\nDaniel Henry Davidson Lake Wales, FL *David Arthur Ryan Greenville, SC \r\nDominique Melissa Debald ____ Flemington, NJ Michael Paul Scalzi Bowie, MD \r\nAllen Shuler Derham Orlando, FL Michael Thomas Serijan ___ Yarmouthport, MA \r\nJeffrey Earle Dunham Spartanburg, SC Oliver Shaw Hammond Smith __ Fripp Island, SC \r\nNeil Fowler Garrett Laurens, SC Robin Carrie Taylor Greer, SC \r\nLarry Charles Hargrove, Jr. ____ Charleston, SC John Brent Thomas Anderson, SC \r\nHeather Elizabeth Herndon Dalton, GA Robert Baldwin Thompson III ___ Greenville, SC \r\nChristopher Michael Jones Belton, SC Brian Christopher Wagner _Stone Mountain, GA \r\nJohn William Jones Orangeburg, SC Shane Bennett White Huntsville, AL \r\n*Michael Henry Lee Seneca, SC Samuel Carson Wilder Simpsonville, SC \r\nRobert Thomas Lennon, Jr. ____ Greenville, SC Thomas Wade Williams Clemson, SC \r\nLeonard Kerschel McFadden ___ New Zion, SC Robert Dale Zeller II Newark, OH \r\nMichael Edward Miller Nazareth, PA Britta Lynn Ziemer Eden Prairie, MN \r\nGraphic Communications \r\nErnest Liston Beck_= _____ Mt Pleasant, SC Eric Muller McGuirt Blythewood, SC \r\nHugh Vance Brinson III Anderson, SC Andrew Brian Milliorn Arlington, TX \r\nLaura Melissa Coleman Lake City, SC Sheldon Todd Rhyne Statesville, NC \r\nAmy Lynn Copley Columbia, SC Andra Elizabeth Savage Charleston, SC \r\nJohn Carl Davis Summerville, SC *Donald Lee Stamey Rock Hill, SC \r\nJeffrey Scott Eill Malvern, PA Neil Chandler Waldrop Greenville, SC \r\nDerrick Richard Jordan Clemson, SC Kevin Eugene Williams Lancaster, SC \r\nJenny Lyn Martin Wake Forest, NC Cathleen Elizabeth Wilson ____ Greenville, SC \r\nIndustrial Management \r\nTonya Denise Dixon Rock Hill, SC **David William Rudert_ Hopewell Junction, NY \r\nTonya Michelle Evans Ware Shoals, SC Daniel Phillip Schwanda ___ Wakinsville, GA \r\nPaul Watson Finley II Clinton, SC William Barry Sims Greer, SC \r\nSteve Shannon Harvey Walhalla, SC Barham Foster Thomson IV Burke, VA \r\n*Leandra Elizabeth Lawter ___ Spartanburg, SC Richard Mark Voelker Columbia, MD \r\nFain Matthew Moran Wayne , NJ Alfreada Renay Walker ____ Simpsonville, SC \r\nBenson Clayton Parrish Lincolnton, GA "
    },
    {
        "page_number": "26",
        "text": "Management \r\nAnthony Paul Villanueva Aujero __ Anderson, SC Nancy Kay Greer Belton, SC \r\nSarah Luann Bannister Anderson, SC Melanie Nicole Gudzan Raleigh, NC \r\nKelly Cochran Brock Seneca, SC Brandon Marcel Hogue ___ Virginia Beach, VA \r\nNicholas J . Cordaro Newark, NY Anthony Todd Holliday ____ San Antonio, TX \r\nJames Edward Cubitt Spartanburg, SC Richard Derek Hunsucker Rock Hill, SC \r\nChristopher James Dandrea Marlton, NJ James Scott Jarrell Simpsonville, SC \r\nJames Richardson DeLand III _ ___ Edison, NJ Christopher James Kozlowski Erie, PA \r\nStanton Pond Durnin Clemson, SC James Luke Malfetti III Scotch Plains, NJ \r\nJohn Neil Fassino Seneca, SC Richard Harvey Muncaster ____ Marianna, FL \r\nJames Allen Ferguson III _ _ _ _ Orangeburg, SC John Young Neal, Jr. _ _ __ Virginia Beach, VA \r\nApril Dawn Fiorella Bemus Point, NY Jeffrey David Sauve Mechanicsburg, PA \r\nLaTanya Yvonne Flynn Darlington, SC Scott Robert Schoenwiesner ___ Little Silver, NJ \r\nRyan Dale Galyean Clemson, SC James Everett Sims Lockhart, SC \r\nGeoffrey Lyle Gardner Lexington, NC Scott Elliott Stevenson Clemson, SC \r\nTy Alan Green Turbeville, SC Frank Dunnington Thornhill __ Charleston, SC \r\nMarketing \r\nJohn Kevin Atchley Pauline, SC David Keith Hanglin Hampton, NH \r\nDacun Arant Banks Charleston, SC Brian Christopher Harris Dayton, OH \r\nChristopher Richard Bauer ___ Manasquan, NJ Mary Anne Iuliano Clemson, SC \r\nJames Alexander Beard, Jr._ Pawleys Island, SC Amy Anne Lucas Knoxville, TN \r\nJeffrey Lloyd Bowie Brentwood, TN Kathy Elaine Martin McCormick, SC \r\nJennifer Elizabeth Bowie _ _ _ _ Spartanburg, SC Carey Lynn Melvin Marietta, GA \r\nJoseph William Boykin, Jr. _ ___ Charlotte, NC Robert Rhett Mitchell Wilmington, DE \r\nPaxton Holmes Briley, Jr. __ Stone Mountain, GA Paul C. Musick Aiken, SC \r\nApril Nichole Brown Greenville, SC Michael Weiland Nissen ___ Slagelse, Denmark \r\nTonya Yvette Burgess Easley, SC Kevin Michael Petry Elizabethtown, KY \r\nDeborah A. Butters Biddeford, ME Christine Elizabeth Platt Marietta, GA \r\nAlicia Ann Cox Fairfax, VA Robert Clarke Pressly ___ Fredericksburg, VA \r\nMatthew Alan Cox Greenwood, SC Stacey Lyn Schutte LaGrange, GA \r\nMichael Cantey Davis Marietta, GA Stephanie Olivia Snethen Sparta, NJ \r\nKatie Anne Donahue Spencerport, NY Darren Patrick Taylor Rochester, NY \r\nChanning John Fredrickson _ __ Moncure, NC Jason Eric Thomason Greenville, SC \r\nAmy Louise Goetz Greenville , SC Joseph Charles Thurman Concord, MA \r\nRobert Alan Graham, Jr. Columbia, SC Derrick Brent Wallace _ __ Stone Mountain, GA \r\nAmy Elizabeth Gunderson ____ Marshfield, MA Mark Manning Wilson Darlington, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF ARTS \r\nComputer Science \r\nLatonia Denise Brown Charleston, SC \r\nGeology \r\nStacey Lynne Miller _ ______ Olney, MD \r\nMathematical Sciences \r\nDevonya Edwina Clinkscales _ _ Anderson, SC \r\nBACHELOR OF SCIENCE \r\nAgricultural Engineering \r\n(Agricultural Engineering is jointly administered by the College of \r\nAgriculture, Forestry and Life Sciences and the College of Engineering and Science.) \r\nWarren Thomas Bozard Orangeburg, SC Wade Everett Lambert Ruby, SC \r\nJerry Arthur Brannon, Jr. Chapin, SC Louis Payton Parsons, Jr. Georgetown, SC \r\nScott Evans Courtney Summerville, SC David Harry Prince Loris, SC \r\nJames O'neal Creel, Jr. Hemingway, SC Stephen Roy Squires Hemingway, SC \r\n*Betsy Katherine Gerwig _ __ Summerville, SC Victoria Lynn Waldron ___ Upper Marlboro, MD \r\nWalter Eric Grose Clover, SC \r\nCeramic Engineering \r\nTyson Christopher Brass _____ Marietta, GA Charles Trevor Pickens Burlington, NC \r\nTerry Lee Clites Moncks Corner, SC Brian Patrick Polen Sumter, SC \r\nBenn Westley Foulk Dallastown, PA Andrew Michael Spradling __ Rocky Mount, VA \r\nColin Patrick Hundley Barnwell, SC Markus Heinrich Teepe Union, NJ \r\nBryant Chetley Lewis Charleston, SC Tracy Lynn Torres Mauldin, SC \r\nTerry Ray McCormick Floydale, SC Bryce Troy Wentworth Avon Park, FL \r\nRobert Natale Morano Georgetown, SC Brant Max Wolff Gaffney, SC \r\n+*Stuart Richard Olson Sumter, SC "
    },
    {
        "page_number": "27",
        "text": "Chemical Engineering \r\nCharles Edward Lindler _______ Killen, AL David Warren Scott _____ North Augusta, SC \r\nJennifer Lynn Rose Kinnelon, NJ \r\nChemistry \r\n*Andrew Michael Crotwell ______ York, SC James Charles Price, Jr. ______ Clemson, SC \r\nTonya Nicole Foster Ninety Six, SC ***Jason Alan Smith Joanna, SC \r\nJames Duncan McClellan Sellers, SC \r\nCivil Engineering \r\nAngela Jean Allinder Seneca, SC Chris Sabine Lewis Green Sea, SC \r\nJason Gerald Anastasia ____ Douglasville, GA Clinton Wesley Link Columbia, SC \r\nAnthony John Arrowood Greer, SC John Willie Locke, Jr. Rock Hill, SC \r\n*Jeffrey Paul Barkman Waxhaw, NC Rob Andrew Matthews III _ Hilton Head Island, SC \r\nJeffrey Robert Barrett Mauldin, SC Thomas Stricker McCanless, Jr. __ Maulctin, SC \r\nKelly Lynn Becker Goose Creek, SC Ronald Bradley Meredith ___ Simpsonville, SC \r\nThomas Scott Bettcher ____ Virginia Beach, VA Kevin Royce Mitchell Aiken, SC \r\nJoshua Charles Beyer Bradenton, FL Richard Walter Noble, Jr. Columbia, SC \r\nPinakin Dinesh Desai Columbia, SC Joseph Igwebuike Okwuazi Clemson, SC \r\nJames Lamar Dodson Norris, SC *Brandon Wayne Punch Landrum, SC \r\nMatthew Douglas Frohlich Clemson, SC Scott Wayne Quaintance __ Ocean Isle Beach, NC \r\nBlair Richard Garcia Haymarket, VA Zoraya E. Roldan Seneca, SC \r\nDeana Lynn Garner Greenwood, SC Kevin Eli Shoemake Orangeburg, SC \r\nEdward Alexander Griffin ____ Hartsville, SC Dennis Richard Shultz Boca Raton, FL \r\nRonald Kevin Hall Easley, SC *Christina Smith Myrtle Beach, SC \r\nTimothy Barrett Harper Charleston, SC **Gant Michael Taylor ____ Surfside Beach, SC \r\nChristopher Price Howard ___ North Augusta, SC Brian Edward Thompson Rock Hill, SC \r\n*Mark Christopher Ikeler Eustis, FL Robert K. Tse Piedmont, SC \r\n*Edward Alan Isom Anniston, AL Scott Ferguson Turner Greenville, SC \r\nMary Nelle James Lakeland, FL Jonathan Paul Usher Charleston, SC \r\nKaren Patricia Kaminski Pendleton, SC Jeffrey Allen Walker Spartanburg, SC \r\nJason Robert Kellogg DeLand, FL Jeffrey King Webb Myrtle Beach, SC \r\n*Chanchala Thilanthie Kulasekera _Clemson, SC Albert Simpson Welch, Jr. Florence, SC \r\nTimothy Labrie Northbridge, MA \r\nComputer Engineering \r\nJeffrey Acosta Bogtong ------=Ladson, SC *Dale Raimonde Geiger ____ Summerville, SC \r\nStuart Reid Davis Barnwell, SC *Robert Lee Pointer III Johnson City, TN \r\nComputer Information Systems \r\nJames Charles Bragg _______ Denmark, SC Joel Richard Pennington ______ Tucson, AZ \r\nDudley Taylor Holmes Columbus, GA Devin Matthew Reilly Mahwah, NJ \r\nJames Gregory Patterson Greenwood, SC \r\nComputer Science \r\nSteven Bradley Afrin Hanahan, SC ** Arun Kumar Mathur _____ Charleston, SC \r\n***Michael Stuart Alls Simpsonville, SC Brent Daniel McAfoos Florence, SC \r\nMichael Locke Boney Buffalo, SC Robert Andrew Painter Rock Hill, SC \r\nJames Thompson Duncan ___ Kensington, MD *Patricia Zatarain Perez Sonora, Mexico \r\nKimberlee Marie Fisher Cheltenham, MD *Erik Alan Pohl Anderson, SC \r\nDean Allen Reistad Iowa City, IA Kristopher Michael Porterfi eld Irmo, SC \r\nJames Frederick Hoadley Easley, SC Robert Gregory Reynolds Beaufort, SC \r\nErik James Martin North Charleston, SC Mark Edward Villanueva Ladson, SC \r\nElectrical Engineering \r\nNathan Jerrold Bailie Lexington, SC Robert Eugene Meyer II Charleston, SC \r\nMichael Shannon Carver Greenville, SC ***Khanh Duy Nguyen Greenville, SC \r\n*David Michael Coffey Columbia, SC **Asif Abdulrahim Patel Greenville, SC \r\nDaryl Kenric Davis Columbia, SC Mitesh Jaydev Patel Greer, SC \r\nLori Anne Dorrell Brunswick, ME Charles Wayne Patterson Elgin, SC \r\nVictor Joseph Doyle Freehold, NJ Jonathan Lawrence Paulsen ___ Greenville, SC \r\n*Nerio Flores Hilton Head Island, SC Andrea Lee Poole Laurens, SC \r\nJames Nathan Francisco Bear, DE Jehrionne Jaactana Reed ___ Jenkinsville, SC \r\nBenjamin William Gies Lexington, SC *Julius Isaiah Rice Whitmire, SC \r\nErastus Ivey III Columbia, SC Christopher Donavon Roland Irmo, SC \r\n*Kenneth Edwin Krause, Jr. Largo, FL Lakeasha Monique Rutledge __ Williamston, SC \r\n**Richard Earl Langley, Jr. ___ Lexington, SC Christopher Gerard Timmons ____ Florence, SC \r\nVeretta Elcenia Lindsay Greenville, SC Toshihiro Ueno Nagasaki, Japan \r\nMalcolm Tyronne Meeks Rock Hill, SC \r\nEngineering Analysis +*Robert Brunson Cartledge, Jr. __ Martinez, GA Shannon Dale Stafford _______ Seneca, SC \r\nJeffrey Wallace Mosher ____ Summerville, SC "
    },
    {
        "page_number": "28",
        "text": "Geology \r\nAllison Elizabeth Corbin ____ Hanahan, SC \r\nIndustrial Engineering \r\nHarold J. Coleman, Jr. _____ Washington, DC Douglas Branson Morris ____ Mt Pleasant, SC \r\nLarry Wayne Cribbs Bluffton, SC John Christopher Munns Honea Path, SC \r\nSammie Lee Geiger Ridgeway, SC Timothy John Rybak Altus, OK \r\nShondra Tineeka Greene Sylvester, GA Scott Louis Schwasnick Oxford, NY \r\nLisa Joy Malony Cherry Hill, NJ William Christopher Simon, Jr. _ Greenville, SC \r\nChristopher Todd Masters Roswell, GA Steven Dean Strange Cowpens, SC \r\nMathematical Sciences \r\nJonathan Andrew Campbell _____ Naples, FL \r\nIkemesit Amajak Eyo Orangeburg, SC \r\nHappy Anne Hussey Durham, NC \r\nMechanical \r\nTimothy Scott Anderson Aiken, SC \r\nMark Everett Benjamin Goose Creek, SC \r\nBenjamin Cable Best North Augusta, SC \r\nClaude William Bolton, Jr. ___ Honea Path, SC \r\n+**Garry Wayne Brewer, Jr. ____ Columbia, SC \r\nTeresa Ann Briggs Nesmith, SC \r\nDanielle Christine Cleary Wyckoff, NJ \r\nRichard Champion Davis III ___ Mt Pleasant, SC \r\nPhilip Marvin Douda Lexington, SC \r\nJeremy Carter Durham Greenville, SC \r\nRobert Ryan Gens Frankfort, IL \r\nWesley Farrell Gilbert Spartanburg, SC \r\nTimothy Lynn Godwin Walterboro, SC \r\n**Steven Lanier Gourdin Pineville, SC \r\nGregory Hampton Grossman ___ Charleston, SC \r\n**Todd Samuel Harris ____ North Augusta, SC \r\nRay Cooper Hartzog, Jr. Orangeburg, SC \r\nPaul Andrew Ilenda Ellicott City, MD \r\nGordon Douglas James ____ Mountain Rest, SC \r\nWalton Richter Jeffcoat Pinopolis, SC \r\nChad Edwin Jones Plum Branch, SC \r\nPatrick Brian King Rock Hill, SC \r\n*Shawn Robert Laskoski ___ Walkersville, MD \r\nLaurel Lise Lempicke Rock Hill, SC \r\nLavinia Maria Maldonado Columbia, SC \r\nRobert Tillman Manning, Jr. __ Spartanburg, SC \r\nJohn Paul Martin Simpsonville, SC \r\n+***Deborah Leigh Mabey ___ Middleburg, FL \r\nDavid Keith Zeiler Bethel Park, PA \r\nEngineering \r\nKenneth Gray McArver Charlotte, NC \r\nMichael Ryan McCann ___ Stone Mountain, GA \r\nWilliam Allen Miller Marion, SC \r\nRoy Mitchel Neal II Wilmington, NC \r\n+*Benjamin David Nibali_West Friendship, MD \r\nJustin Andrew Osborn Sycamore, OH \r\nDavid Louis Pellegrino Madison, CT \r\nBradford Dallas Pilgrim Starr, SC \r\nJames Dwight Porterfield II ___ Fountain Inn, SC \r\nMartin Craig Pyle Charleston, SC \r\nCharles Franklin Reames Grafton, VA \r\nTania Ann Schlise Rock Hill, SC \r\nEvan Ray Shealy Leesville, SC \r\nPatrick Embry Shearer Florence, SC \r\nRyan Brent Shore Brookfield, CT \r\n+**Patrick Timothy Stone ___ Johnsonville, SC \r\nScherell Thomas Effingham, SC \r\nTerence Dylan Tolbert Abbeville, SC \r\nWilliam Kristofer Troha Dayton, OH \r\nSteven Craig Tucker Simpsonville, SC \r\nKirsten Renee Vader-Hale Seneca, SC \r\nBrett Michael Villiger Greenville, SC \r\nNolan Maurice Watson Pickens, SC \r\nJay Todd Weaver Greenville, SC \r\nJeffrey Wayne Wingard Hartsville, SC \r\nC. Douglas Yeager Knoxville, TN \r\n+**Sean Zyblewski Lancaster, PA \r\nPhysics \r\nMichael Stephan George _____ Blythewood, SC *Andre Jacobus Muis ______ Greenville, SC \r\nTextile Chemistry \r\nTyler Andrew Grant Hyde Park, VT \r\nTextile Management \r\nJames Harold Ashley, Jr. -------York, SC Joel Thomas Reynolds ________ Dalton, GA \r\nTextile Science \r\nBradley Scott Ballentine ______ Clemson, SC *Susan Elaine McCraw _______ Gaffney, SC \r\nYolanda Michelle Jackson Gadsden, SC \r\nCOLLEGE OF HEALTH, EDUCATION AND HUMAN DEVELOPMENT \r\nJERRY EUGENE TRAPNELL, Acting Dean \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\nJamie Capp Dawkins. _______ Hartsville, SC Shannon Leigh King Acworth, GA \r\n**Donna Anne Evatt Liberty, SC Stephanie Ann Lewis Fairfax, SC \r\nBobbie Elizabeth Hodge Hartsville, SC ***Shannon Casey Ragsdale ___ Clemson, SC \r\nKristen Shuler Holstein Columbia, SC **Rebecca Clark Waldrep ____ Greenville, SC \r\nBanner Mallissia Howell Sumter, SC "
    },
    {
        "page_number": "29",
        "text": "Elementary Education \r\nTina Evans Akins Anderson, SC Katherine Jordan Lawrence Aiken, SC \r\nAmy Caroline Bayne Travelers Rest, SC Kari Beth Lewis Greenville, SC \r\nLaura Catherine Burch Clemson, SC Stacey Anne Long Greenville, SC \r\nMary Elizabeth Chapman ____ Boca Raton, FL Russell Scott Lowery Greenville, SC \r\nCrystal Perdue Cheek Seneca, SC **Michelle Seymore Merritt Easley, SC \r\n*Shannon Lynn Cravens Fair Play, SC Gary Ruehl Mohr, Jr. Seneca, SC \r\nKimberly Elizabeth Crouch __ Basking Ridge, NJ Billie-Jo Ann Osowicki Easley, SC \r\nMeredith Danielle Dyar Anderson, SC Blaine Thomas Peltier Greenville, SC \r\n***Sandra Diane Echols West Union, SC Brandy Renee Perry Seneca, SC \r\nMary Claire Ellis Lugoff, SC Kimberly Landrith Pruitt Anderson, SC \r\nMichelle Lynn Engberg Marietta, GA +**Kathleen Ann Secrist Anderson, SC \r\nJennifer Ann Flynn Brightwaters, NY Elizabeth Marie Slaughter ____ Greenville, SC \r\nKimberly Anne Foster Pendleton, SC Mary Idell Stadelman ____ College Station, TX \r\nDennis Ryan Freeman Darlington, SC Jennifer Wells Trish ___ Hilton Head Island, SC \r\nPamela Colette Gobble Mauldin, SC Victoria Elizabeth Updyke Atlanta, GA \r\nJoset Angelique Haggerty ___ Westminster, SC ***Holly Christine Van Kirk Salem, SC \r\nMelissa Nicole Hart __ Sanjuan Capistrano, CA Aidra Shalaunda Vereen Charleston, SC \r\nLorie Dee Hutto Mauldin, SC *Shelley Lynn White Walterboro, SC \r\n***Denise Ann Johnson Easley, SC Jennifer Renee Williams ____ Greenville, SC \r\nMary Evelyn Joiner Greenwood, SC Angela Nicole Wood Easley, SC \r\nKaren Denise Jolley Spartanburg, SC \r\nSecondary Education \r\nMary Beth Billig ________ Greenville, SC Michael John Legge, Jr. ______ St James, NY \r\nKellie Marie Eaves Union, SC Eric Boyd Nail North Myrtle Beach, SC \r\n*Glenda Leigh Few Simpsonville, SC **Kristina Leigh Phillips Anderson, SC \r\nBrian Keith Franklin Laurens, SC *Gerald Keith Price Camden, SC \r\nRoland Scott Freeman Lancaster, SC Robert Alton Roach Williamston, SC \r\nVanessa Ann Glover Bamberg, SC Shawna Renee Ruff Hendersonville, NC \r\nJoseph Kenneth Hall, Jr. Greenville, SC *Robert Chad Seaborn Easley, SC \r\n*Christi Nichole Hamm Seneca, SC Wanda Brown Tharpe Greenville, SC \r\nDana Cam Henderson Liberty, SC Monica Alyssa Wills Greenville, SC \r\nWendy Black Laird Summerville, SC Michelle Lee Woodard Walterboro, SC \r\nKenneth Bernard Lawson Camden, SC \r\nSpecial Education \r\nDarlin Dacole Meredith North Myrtle Beach, SC \r\nBACHELOR OF SCIENCE \r\nHealth \r\nLori Leigh Baker Pickens, SC \r\nEllen Mary Bontempo Toms River, NJ \r\nJeanette Marie Brettner Marietta, GA \r\nCharity Jo Bruton Summerville, SC \r\nJill Pitcairn Burgtorf Marietta, GA \r\nShannon Maureen Connolly ____ Rock Hill, SC \r\nCarlton Pressley Daves Greenville, SC \r\nGina Dolores-Abaya De La Cruz_Forked River, NJ \r\nSherri Bentley Gibson Walhalla, SC \r\nPatrice Munsel Hawthorne Anderson, SC \r\nKerri Elizabeth Hibbard Columbia, MD \r\nScience \r\nJonathan Lynch Holway Fort Mill, SC \r\nElizabeth Winters Mabry __________ _ \r\n~--------Wright-Patterson AFB, OH \r\nCarrie Whitley Nobles __ North Myrtle Beach, SC \r\nJessamine Elizabeth Peterson ____ Conway, SC \r\nMelany Cember Roach Atlanta, GA \r\nKevin James Stockdale Park Ridge, NJ \r\n*Jodi Lynn Thompson Clarksville, MD \r\nMichael Joseph Veech Woodbury, CT \r\nKristin Elizabeth Wheeler ___ Darnestown, MD \r\nKristine Ann Wrona Simpsonville, SC \r\nIndustrial Education \r\nThomas Greg Cooke_.,,--___ Travelers Rest, SC Trevor Jay Putnam_~-----~ Canton, NC \r\nWilliam Dennis Ely, Jr. Columbia, SC ***Trent Arden Renfrow Greenville, SC \r\nHenry Edward Guess Orangeburg, SC Timothy John Scheibe!, Jr. Trumbull, CT \r\nChristopher Michael Mclnally Troy, MI \r\nMathematics Teaching \r\nWilliam Wofford Anderson, Jr. __ Walhalla, SC James Arnold Parnell _______ Belton, SC \r\nLeah Pauletta Bryant Eutawville, SC Bruce Edward Sawyer Clemson, SC \r\nChristopher Grant Garrison ____ Anderson, SC \r\nNursing \r\nLisa Jones Cromer Anderson, SC Celeste Evrae Landrum ____ Reisterstown, MD \r\nSara Anette Crouch Ridge Spring, SC Tammy Laurell Livingston Pelion, SC \r\nDanielle Marie DeRoia Savannah, GA Jessica Nicole MacMullan Pittsburg, PA \r\nAmanda Michelle DeYoung ___ Spartanburg, SC Virginia Lee Mullinax Central, SC \r\nKellie Laine Gantt Rock Hill, SC Edward Spencer Parker Chester, SC \r\nSusan Harbison Spartanburg, SC Kara Denise Smail Summerville, SC \r\n**Claudia Patricia Jenkins ___ Greenville, SC Tammy Elaine Stephenson ____ Walhalla, SC \r\nLeAnne Thompson Johnson ____ Piedmont, SC Elizabeth Garland Timmerman ___ Chapin, SC \r\nNancy Patricia Kirkley Greenville, SC "
    },
    {
        "page_number": "30",
        "text": "Parks, Recreation and Tourism Management \r\nJulie Marie Addis Walhalla, SC Douglas Ashley Martin Clearwater, FL \r\nStuart Nelson Barnhardt Charlotte, NC Brian Sean McNeill Burke, VA \r\nWade Scott Black Saluda, SC Christopher Kyle Merck Easley, SC \r\nGeorge William Boozer IV ____ Greenville, SC Frances Cart Miller Charleston, SC \r\nJonathan Samuel Brill ___ Port Washington, NY Nichola Angel Natale-Pack Seneca, SC \r\nDavid Martin Chjlders Batesburg, SC Spencer Douglas Neal Brookfield, WI \r\nSaralyn Gunnells Columbia, SC Michelle Lynn Pitts Easley, SC \r\n**Prentiss Elaine Hallman ____ Columbia, SC Greggory Ray Poteat Spartanburg, SC \r\nHeather Amanda Humphries ___ Greenville, SC Christopher Michael Robinson __ Richmond, VA \r\nMonica Ballenger Jones Walhalla, SC Joanne Kristin Schaeffer Greenville, SC \r\nEric M. Kiel Columbus, IN Britton Michael Seay Greenville, SC \r\nStephanie Lyn Lutz Baltimore, MD John Alan Thorp Hingham, MA \r\nSusan Rebecca Malcom ____ Social Circle, GA \r\nScience Teaching \r\nAmy Susanne Ashton _______ Columbia, SC Scott Morgan Senn ------- Newberry, SC \r\nDavid Travis Polson Greer, SC Jeffrey Patterson Walker Fort Mill, SC \r\n*Chanda Beth Rhyne Clemson, SC \r\n*Cum laude: A grade point ratio of 3.40 to 3.69 \r\n**Magna cum laude: A grade point ratio of 3. 70 to 3.89 \r\n***Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\n+Senior Departmental Honors: The students so designated have earned a B or better in the six to twelve \r\ncredits of honors work at the upper division level in a program designed by their department. They have \r\nmaintained a minimum GPR overall of 3.40. They appear in the line of march with an honors \r\nmedallion on an orange and purple ribbon. "
    },
    {
        "page_number": "31",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green Clemson (1807-\r\n1888), who left the bulk of his estate to the State of South Carolina for the \r\nfounding of the institution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at \r\nthe Royal School of Mines in Paris (1828-1832). His early profession was \r\nthat of a mining engineer; however, circumstances diverted his \r\ninterests into politics and the life of a southern planter, and he soon \r\nbecame an enthusiastic advocate of scientific agriculture. He had a \r\ncareer as a diplomat (charge d'affaires to Belgium, 1844-1852) and \r\nserved as the first Superintendent of Agricultural Affairs in \r\nWashington (1860). As a scientist he published numerous articles in the \r\nfields of mining, chemistry and agriculture. His varied activities \r\nincluded his assistance in the founding of the Maryland Agricultural \r\nCollege, his support of the Morrill Act, his leadership in South Carolina \r\nafter the Civil War, and his part in founding Clemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. \r\nCalhoun, a political figure of national importance during the first half \r\nof the nineteenth century. Mr. Calhoun's home, Fort Hill, is preserved \r\non the Clemson Campus as a national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two \r\nfour-year curricula, supplemented by two two-year preparatory courses. \r\nToday the University has six major academic units. These are the \r\nCollege of Agriculture, Forestry and Life Sciences, the College of \r\nArchitecture, Arts and Humanities, the College of Business and Public \r\nAffairs, the College of Engineering and Science, the College of Health, \r\nEducation and Human Development, and the Graduate School. \r\nThe institution is an accredited member of the Southern Association \r\nof Colleges and Schools; various curricula are accredited by the \r\nAccreditation Board for Engineering and Technology, American \r\nAssembly of Collegiate Schools of Business, Computing Sciences \r\nAccreditation Board, Council on Accreditations of the National \r\nRecreation and Park Association, National Architectural Accrediting \r\nBoard, National Association of State Directors of Teacher Education and \r\nCertification, National Council for Accreditation of Teacher Education, \r\nNational League for Nursing, and Society of American Foresters. \r\nClemson is a land-grant institution. As such, it is engaged not only in \r\nits primary academic program, but does extensive research at the main \r\ncampus and at five agricultural experiment stations located in the \r\nState. The University is also heavily committed to a varied program of \r\npublic service, including the work of agricultural extension which has \r\nprofessional personnel located in each of the State's counties. "
    },
    {
        "page_number": "32",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "33",
        "text": "Note: Candidates appearing in this program are not certified graduates. \r\nLikewise, academic honors designations are based upon performance prior to \r\nfinal grades. Both certification of graduation and honors designations must \r\ncome from the Registrar of the University. \r\nFirst Aid A First Aid Station is located at Portal 0 . \r\nEvacuation System Littlejohn Coliseum is equipped with a fire alarm \r\nevacuation system. In the event of activation, as noted by sustained horns and \r\nstrobe lights, please proceed to the closest available exit. Remain outside the \r\nbuilding until fire officials deem the building safe to re-enter. \r\nNo Smoking Smoking is prohibited in the seating area of Littlejohn Coliseum. \r\nCigarette receptacles are provided around the outer concourse. "
    }
]