[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n12-16-1999\r\nClemson Commencement Program, December\r\n1999\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, December 1999\" (1999). Clemson Commencement Programs. 133.\r\nhttps://tigerprints.clemson.edu/comm_programs/133"
    },
    {
        "page_number": "2",
        "text": "Graduation Exercises \r\nDecember 16, 1999 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "I \r\n' \r\nI \r\n~ Congratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for individual \r\ngraduates. Such expressions frequently detract from the recognition due the \r\nnext graduate in line. Your cooperation is respectfully requested. "
    },
    {
        "page_number": "4",
        "text": "r \r\nGraduation \r\nThursday, December 16, 1999 \r\n11:00 a.m. Littlejohn Coliseum \r\nORDER OF CEREMONIES \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation.) \r\nInvocation \r\nJohannah Leigh Cornwell, Student Representative \r\nIntroduction of Trustees \r\nPresident James F. Barker \r\nConferring of Honorary Degrees \r\nPresident James F. Barker \r\nRecognition of the Deans of the Colleges \r\nVice President for Academic Affairs and Provost \r\nSteffen H. Rogers \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident James F. Barker \r\nRecognition and Presentation of Awards \r\nClass of '39 Award For Excellence \r\nFaculty Scholarship Award \r\nAurora Brass Quintet \r\nFrank W. Breazeale, Organist \r\nKevin Davidson, Soloist \r\nDr. Bruce Yandle, University Marshal "
    },
    {
        "page_number": "5",
        "text": "l \r\nI \r\n' \r\nBOARD OF TRUSTEES \r\nLawrence M. Gressette, Jr., Chairman _________ Columbia \r\nWilliam C. Smith, Jr., Vice Chairman Columbia \r\nBill L. Amick Batesburg \r\nJ. J. Britton Sumter \r\nLeon J. Hendrix, Jr. New York, NY \r\nHarold D. Kingsmore Aiken \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee Greenwood \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick III Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nAllen P. Wood Florence \r\nTrustees Emeriti \r\nLouis P. Batson, Jr. ________________ Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW. G. DesChamps, Jr. Bishopville \r\nPaul W. McAlister Laurens \r\nPaul Quattlebaum, Jr. Charleston \r\nD. Leslie Tindal Pinewood \r\nJames M. Waddell, Jr. Columbia \r\nExecutive Secretary to the Board of Trustees \r\nJ. Thornton Kirby \r\nADMINISTRATIVE OFFICERS \r\nJames F. Barker _________________ President \r\nSteffen H. Rogers Vice President for \r\nAcademic Affairs and Provost \r\nJohn Kelly ________________ Vice President for \r\nPublic Service and Agriculture \r\nNeill Cameron Vice President for Advancement \r\nAlmeda Jacks Vice President for Student Affairs \r\nScott Ludlow Chief Financial Officer \r\nDavid Stalnaker Executive Director of the Commission \r\non the Future of Clemson and Assistant to the President "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nSUSAN GOODWIN DELONY \r\nDOCTOR OF HUMANITIES \r\nEsteemed University leader for two decades, Susan Goodwin Delony was instrumental in \r\ndefining the social and educational cu lture of today's Clemson University. The \r\ncontributions she made to students, colleagues and the future of Clemson are immeas urable \r\nand resonate in the lives she personally touched and in those who never knew her but feel \r\nher impact today. \r\nDean Delony received her bachelor's degree in 1945 from Auburn University and her \r\nmaster's from Cornell University in 1951. She followed her formal education with summer \r\nstudies at Michigan State and the Teachers College of Columbia University. \r\nHer first appointment in Academe was as an instructor at the Woman's College of North \r\nCarolina, followed by assistant professorships at Montana State College and Auburn \r\nUniversity. Dean Delony became the assistant dean of women at Auburn in 1957 and \r\nremained there until l 963 when she was hired as the first dean of women at C lemson. For 14 \r\nyears, she served in this post and was late r promoted to assoc iate dean of students. \r\nWhen Dean Delony joined C lemson's ranks, there was a great need for programs, \r\nopportunities and facilities for women. (They had been admitted to C lemson on ly years \r\nbefore, in 1955.) Dean Delony met this cha llenge with resolve and passion. During her \r\ntenure, she was instrumental in the formation and development of the Residence H a 11 \r\nProgram for women and the Resident Assistant Program. In 1969, she brought national \r\nwomen's social fraternities to C lemson, establish ing the foundation fo r the successful Greek \r\nLife the University enjoys today. She helped found Alpha Lamba Delta freshman honor \r\nsociety as well as Mortar Board. President Emeritus Walter Cox has ca lled hiring Dean \r\nDelany \"one of the best recommendations 1 made in my tenure at C lemson.\" \r\nIn add ition co her ach ievements at the University, Dean Delany has provided \r\noutstanding se rvice to her community. While enjoying retirement in her birthplace of \r\nTuscumbia , Alabama, she retains active membership in her church and has served on a \r\nfeasibility study for the Consolidation Committee of Tuscumbia. She is past president of the \r\nMaud Lindsay Study Club, volunteer of the Tennessee Valley Art Association Guild and \r\nhas served and is currently on the Board of Friends of the Helen Keller Public Library. \r\nDean Delony has made it her life's work to establish a high standard of character and \r\nvision for all with whom she has contact. Her sp irit pervades the campus each and every day \r\nthe University thrives. le is with gre at honor and pleasure chat we recognize chis individual \r\nwho truly made a difference in the lives of students and of chis University during a critica l \r\ntime in its history. We hereby present Susan Goodwin Delony with the honorary Doctor of \r\nHumanities degree. "
    },
    {
        "page_number": "7",
        "text": "I \r\n' \r\nHONORARY DEGREE \r\nROBERT FRANCIS NOWACK \r\nDOCTOR OF LAWS \r\nAs a teacher, adviser, friend, confidant, colleague and mentor, Robert Francis Nowack \r\nepitomizes excellence. For over SO years, he has served C lemson University in numerous \r\ncapacities-from the Clemson Little Theatre to the Social Committee of Clemson \r\nCollege to being a charter member of Omicron Delta Kappa. He has contributed not only \r\nto Clemson University, but to tens of thousands of students who now define the cultural, \r\nsocia l and educational fabric of America. \r\nProfessor Bob Nowack, or P.B. as he is better known, received his bachelor's degree from \r\nCarnegie Mellon and a master's from the University of Pittsburgh. He also attended VP! \r\nfor post-graduate work. He began teaching at Clemson on September 1, 1948, and has been \r\nhere ever since. \r\nOnce referred to by President Emeritus Robert Edwards as \"one of the truly great \r\nteachers in Clemson's first century of service to mankind,\" P.B. has served under seven of \r\nl 4 presidents and has won virtually every award the University bestows. He was the first \r\nrecipient of the Byars Award for Teaching Excellence in Engineering Mechanics and the \r\nFrank F. Burtner Award for Advising. He has been a member of the Order of Athena \r\nChapter of Mortar Board National Honor Society, Tiger Brotherhood, Blue Key and Chi \r\nEpsilon. He's won the National Society of Professional Engineers Educator of the Year \r\nAward, Tau Beta Pi Eminent Engineer Award, Chi Epsilon Outstanding Teacher Award, \r\nRobert W. Moorman Award from Tiger Brotherhood, Algernon Sidney Sullivan Award \r\nand Master Teacher Award . In 1989 he was honored as an Alumni Distinguished Professor \r\nof Civil Engineering. \r\nAlthough highly decorated by official honors and awards, P.B. is best known for his \r\nteaching style, his relationship with students, his ability to befriend and father. He's been \r\nknown to spend five hours per day just talking with students in his office. He learns every \r\nstudent's name in his classes, so he builds a personal relationship with each one of them. \r\nThere are thousands of students who are inspired by his wisdom and achieve beyond their \r\nhopes because of his encouragement. As one colleague said, \"P.B. does more than educate \r\nstudents; he makes them better human beings.\" \r\nMaybe P.B.'s contributions are best summarized in the words of one of his students: \r\n\"What really sets you apart from other professors is your interest in each of your students as \r\nindividuals, not merely as students. Teachers who take chis kind of approach to students are \r\nthe ones who truly make a difference in shaping our lives.\" \r\nBecause of his dedication and genuine concern for students as well as his unsurpassed \r\nloyalty and SO-year service to Clemson University, we are honored to present Professor \r\nRobert Francis Nowack with the honorary Doctor of Laws degree. "
    },
    {
        "page_number": "8",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, \r\na senior faculty member, with the college bacon, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors chat \r\ndeclare the disciplines caught in chat college. These colors, which were established by the \r\nAmerican Council on Education, are as follows: \r\nCollege \r\nAgriculture, Forestry and Life \r\nSciences \r\nArchitecture, Arcs and \r\nHumanities \r\nBusiness and Public Affairs \r\nEngineering and Science \r\nHealth, Education and Human \r\nDevelopment \r\nLibrary \r\nScaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and Orange \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitecture \r\nArcs \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocial Sciences \r\nLibrary \r\nAcademic Support \r\nInstruction \r\nCollegiate faculty follow their marshal in order of academic rank wearing academic \r\ncostumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United Scates wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions a re \r\nspecified by a uniform code maintained by the American Council on Education. Caps are \r\nblack and are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels \r\nusually of metallic thread; ocher degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. O lder gowns have sleeves chat terminate at the elbow while \r\nchose since 1960 have sleeves extended co the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is co replace black ve lvet \r\nwith velvet in the discipline color. A second variation is a colored gown usually of the \r\nuniversity's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awarding \r\ninstitution. First, degree level is signified by the size of the hood with bachelors' sma ll est, \r\nmasters' larger, and doctors' quite large and of a different shape. Clemson does not award \r\nhoods co bachelors. The width of the velvet trim also conveys the degree. Secondly, the \r\ndegree is indicated by the color of the trim edging the hood co form the throat over the gown. \r\nThe most frequently seen is dark blue, which designates the doctor of phi losophy (Ph.D.) \r\ndegree. Finally, the color of the hood's lining specifies the awarding institution. The colors \r\nare displayed in combinations chat are drawn from heraldry. Notice chat the Clemson \r\nUniversity hood is lined with purple through which is an orange chevron (a \"V\"). Although \r\nmany combinations are duplicated by dozens of institutions, Clemson is presently the only \r\ninstitution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastica l, or military \r\nregalia as sec forth by their professions. They are preceded by the University Marshal. Clad \r\nin a gown of office in gold and purple, the marshal wears no hood and bears the University \r\nmace. Ac the ceremony's close, the faculty do not exit as a pare of the recessional but are \r\ndismissed, along with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "9",
        "text": "I \r\n' \r\nCANDIDATES FOR THE DOCTOR'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nApplied Economics Peter Christopher Melvin _____________________________ Winter Springs, FL \r\nB.S., Florida State Un iversity; M.A., C lemson Un iversity \r\nDissertation: Hedonic Prices of Golf Courses \r\nAdvisor: Dr. R. E. McCormick \r\nCrop and Soil Environmental Science Ligia Aura Bejac ________________________________ Bucharest, Roman ia \r\nB.S., University of Bucharest; M.S., Clemson University \r\nDissertation: McxlelingofWater Movement and Solute Transport in Disturbed and Undisturbed Soils \r\nAdvisor: Dr. V. L. Quisenberry \r\nEntomology \r\nDeborah Sheryl Bricklec----,---,-,----------------------------Branchville, SC \r\nB.S., M.S., Georgia Southern University \r\nDissertation: Optimization of Management Strategics for Lcpidopterous Pest in Transgenic B.t. Cotton \r\nAdvisor: Dr. S. G. Turnipseed \r\nHanping Lu Wuhan, China \r\nB.S., M.S., Huanzhang Agricultural University \r\nDissertation: Housefly (M usca domestirn L.) Management with Emphasis on the Facultacive Predat0r, Hydrataea aenescens, in \r\nPoultry and Swine Operations \r\nAdvisor: Dr. P. M. Horton \r\nEnvironmental Toxicology \r\nRyan Edward Casey ,-~-----~::-------------------------Mt Airy, MD B.S., Virginia Polytechnic Institute and Stace University \r\nDissertation: Rece iving Golf Course Runoff \r\nAdvisor: Dr. S. J. Klaine \r\nDaniel Jorey Karen---,-,::-,,-c---:-:cc--:------------------------Waccabuc, NY B.S., Emory University; M.S., College of Charleston \r\nDissertation: Sublethal Impact of Episodic Pesticide Exposures on Fundulus Heteroclitus \r\nAdvisor: Dr. S. J. Klaine \r\nCynth ia Sills Ropesvi lle, TX \r\nB.A., Case Western Reserve Un iversity; B.S., University of Idaho; M.S., Idaho Scace Un ivcrsi~y \r\nDissertation: Effects of Six Endocrine Disruptcrs and their Binary Mixtures on A merican A lligators (~ mississippiensjs), \r\nNorthern Bobwh ites (Colinus virgi ni,mys), and Deer Micc(Perornyscus maticulatus) \r\nAdvisor: Dr. R. L. Dickerson \r\nFood Technology \r\nAnju Rao ~----------------------------------Hyderabad, India \r\nB.S., M.S., Andhra Pradesh Agricultural University \r\nDissertation: Optimization and Characterization o( Membrane Proccs.sed Soy Protein Concentrate \r\nAdvisor: Dr. R. L. Thomas \r\nForest Resources \r\nChau-Chin Lin ----------------------------------Taipei, Taiwan B.S., National Chung Hsing University; M.S., Taiwan National University \r\nDissertation: An Integrated Model to Predict Human-Caused Forest Fire Danger in Taiwan \r\nAdvisor: Dr. W. E. Hammitt \r\nZicai Xu ,---,-,----,---c-,----~::--c-~-~::--------------------Harbin, C hina B.A., Inner Mongolia University; M.F.R., Northeast Forestry Unive rsity \r\nDissertation: Evaluation of Properties Associated with Bacterial Wetwood in Red Oaks \r\nAdvisor: Dr. F. H. Tainter \r\nMicrobiology \r\nRicky Lee Ulrich Daytona Beach, FL \r\nB.S., C lemson University \r\nDissertation: Identification, Cloning, and Sequencing of the Genetic Determinant Coding for the Proposed Lactacin B Inducer \r\nProtein and Partial Characterization of the Lactobacillus Delbrueckii ssp. Lactis ATOC 4797 Genome by Shotgun Cloning \r\nand Sequencing \r\nAdvisor: Dr. T. A. Hughes "
    },
    {
        "page_number": "10",
        "text": "Plant Pathology \r\nSuat Yilmaz lsparta, Turkey \r\nM.S., Oklahoma State University \r\nDissertation: Development of Non~Radioactive Detection Methods for the Genomic RNAs of Ilarvi ruses chat Cause Disease in \r\nPeach and Their Use in Studying the Molecular Basis of the Synergistic Interaction between Prunus Necrotic Ringspot Virus \r\nand Prune Dwarf Virus \r\nAdvisor: Dr. S. W. Scott \r\nZoology \r\nJody Matthew Myers Eunice, LA \r\nB.S., M.S., Louisiana State University and A&M College \r\nDissertation: Studies on the Secretory Epithelium of the Mantle from the Eastern Oyster, Crassostrea Virginica, in Re lacio n to \r\nShell Formation \r\nAdvisor: Dr. A. P. Wheeler \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nDOCTOR OF PHILOSOPHY \r\nIndustrial Management \r\nAlan Russell Cannon G reenville, SC \r\nB.S., M.B.A., C lemson University \r\nDis.serration: Environments, Strategies and Manufacturing Flexibility-A Contingency Theory and An Empirical Test \r\nAdvisor: Dr. C. H. Sc. John \r\nLoretta Ferguson Cochran ______________________________ Pottsville, AR \r\nB.S .• Erskine College; M.S., Clemson University \r\nDis.serration: Linking Corporate Goals and Shop Floor Performance \r\nAdvisor: Dr. J. W. Patterson \r\nlndustriaVOrganizational Psychology Thomas Lloyd Killen _________________________________ Easley, SC \r\nB.S .• Wofford College; M.S., Clemson University \r\nDissertation: The Effect of Incentives to Fake on Personality Test Responses \r\nAdvisor: Dr. F. S. Switzer \r\nErica Lynn Lagasse __________________________________ Tampa, FL \r\nB.A .. University of South Florida; M.S., Clemson University \r\nDissertation: Policy Capturing of Appe llate Level Sexual Harassment Court Cases \r\nAdvisor: Dr. F. S. Switzer \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nChemical Engineering \r\nPatrick Christopher Joyce ______________ _________________ Dumont, NJ \r\nB.S., M.S., Manhattan College \r\nDissertation: Vapor-Liquid Equilibria for Long-Chain Hydrocarbons in Supercritical Alkane Solvents \r\nAdvisor: Dr. M. C. Thies \r\nChemistry \r\nLois Elizabeth Nice Jersey Shore, PA \r\nB.A., Lycoming College \r\nDissertation: Preparation and Reaction of Alpha-Aminoalkyl Copper Reagents with: ( I ) Alpha, Beta-Unsaturated Enones/Enals, \r\nand (2) Propargyl Substrates \r\nAdvisor: Dr. P. K. Dieter \r\nHarry Whittier Rollins Charleston, SC \r\nB.S. C lemson Un iversity \r\nDissertatio n: Preparation and Characterization of Nanoscale Materials \r\nAdvisor: Dr. Y. P. Sun \r\nCivil Engineering \r\nJinxia Chen Fujian, China \r\nB.S., Shanghai Jiaocong University; M.S., Zhejiang University \r\nDissertation: Risk-Based Liquefaction Potential Evaluation Using Cone Penetration Tests and Shear Wave Velocity \r\nMeasurements \r\nAdvisor: Dr. C. H. Juang \r\nMihail Grigore Chiru-Danzer Harrison, NJ \r\nB.S., Rensselaer Polytechnic Institute \r\nDissertation: Estimation of Liquefaction-Induced Vertical and Horizontal Displacements Using Artificia l Neural Networks and \r\nRegression \r\nAdvisor: Dr. C. H. Juang "
    },
    {
        "page_number": "11",
        "text": "Civil Engineering (continued) \r\nZhigang Huang..,..:-----,--c-=--:::--:---:-:------------------------- Zibo, China B.S., Tongji University, M.S., Tsinghua University \r\nDissertation: Stochastic Mcx:fels for Hurricane Hazard Analysis \r\nAdvisor: Dr. D. V. Rosowsky \r\nElectrical Engineering \r\nYi-Qun Jiang --,----,-.,..,----=-=--=--:--:--------------------- Duluth, GA B.E., M.E., National University of Defense Technology \r\nDissertation: 30 Vector High·Order Finite Element Modeling for Doubly Periodic Structures \r\nAdvisor: Dr. A. 0. Martin \r\nAlp Kustepeli __________________________________ .Istanbul, Turkey \r\nB.S., Istanbul Technical University; M.S. 1 Clemson University \r\nDissertation: Analysis and Implementation of the Erna Id Method for Waveguide and Cavity Structures \r\nAdvisor: Dr. A. 0. Martin \r\nClint Simmons Wilkins _______________________________ Blacksburg, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Adaptation of Ccxie Rate and Transmitter Power in Frequency•Hop Communication \r\nAdvisor: Dr. M. B. Pursley \r\nEngineering Mechanics \r\nAndrzej Tadeusz Baranski ____ :--------------------------Krakow, Poland \r\nB.S., Cracow University of Technology \r\nDissertation: Postbuckling Analysis o( Laminated Composite Plates with Damage \r\nAdvisor: Dr. S. B. Biggers \r\nEnvironmental Engineering and Science \r\nSilong Lu Clemson, SC \r\nB.E., Hohai University; M.E., Institute of Water Conservation \r\nDissertation: Stochastic Fractal Characterization and Representation o( Sub·Surface Hydraulic Conductivity Distributions and \r\nFluid Flow and Transport in Fractal Porous Media \r\nAdvisor: Dr. F. J. Molz \r\nlndustrial Engineering \r\nXingang Cheng---------------------------------- Henan, China B.S., Harbin College of Shipbuilding Engineering; Ph.D., Chinese Academy of Sciences \r\nD1~scrtatton: A Markov Decision Process Approach to R & D Project Planning \r\nAdvisor: Dr. D. L. Kimbler \r\nMathematical Sciences \r\nPaul Trianta(i!os Hadavas Swarthmore, PA \r\nB.S., Camegie·Mellon University; M.S., Clemson University \r\nDissertation: Exploiting Network Substructures and Persistency in Solving O·l and Genera l Nonconvex Optimization Problems \r\nA<lv isor: Dr. W. P. Adams \r\nLin<la Grayne l Lawson ________________________________ Cuthbert, GA \r\nB.S., M.S., University of Georgia \r\nDi:;scrtarion: Dynamic Programmmg Based Leaming Methods Using Multigrid \r\nAdvisor: Dr. J. K. Peterson \r\nBernd Schandl ------------------------------- Nieder-Olm, Germany \r\nDipl., University of Kaiserslautern \r\nD1ssertatton: Norm·Based Evaluation and Approximation in Multicriteria Programming \r\nAdvisor: Dr. M. M. Wiecek \r\nMechanical Engineering \r\nXian Chang Li -------------------------------Hebei Province, China B.S., M.S., Tsinghua University \r\nl11~crrnt1on: CCX>ling by a Misc/Steam Jet \r\nAdv1Sor: Dr. J. L. Gaddis \r\nYugang Li ___________________________________ Shenyang, Ch ina \r\n8.E., M.Engr., Tianjin University \r\nDissertation: Adaptive Vibration Isolation Control for Continuous Systems \r\nA<lvisor: Dr. C. D. Rahn \r\nSunder S. V. Vaduri ____ ~~--------------------------Hyderabad, India 8.E., Osmania University; M.S., Clemson University \r\nD1ssemmon: Development of Computer TCX>ls for Analysis of Track Test Data and for Prediction of Dynamic Handling Response \r\nfor Winston Cup Cars \r\nAdvisor: Dr. E. H. Law \r\nPhysics Tunothy Richard Marshall ______________________________ Dahlonega, GA \r\nB.S., North Georgia College and State University \r\nDissertation: Investigations of High Latitude Wind Shears in the Lower Thermo.sphere \r\nAdvisor: Dr. M. F. Larsen "
    },
    {
        "page_number": "12",
        "text": "Physics (continued) \r\nLeifZebediah Scheick--,-,..,,...-cc-,----,-,------------------------- Nashville, TN B.S., Wofford College; M.S., Clemson University \r\nDissertation: Famos Transistor Spectroscopy and Microdosimetry \r\nAdvisor: Dr. P. J. McNulty \r\nTextiles, Fiber and Polymer Science Jiefeng Yu __________ ....,.. _________________________ FuJian, China \r\nB.S., M.S., China Textile University-Shanghai \r\nDissertation: Study of Yarn Package Residual Tension During Over·End Unwinding \r\nAdvisor: Dr. B. C. Goswami \r\nCOLLEGE OF HEAL TH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF EDUCATION \r\nVocational and Technical Education Wells Blakeslee Doty _________________________________ Salem, SC \r\nB.S., M.S., United States Naval Academy \r\nDissertation: Personality Types and Traits as Academic Success Predictors \r\nAdvisor: Dr. J.M. Leininger \r\nShelly Lin Schwartz Weatherford, TX \r\nB.S., Tarleton State University; M.A., University of Texas Southwest \r\nDissertation: The Effect of Implementation of a Voice Messaging System on Student Perception of Interaction and Satisfaction in \r\nTclecourses \r\nAdvisor: Dr. G. G. Lovedahl \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction Vick, Jean Phillips _________________________________ Walhalla, SC \r\nB.A., Winthrop University; M.Ed., Clemson University \r\nDissertation: The Effects of a Math Recovery Program: A Comparative Study \r\nAdvisor: Dr. W. H. Leonard \r\nEducational Leadership \r\nKatherine S. Sparks Lavonia, GA \r\nB.A., Berry College; M.Ed., Clemson University \r\nDissertation: Flagship Teachers for the 21' Century: A Profile of Behaviors and Values Which Exemplify Excellent Teachers \r\nAdvisor: Dr. D. L. Fuhr \r\nKenneth Harry Weichel Centra l, SC \r\nB.A., M.Ed., Clemson University \r\nDissertation: An Investigation of the Impact of School C ulture on the Relationship Between South Carolina Elememtary Schools \r\nand School Effectiveness \r\nAdvisor: Dr. D. L. Fuhr \r\nParks, Recreation, and Tourism Management \r\nDorochy Margaret Chase Clearwater Bay, Ontario \r\nB.A., University of Winnipeg; M.Ed., Lakehead University \r\nDissertation: Sense of Place: Resident and Visitor Assessments of a Tourism Destination Arca Thunder Bay, Ontario, Canada \r\nAdvisor: Dr. G. W. Burnett \r\nRobert Wilson Dye, Jr. Brevard, NC \r\nB.S., Western Carolina University \r\nDissertation: Differentiating Between Private and Commercial Recreational Boaters on the Chattooga Wild and Scenic River; A \r\nDiscriminant Analysis \r\nAdvisor: Dr. G. W. Burnett \r\nKaren Paisley Hurtes ________________________________ Landcnberg, PA \r\nB.S., The American University; M.S., Clemson University \r\nDissertation: The Development of a Measure of Resiliency in Youth for Recreation and Other Soc ial Services \r\nAdvisor: Dr. L. R. Allen \r\nWilliam Lewis Obenour \"-=--~----,,-~~-~---,-----------------Pittsburgh, PA B.S., Indiana University of Pennsylvania; M.S., Bowling Green State University \r\nDissertation: Understanding the Hermeneutis Meaning of the \"Journey\" in Travel and Tourism \r\nAdvisor: Dr. F. A. McGuire "
    },
    {
        "page_number": "13",
        "text": "I \r\nI \r\n' \r\nI \r\nf \r\nCANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nGwendolyn Cummings McPhail _____ Seneca, SC \r\nMASTER OF FOREST RESOURCES \r\nMadison Peyton Howell Ill _____ Mt Pleasant, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nAbdullah Naci Dogrul ________ Ankara, Turkey Ferdinand Dimaculangan Vinuya _________ _ \r\nAvinash Noe l Kessop C::ilcucta, India -------------Nueva Elija, Philippines \r\nAnimal Physiology \r\nJessica Lee Hall -,-,----------Charlotte, NC Kimberli Paige Yonce _________ Johnston, SC \r\nAndrea Marie Parkhurst Frederick, MD \r\nAquaculture, Fisheri es, and Wildlife Biology \r\nTamara McCoy Koldyke Seneca, SC \r\nBiochemistry \r\nDiana Marie Rugh _______ Falls Church, VA \r\nBotany \r\nNathan Deas Missel _______ Summerv ille, SC \r\nCrop and Soil Environmental Science \r\nLori Ann Duis __________ Virginia Beach, VA Johnny Thorton Staples, Jr. ________ Aynor, SC \r\nEnvironmental Toxicology \r\nAmy Leigh Bohannon Yorktown, VA \r\nForest Resources \r\nJoseph Wi ll iam Albiston ________ Altavista, VA Gregory Paul Smith ________ Cannonsburg, PA \r\nGenetics \r\nLaTonya Tymcrria Jones _______ Spartanburg, SC Francisco Romero~Pastrana _______ Puebla, Mexico \r\nMicrobiology \r\nDavid Enrique Correa ---------Suffern, NY C lyatt Elise Drakeford _________ _cSumter, SC \r\nMelan ie Patricia Dautle Cherry Hill, NJ Jannet Katherine Romero Simpsonville, SC \r\nMelanie Dawn DcCock Eldridge, IA \r\nNutrition \r\nCheryl Lynn Hooper ________ Naperville, IL \r\nPlant Pathology \r\nPayungsak Rauyarce Pathumthani, Thailand \r\nZoology \r\nJames Brent Vamadoe ________ Sumter, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nMASTER OF ARCHITECTURE \r\nJcannye La Verne Dudley ________ Atlanta, GA Heather Annette Lentz _________ Walhal\\a, SC \r\nMichael Allan Gaffney Charlotte, NC Patricia Dilger Newell Greenville, SC \r\nJustin Morgan Hughes Glen Dale, WV Hilary Grace Stevens Orlando, FL \r\nMASTER OF CITY AND REGIONAL PLANNING \r\nHilary Grace Stevens Orlando, FL \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nOmur Ehliz ____________ Kayseri, Turkey Yesim Uner ____________ Istanbu\\, Turkey \r\nKenneth P,1ul Flower New Orleans, LA William Taft Wirthlin Greenv ille, SC \r\nPaul Lynn Lavanish Sumter, SC Viswanadhan Raja Yallayi Andhra Pradesh, India \r\nSuz::i.n Ozkinay Istanbul.Turkey \r\nMASTER OF FINE ARTS \r\nCecilia Frederic Hendersonville, NC "
    },
    {
        "page_number": "14",
        "text": "MASTER OF ARTS \r\nEnglish \r\nKaren Ann Gentry.,,....,-------- Bishopville, SC John Kwist, Jr. __________ Summerville, SC \r\nDeborah Veronica Holmes Wellford, SC \r\nHistory \r\nJohn Angus Marcin __________ Brooklyn, NY Gregory J. Verhovshek ---------- York, PA \r\nProfessional Communication \r\nAubrae Ann Wagner Greenville, SC \r\nMASTER OF SCIENCE \r\nArchitecture \r\nMaria Mercedes Posada----- Bogota, Colombia \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nMASTER OF BUSINESS ADMINISTRA T!ON \r\nJoseph Charles Amell _________ Greenville, SC Julie Anne Lewis---------- Tallahassee, FL \r\nGreg Alan Bowen Moore, SC Elizabeth Lohr Longshore Greenwood, SC \r\nHeather Marie Brooks Greenville, SC Whitney Tillman Marcengill Greenwood, SC \r\nVicky Burgess Bryant Greer, SC Virginia Miller McManis Greenwood, SC \r\nGalen Eben Burdeshaw Greenville, SC Brian Allen Novatny Cleveland, OH \r\nKaren Cothran Cannon Greenville, SC Terry Andrew Redmile Greenville, SC \r\nJose Gerardo Capello Campinas, Brazil Charles Anderson Rose, Jr. Greenville, SC \r\nMichael Lyn Couch Greenville, SC Vishal Pramod Shah Clemson, SC \r\nStacey Eichmeyer Couch Greenville, SC Randy Robert Sorenson Racine, WI \r\nMichele Ann Ensor Atlanta, GA Rowdy Dee Teague Newton, NC \r\nScott Brian Freese Naperville, IL Jeffrey James Tewell Seneca, SC \r\nBruno Josef Hartmann Bavaria, Germany Michelle Ann Toporski Simpsonville, SC \r\nEric Robert Hendrickson Richmond, VA Daniel Lee VonDielingen Sparta nburg, SC \r\nRandolfG. Hernandez Turrialba, Costa Rica Ting Xie Beijing, China \r\nKeith Allen King Zanesville, OH \r\nMASTER OF PROFESSIONAL ACCOUNTANCY Gregory Allen Lewis ___________ Greer, SC Lee Elizabeth McConnell ________ Greenville, SC \r\nAshley Mauldin Pickens, SC Rebekah Lee Truesdale Kershaw, SC \r\nMASTER OF PUBLIC ADM!NISTATION \r\n(Master of Public Administration is jointly administered by Clemson University and the University of South Carolina.) \r\nChristopher David Eldridge _______ = Pickens, SC James Alexander Wiggins ________ Marion, SC \r\nMatthew Robert Streger Westwood, NJ \r\nMASTER OF ARTS \r\nEconomics \r\nAnja Geissler ___________ Essen, Germany Kristina Terkun ___________ Chantilly, VA \r\nMASTER OF SCIENCE \r\nApplied Psychology \r\nJoseph Christopher Jenkins _______ Greenville, SC Janet Achenbach McCarcen _______ Carmel, NY \r\nIndustrial Management \r\nHartmut A. H. Peters Greenvi lle, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCivil Engineering \r\nRobert Eric Burgess Chester, SC \r\nElectrical Engineering \r\nDominic John Ruffolo Somerdale, NJ \r\nMASTER OF SCIENCE \r\nBioengineering \r\nIshmael Bentley II _________ Owingsville, KY Michael K. McRoberts ________ Greenwood, IN \r\nLeigh Anne Boros Austell, GA Jeffrey Eugene Mega Anderson, SC \r\nCindy Demian Columbia, SC Anupama Vinod Sarma C lemson, SC \r\nKory Patrick Hamel Prior Lake, MN Glenn Anthony Stiegman Ill Greenville, SC \r\nMatthew Martin Holecko II Youngstown, OH "
    },
    {
        "page_number": "15",
        "text": "Biosystems Engineering \r\nWelch McNair Bostick Greenville, SC \r\nCeramic Engineering \r\nChristopher Byron Chesmut _____ c--c--,-Conway, SC Honggu Jiang ___________ Shanghai, China \r\nPeter James Fernstrom North Augusta, SC Nisanart Navapan Bangkok, Thailand \r\nChemical Engineering \r\nMark Edward Beauhamois _______ 7 Lockport, NY Shiraz Yakub Sheikh--------- Columbia, SC \r\nJeffrey L. Meece Cincinnati, OH Justin Edward Wince Anderson, SC \r\nChemistry \r\nLiyana P.D.N.K. Abayasinghe ______ Clemson, SC James Duncan McClellan _________ Sellers, SC \r\nCivil Engineering \r\nJ,anhua Guan-,---------- Shandong, China Mark Joseph Radicchi -------Johnson City, NY \r\nBrian John Michot Moreauville, LA Brett Jackman Whitin Columbia, SC \r\n' Paul Roland Moore Beaufort, SC Bradley S. Williams Easley, SC \r\nJohn Regan Prince Greenwood, SC \r\nComputer Science \r\nAndreas Gerd Arens----- Maring·Noviand, Germany Vikas Saraogi ____________ Gwalior, India \r\nMark Allen Bever Greenville, SC Vadivel Rajkumar Sreedar Tamilnadu, India \r\nMichael Joseph Bever Greenville, SC Krishnan Sridhar Madras, India \r\nThomas W. Crumpton Pickens, SC XiaorongTai Beijing, China \r\nKevin David Guthrie Fountain Inn, SC Sujani Viswanathan Chatham, NJ \r\nNualsawac Hiransakolwong Bangkok, Thailand Xianting Xu JiangXi, China \r\nManoj Bhaskaran Nair Nagpur, India Ling Zhang Shanghai, China \r\nJeffrey Mark Russo Atlantic City, NJ Sheng Zhang Shan Dong, China \r\nElectrical Engineering \r\nFrederick Joseph Block IV _______ Charleston, SC Pradeep Swethadri Setlur _______ Bangalore, India \r\nYen-Chin Chen Taipei, China Choosak Taveekitikun Songkla, Thailand \r\nDurgesh Padmakar Manjure Bombay, India Jeffrey Scott Wysocarski Rochester, NY \r\nSachin D. Sapte Mumbai, India Zhixian Xiang Guangdong, China \r\nEngineering Mechanics \r\nPrapot Kunthong Bangkok, Thailand \r\nEnvironmental Engineering and Science \r\nKimberly Ann Davis __________ Aiken, SC Stacey Heyward Subcr ________ Simpsonville, SC \r\nJohn Russell Hackett Beavercreek, OH Roland Dirk Thierbach Niebuell, Germany \r\nSigit Rcliantoro West Java, Indonesia Marc Raymond Woodworth Augusta, GA \r\nHydrogeology \r\nCrystal Ann Mattox -------- Fort Mill, SC \r\nIndustrial Engineering \r\nSaikatGoswami __________ Serampore, India Jatin P. Thaker __________ Hyderabad, India \r\nRobert Francis Lemon Il l Merritt Island, FL Paresh S. Vakhariya Clemson, SC \r\nArun Kumar Sriraminen i Clemson, SC \r\nMaterials Science and Engineering \r\nJmnling Li-.,------------, Hunan, China Matthew Lee Williams _______ White Springs, FL \r\nDeepak Pingalay Bangalore, India \r\nMathematical Sciences \r\nJeffrey Bryan Farr __________ Greenville, SC Jason Keith Martin Georgetown, SC \r\nDavid Cletus Gillen Austin, TX Christopher Crevensten Woodard ____ Spartanburg, SC \r\nJennifer Marie LaVare Rotterdam, NY Mary Katherine Zachary Atlanta, GA \r\nMechanical Engineering \r\nKmhnad1tya Goutham Arkalgud Bangalore, India Shane Rabun Martin _________ ~ Pauline, SC \r\nMark Anderson Eley White Plains, GA Guang Yang Beijing, China \r\nChmtopher Errington Granger __ Hilton Head Island, SC \r\nI \r\nf \r\nPhysics \r\nJ,nze Dai_c--::------------,Gansu, China Michelle Renee Stanley-------- Florence, SC \r\nSanjib Shankar Gupta Calcutta, India Korkut Yegin Tekirdag, Turkey \r\nAnJre Jacobus Muis Greenville, SC \r\nTextile Science \r\nDan Liu ___________ Nanchang, China \r\nTextiles, Fiber and Polymer Science \r\nK;mitrn Asv.1hem__,...,,...-------Sathorn, Thailand Ying Huang ___________ Shanghai, China \r\nChristopher Michael Barr Spartanburg, SC "
    },
    {
        "page_number": "16",
        "text": "COLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\nSonya Vanes.sa Barnett --------cc-Elberton, GA Diane Merritt ____________ Canon, GA \r\nJane W. Franks Clarkesville, GA Jackie Stancil Morgan Eastanollee, GA \r\nCharlotte Rice Harper Hartwell, GA \r\nMASTER OF HEAL TH ADMINISTRATION \r\n(Master of Health Administration is jointly admin istered by \r\nClemson University and the Medical Un iversity of South Carolina.) \r\nCardell Elisha Shortt Laurens, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nKelly Ann Broome_~~------- Anderson, SC \r\nMandie Colette Campbe ll Anderson, SC \r\nRobin Dorothea Jackson-------- Anderson, SC \r\nJane Elizabeth Kasoff Fairfax, VA \r\nJennifer Rebecca Diak Fort Mill, SC Leslie Nicole Murch Greenv ille, SC \r\nKory Camelia Epps Lake City, SC Heather Caroline Orr Cheraw, SC \r\nGretchen Elizabeth Golden Simpsonville, SC Michael Wallace Pitts Seneca, SC \r\nChris John Hallin Chaska, MN Angela Hope Ridings Spartanburg, SC \r\nDanny Lewis Hammond Lexington, SC Celeste Ray Scott Charleston, SC \r\nAmanda Kellie Harripaul Newtown, PA Bruce Allen Smith Travelers Rest, SC \r\nEric David Hellman Simpsonville, SC Patricia Anne Trent Greenv ille, SC \r\nSherry J. Herring Fort Myers, FL Tina Evette Collins Woodard Gainesville, GA \r\nReagan Kathleen Hutson Greer, SC Amanda Kei Wright Powdersville, SC \r\nMASTER OF INDUSTRIAL EDUCATION \r\nG lenn Alan Doherty _________ Pa lo Alto, CA Andrew Thomas Long _________ Clemson, SC \r\nEdward Eugene Grant Anderson, SC Madhura Nataraj Clemson, SC \r\nHeath Jason Lindsey LaPlata, MD Michelle Rae Spitzinger Upper Marlboro, MD \r\nCrystal Ellison Lominick Pomaria, SC \r\nMASTER OF PARKS, RECREATION, AND TOURISM MANAGEMENT \r\nZuna Mansoor Karachi, Pakistan \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nAlexander Cummings--------- Mauldin, SC Penny Spell Knight _________ Simpsonville, SC \r\nJeanne Coker Dav is Hayesville, NC Krista Leigh Randall Seneca, SC \r\nGary Scott Dixon Walhalla, SC Sharon Lynne Ross Seneca. SC \r\nMichelle Richey Grant Seneca, SC David Lynn Smith Greer, SC \r\nRobe rt Warren Hammond Anderson, SC Michael Kent Stroud Newberry, SC \r\nMichael Douglas Hughes Piedmont, SC Anthony Ware Anderson, SC \r\nCounseling and Guidance Services \r\nGwendolyn Elaine Anderson ______ Greenville, SC Robin Gayle Hagy---------- Anderson, SC \r\nMarsha Denise Berry Greenville, SC Mikelle Renee Hicks Greenvi lle, SC \r\nJan Leigh Blake Whitehall, PA Gail Sittmann Hoffman Greenvi lle, SC \r\nPaula Childs Chandler Greenville, SC Mary Elizabeth Lusk Anderson, SC \r\nKancy Tucker Cleveland Easley, SC Vicki W. Miller Seneca, SC \r\nLarene Nott Cruickshank Mauldin, SC Tiffany F. Peters C lemson, SC \r\nSteven Douglas Dean Belton, SC Larry Drew Printz Toccoa, GA \r\nCarrie Brooke Duggan Gainesville, GA Angela Gail Salyer Whittier, NC \r\nKelly Melinda Fanning Houston, TX Lesley Michelle Sexton Anderson, SC \r\nMary Beth Green Clemson, SC James A. Wright Seneca, SC \r\nElementary Education \r\nElizabeth Milhous _________ Germantown, MD Earnestine Robinson Williams------- Mullins, SC \r\nPamela Masters Putnam Six Mile, SC \r\nReading \r\nSuzanne Dupree Collins ________ Kennesaw, GA C rystal Lynn Martin --------- Anderson, SC \r\nAngela Sullivan Garrett Seneca, SC Beth Marie Radford Aiken, SC \r\nGeorgclyn Synethia Martin Jeter Rock Hill, SC Barbara Seawright Wagher Greenville, SC \r\nSecondary Education \r\nKimberly Sue Eish ----------Columbia, SC Cynthia H. Parker ___________ Seneca, SC \r\nMiriam Srone Johnson Anderson, SC \r\nSpecial Education \r\nJeanne Mi ller Hughes --------- Lavonia, GA Nathan Cole Stephens _________ Seneca, SC \r\nSusan Salena Smith Easley, SC \r\nMASTER OF SCIENCE \r\nNursing \r\nLinda Elaine Conn _________ Republic, OH \r\nParks, Recreation, and Tourism Management \r\nTiffany Joy McClinton Clemson, SC "
    },
    {
        "page_number": "17",
        "text": "I \r\n' \r\nI \r\nf \r\nCANDIDATES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCE \r\nWILLIAM BUSSE WEHRENBERG, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\nAmy Rosetta Gray _________ Woodstown, NJ Erin Marie Lynch __________ Scarborough, ME \r\n*Russe ll Jacey Kiefer, Jr. Westerville, OH Laura Elizabeth Profit Highlands Ranch, CO \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nSteven Scott Bolt __________ Orangeburg, SC John Tazwell Patton __________ Woodruff, SC \r\nAlison Monroe Gogue Logan, UT Tilden Frederick Riley IV Orangeburg, SC \r\nHugh Comer Morrison Yemassee, SC David McCarver Segars Hartsville, SC \r\nAgricultural Mechanization and Business \r\nCharles Herman Andrews IV _______ Sumter, SC Jason Lynn Rodgers ___________ Ward, SC \r\nSamuel Courtney McGee Greenville, SC Zachery Scott Tolley Ward, SC \r\nAnimal and Veterinary Sciences \r\nCassandra Lynn Carnes _________ Aiken, SC Annmarie Patrice McAuley ___ Westhampton Beach, NY \r\nEmily Elizabeth Chaplin _ Hartsville, SC Kelley Annette McPhail Seneca, SC \r\nNicola Gaile Gooden Columbia, SC Clark Jaudon O'Neal Johnston, SC \r\n**Laura Elizabeth Huckabee Lexington, SC Tonya Kale Riser Anderson, SC \r\nMartha Bruce Leath Chapin, SC \r\nAquaculture, Fisheries, and Wildlife Biology \r\nJonathan Andrew Batson-------- Pickens, SC Marion Derrick Myers _________ Bowman, SC \r\n**Elizabeth Ann Ciuzio Tampa, FL Charles William Rush Greenwood, SC \r\n*Jason Rory Derrick Leesville, SC Jessica Elizabeth Simmons Aiken, SC \r\nMatthew Droze Garrett C lover, SC Kenneth Lynn Tootle, Jr. Beaufort, SC \r\nJason Bradley Hart Summerville, SC Garland Ray Wilkie Ill Laurens, SC \r\nMatthew Smith Holstein Chapin, SC Travis Wood Wilson Boiling Springs, NC \r\nBiochemistry \r\nWilliam John Berglind _______ Greenville, SC \r\nBiological Sciences \r\nGregory Richard Brownlee ______ Simpsonville, SC Jenny Elizabeth Michi ________ Mt Pleasant, SC \r\nJerbrena Latrice Carter Myrtle Beach, SC +**Wendy Lynn Moreland Palm Harbor, FL \r\nE. Owen Cox, Jr. Mt Pleasant, SC Melissa Ann Paulk Columbia, SC \r\nSteven Lawrence Czarsty, Jr. Fredericksburg, VA Courtney Leigh Rawlings Bethel Park, PA \r\nStan ley Wayne Darnell Piedmont, SC Wanda Lynette Seymour Sumter, SC \r\nMegan Ducate Columbia, SC *Addy Antley Smoke Decatur, AL \r\nFaith Demetria Geiger Mt Pleasant, SC **Elizabeth Lee Stokely Irmo, SC \r\nLiza Corrine G rant Westminster, SC *Veronica Torres Beaufort, SC \r\n*Russell Leon McElveen Florence, SC \r\nForest Resource Management \r\nPaul Baxter Beeson ---------- Marion, SC *Kristen Michelle Phillips Toccoa, GA \r\nJacob Horres Brown Newberry, SC **Karl Jerome Pokorny Hagerstown , IN \r\nSunburst Shell Crockett Charleston, SC Robert H. Purvis Summerton, SC \r\n**Harry Howard Crosby Ill Summerton, SC Kyle Daniel Ratliff Florence, SC \r\nAngie Marie Culler Sandy Run, SC Abena Naya Scott Bowman, SC \r\nMorgan Wells Drakeford Sumter, SC Adam Frederick Scull Rock Hill, SC \r\nC lay Hunter Folk Green Pond, SC Levi Walter Smith IV North Augusta, SC \r\nValentijn Hoff Long Creek, SC Travis Douglas Spa inhour West Columbia, SC \r\nC had Tindal Lowder St Matthews, SC Frederick Brown Taylor Anderson, SC \r\n***Robert Bazil Mathes Valparaiso, IN Christopher Blake Towne Charleston, SC \r\nMatthew Allen McCall Florence, SC John Phillip Truesdell Charleston, SC \r\nBenjamin Jackson McNeel Mt Pleasant, SC Benjamin Seabrook Whaley, Jr. ___ Wadmalaw Island, SC \r\nDouglas Ryan Mills Lex ington, SC Todd Lewis Woody Rocky Mount, VA \r\nCharles Eugene Odell Ladson, SC \r\nHorticulture \r\nCollin Fredric Buckner _ ________ Chesnee, SC Gary William Scott ________ Yonges Island, SC \r\nForrest C lay Carter Westminster, SC Sara Adams Sightler Greenville, SC \r\nJames McIntosh Dargan Darlington, SC Adrienne Virginia Smith Clemson, SC \r\nTanya Arflin Massey Anderson, SC Bradley James Stober Akron, OH \r\nJoshua Harlon Reed Hopkins, SC Adam Warren White Clinton, SC \r\nKevin Reed Rockville, MD Randall Scott Wilhelmson Central, SC \r\n*Mary Elizabeth Reitmeier South Wales, NY Michael Calvin Young, Jr. Joanna, SC "
    },
    {
        "page_number": "18",
        "text": "Medical Technology \r\nKimberlee Pranee Banks _______ ----=_Cheraw, SC Amy Elizabeth Davis _________ Greenwood, SC \r\n*Kimberly Ann Clifton Greenwood, SC Stacey Renee Wallace Cheraw, SC \r\nMicrobiology Jeffery Wesson Dale ___________ Seneca, SC Dwyane Robert Suber __________ Saluda, SC \r\nChristopher Court Lapish Greenville, SC Richard Leo Tallier Florence, SC \r\nGabriel Mitchell McAlister Hartsville, SC Roberta Lee Taylor Belton, SC \r\nGenie La Von Parker Hartsville, SC Bryan Robert Young Bishopville, SC \r\nPackaging Science \r\nWilliam Randall Adams -------cc-_ Jackson, SC *Christine Marie Schwanda _____ Watkinsville, GA \r\nMichael Brandon Barker Ravenswood, WV Scott Elliott Shelley Green Sea, SC \r\nIvan Stewart Brewington Lancaster, SC •••Trisha Anngelique Uhrick Columbus, OH \r\nJonathan Tyler Hayes Greenv ille, SC Robert Bradley Walker Aiken, SC \r\nBenjamin Scott Reel Greenville, SC Joshua Allen Woods Myrtle Beach, SC \r\nSteve Benjamin Rowland Greer, SC \r\nPre .. Professional Studies \r\nTeresa Lynn Johnson Charleston, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nJAMES FRAZIER BARKER, Dean \r\nBACHELOR OF FINE ARTS \r\n•Kristina Marie Homewood------- Columbia, SC Joshua Paul David Schaffer ________ Sc Paul, MN \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\nLucius Moore Cline IV ________ Greenville, SC Jason Michael Whinghcer _______ Beech Island, SC \r\nBACHELOR OF ARTS \r\nDesign \r\nLeKeith Anshorn Bufford ________ Westville, SC Renee Heather Richardson _____ Kennett Square, PA \r\nEnglish \r\n*Rona ld Bahij Baroody, Jr.------,,-.,,- Florence, SC Christopher Brandon Nixon _______ Dansville, NY \r\nAudrey McCants Compton Sullivans Island, SC Charles Walton Pesavento Folly Beach, SC \r\nAmanda Jane Farish Darlington, SC Elizabeth Kate Reid Mc Pleasant, SC \r\nPamela Denise Goldson Sumter, SC Otis Randolph Taylor, Jr. Columbia , SC \r\nJamie Jo Anne Huggins Williston, SC Walter Gray Tiller Georgetown, SC \r\nTimothy O'Neill Lewis Baltimore, MD Michael David Wade Six Mile, SC \r\nEric C. McGovern Columbia, SC Dawn Margaret Wheeler Saluda, SC \r\nHistory \r\n*David Christopher Caughman -----Columbia, SC Charles Archibald Kernaghan _____ ,Mc Pleasant, SC \r\nJames Kenneth Cluverius, Jr. Richmond, VA Robert Keith Nelson Elgin, SC \r\n***Lisa Lorraine Devereux Central, SC **Vincent Charles Northcutt Mt Pleasant, SC \r\nWilliam Stanley Dixon Ill Greensboro, NC Ronald Wyatt Simmons Pickens, SC \r\nNicholas Scott Elliott, Jr. Anderson, SC \r\nLanguage and International Trade \r\nJonathan Andrew Blume ________ Columbia, SC Beth Ann Hoover---------...,,..- Reston, VA \r\nBria Monti Boydston Clemson, SC Alex Javier Ramos Spartanburg, SC \r\nEmma Lacy Chameuff Roswell, GA Jeffrey Alan Sheets Winston-Salem, NC \r\nChristine Marie Clermont Summerville, SC *David John Vaught Seneca, SC \r\nKathryn Sutton Cuthbertson Myrtle Beach, SC Lucille Lee Wilson Walhalla, SC \r\nErnest Holloway II North Augusta, SC \r\nModern Languages \r\n*Leah Frances Sauls __________ Hampton, SC Sherice Michelle Walker _______ Georgetown, SC \r\nPhilosophy \r\nMatthew Holden Warren----- Catonsville, MD \r\nSpeech and Communication Studies \r\nSarah Edwards Bums ______ 7\"\"c--,-Balcimore, MD ***Felicia Dawn Merryman _______ Marietta, GA \r\nNatalie Marie Catalano Hilton Head Island, SC Dextra Dewayne Police Moultrie, GA \r\nJason Ryan Gentry Holly Hill, SC ••Meagan Marie Swingle esup, GA \r\nEric David Hagerman Greenville, SC Robert Haefele Trudeau Mt Pleasant, SC \r\nMichael Wayne Jackson Clemson, SC Jeff Hamilton Vessell Simpsonville, SC \r\nNancy Rutland Martin Georgetown, SC Amy Elizabeth Wilson Chester,SC \r\nDwayne Ontrell McCray Sumter, SC \r\nDOUBLE MAJOR \r\nHistory and Political Science \r\n**William Duffie Powers Columbia, SC "
    },
    {
        "page_number": "19",
        "text": "I \r\n~ \r\nSociology and Speech and Communication Studies \r\nSusan Kimberly Martin ____ Hilton Head Island, SC \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nJonathan Edward Campbell, ______ Spartanburg, SC Kevin Christopher Lindler ---------,-Gaffney, SC \r\nDaniel Mario Cipriani Buffalo, NY Joseph Douglas Matthews Marietta, GA \r\nJames Randolph Curtis, Jr. Anderson, SC Gordon Keith McLeod Ill Irmo, SC \r\nNathan Daniel Elliott Seneca, SC Nicholas H. Pagani Rockville, CT \r\nChad John Frederick Valatie, NY Louis Vincent Ruscilli Columbus, OH \r\nDavid Allen Frye Duncan, SC Benjamin Bernard Singletary Lake City, SC \r\nBrice Holmes Harry Darlington, SC Adam Jonathan Thomas Snellville, GA \r\nAlex Brandon Henry Edgewater, MD Jason W. Waddingham Central, SC \r\n*Jason Wade Lecroy Easley, SC \r\nDesign \r\nScott R. Bouchard ___________ Salem, MA Nicole Angeline Lillo__,.,..,.,.,------- Atlanta, GA \r\n*Emily Elizabeth Cox Mullins, SC Paul Robinson Massengill Ill Easley, SC \r\nJoseph Michael Jett Pacolet, SC *Dawn Elizabeth Pryor Anderson, SC \r\nKoria Kukua Kudjiku Willingboro, NJ Donald Richard Siglin, Jr. Ventnor City, NJ \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nTravis Coleman Cork JV _________ Conway, SC Jeffrey Alan Sheets _______ Winston-Salem, NC \r\nRichard Ingram Horton, Jr. Columbia, SC \r\nPolitical Science \r\n*Danielle Yvonne Clermont ______ Summerville, SC ***Sherzod Teshaevich Muminov __ Tashkent, Uzbekistan \r\nCandice Arren Jeffords Lamar, SC Stephen Andrew Price West Columbia, SC \r\nJohn Joseph Martinelli Vineland, NJ Jared Zola Great Barrington, MA \r\nPsychology \r\nJennifer Rebecca Ballew Easley, SC *Connelly Casey Harvey _______ Mt Pleasant, SC \r\n*Tracy Kathryn Barnett Acworth, GA Gena Caroline Hughes Powdersville, SC \r\nAutumn Lacea Bodie Seneca, SC • Amanda Kathleen Lahey Longwood, FL \r\n**Mary Harper Boyd Georgetown, SC Daniel John McGrogan North Charleston, SC \r\nHolly M. Brown Columbia, SC Elizabeth Dav!S Morgan Roanoke, VA \r\nBrent Martin Buckner Greenville, SC Joyce Nifong Pickett Liberty, SC \r\n+***Emily Jeanne Fornwa!t ___ Hilton Head Island, SC *Charles David Scorza, Jr. Pequannock, NJ \r\nTroyann Isabella Gentile Yuba City, CA Michael Jason Shannon Chester, SC \r\nStacy Christine Gibson Seneca, SC Jameicre Willinda Shefton Florence, SC \r\nAshley Wilkes Goebel Columbia, SC Spencer James Space Greenville, SC \r\n*Paul R. Graber Westminster, SC *Anna Frances Steen Kingwood, TX \r\nYvonne Michelle Greene Lexington, SC *Genevieve Marie Stratos Charleston, SC \r\nStephenie Ann Hammond Seneca, SC Candace Michael Vickery Anderson, SC \r\nSociology \r\nEdwina Pertish Allgood __________ .Seneca, SC Melanie Jean Palmer--------- Anderson, SC \r\nBradley Jason Brewer Walhalla, SC *Michael Timothy Shapiro Marietta, GA \r\nAmy Boggs Giles Seneca, SC Eric Douglas Thompson Beaufort, SC \r\n*Jordan Shelby Harger Atlanta, GA Wendy Caroline Weil Rockville, MD \r\nAmy Ross Hogberg Anderson, SC \r\nEnglish and Political Science \r\n*Geoffrey Matthew Beneze! Greenville, SC \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nRim Michelle Cothran ________ Honea Path, SC Meredith Ellen McCoy------- Myrtle Beach, SC \r\nDouglas Franklin Cottingham Moncks Comer, SC *Kenneth Derrick Mims, Jr. Sumter, SC \r\nMatthew Chad Cottingim Greenville, SC Marcie Ann Patterson Greenville, SC \r\nRichard Douglas Cullinan Roanoke, VA Christopher Paul Reidy Bayville, NJ \r\nCatherine Rebecca Fousek Anderson, SC +**Roxanne Louise Rich Donalds, SC \r\nAngela Crystal Gosnell Spartanburg, SC **Lucinda Nan Stallings Columbia, SC \r\nBenjamin Shane Highsmith Taylors, SC LaKeiya Ashawn Stephens Bowman, SC \r\nLeslie Ann Johnson Conway, SC Benjamin Alex Stevens Lancaster, SC \r\nDevin Thomas Kalman Cammack, NY Judon L. Stevens Columbia, SC \r\n*James Joseph Kozar P1ttsburgh, PA *Mary Elizabeth Trull Richardson, TX \r\nAlicia Ann Lynch Ridgeland, SC Shawn Alexander Wienke Aiken, SC \r\nErin Catherine MacGeorge Livingston, NJ "
    },
    {
        "page_number": "20",
        "text": "Economics Andrew Paul Babb ___________ Taylors, SC Roberto C. Flores ___________ Clemson, SC \r\nFrank Carmine Caporusso North Potomac, MD Brian Patrick Gantt Clemson, SC \r\nKevin Michael Elden Laurel, MD Craig Victor Hallman Gilbert, SC \r\n*Matthew Randolph Eskridge Mauldin, SC Edward Brayden Parks Mt Pleasant, SC \r\nFinancial Management \r\nR. Glen Adair ___________ Greenville, SC Cynthia Chrystine Maddox. _________ Pelzer, SC \r\nDamon Dwight Barker Salem, SC Christa Eleanor Martin McCormick, SC \r\n••Vera Jacqueline Beasley Florence, SC Joseph Brian McNeill Columbia, SC \r\nJames Scott Bloemker Levittown, PA Melissa Anne Meyer Florence, SC \r\n*Walter Thomas Burke III Charleston, SC Casey Alan Peters Point Pleasant, NJ \r\nDavid Richard Coggins, Jr. Laurens, SC Jack William Ramos North Augusta, SC \r\nKevin Charles Cote Charleston, SC Jonathan James Reid Hanover, MA \r\nJesse Michael Cubbison Orangeburg, SC Kathryn Denise Robertson Greenville, SC \r\nMarcus Andrew Detry Oshkosh, WI +•Jenifer Marie Robinson Clover, SC \r\nJames Ralph Hardin 111 Baxley, GA Sandra Hope Shands Pauline, SC \r\nJohn Mauldin Hoffman Dublin, GA Elizabeth Margaret Srory Darien, CT \r\nCarrie Ann Hoover Marietta, GA Tom Chi-Hoo Tse Myrtle Beach, SC \r\nAshley Rebecca Kingsmore Moore, SC Jamael Goodwin Tucker Paget, Bermuda \r\nEric Brian Laquiere Charleston, SC Kevin Peter Varkoly Newton, NJ \r\nStacy Marie Lauderdale Hilton Head Island, SC Todd Joseph Wasilewski Fenton, Ml \r\nShawn Thomas Leonardi Staten Island, NY Mary Elizabeth Wilborn Spartanburg, SC \r\nDavid Christopher Lusk North Augusta, SC \r\nGraphic Communications \r\nAshley Crawford Bowers _______ Simpsonville, SC •Vanessa Catherine Nunnally _____ Westminster, SC \r\nKatrena Ellen Callahan Erlanger, KY *Carol Lynn Parkinson Clifton Park, NY \r\nBradford Franklin Cardell Greenville, SC Scott Joseph Pavao Geneva, IL \r\nDeborah Lloyd Carson Columbia, SC Benjamin Durham Price North Augusta, SC \r\nAnthony Francis Cayetano Goose Creek, SC Ashley Elizabeth Reese Greenville, SC \r\nVictoria Socorro Dulay Bartow, FL Erich Paul Rodenberg Charleston, SC \r\nColeman Ellenberg Greenville, SC Mandy Michelle Rowland Charlesron, SC \r\nJeffrey Lee David Ellis San Diego, CA *David Oscar Sheriff, Jr. Seneca, SC \r\nBrent Cobia Frampten Mt Pleasant, SC Ryan Daniel Edward Sorrels Centerville, OH \r\nRebecca Lynn Freeman Greenville, SC Allison Brooke Suddeth Easley, SC \r\n*Michael Patrick Hayden Columbia, SC *Amanda Caroline Terrell Florence, SC \r\nHayden Leigh Hesse Mt Pleasant, SC Peter Scott Tortora Manassas, VA \r\n+•Heather Anne Lankford Pittsburgh, PA Aaron David Warren Columbia, SC \r\nKeri Ann Lipscomb Newberry, SC Jamie Diane Watson North Augusta, SC \r\nJonathan Wesley Ludwig Inman, SC Holly Taylor Williams Cold Spring Harbor, NY \r\nElizabeth Louise McElveen Kingstree, SC John Alan Witherspoon Greer, SC \r\nDouglas Michael Morro Old Tappan, NJ Tiffany Hope Woodford Easley, SC \r\nJames Halbert Moseley Ill Gasronia, NC Russell Vernon Yates Clemson, SC \r\nIndustrial Management \r\nRyan Michael Chun,.._~ _______ Greenville, SC Matthew Todd Moore __________ Easley, SC \r\nCornelius Jere! Cunningham Laurens, SC John Ryan Weaver Morristown, TN \r\nH. Lee Drumhiller Mission Viejo, CA Jonathan Luke Woody Fountain Inn, SC \r\nManagement \r\nMichael Linwood Blanding, Jr. Sumter, SC Bradley Edward Lisman Charlotte, NC \r\nRobert Allen Boozer Columbia, SC James Thomas Martin Anderson, SC \r\nEric Daniel Brunault Salisbury, MA Brian Patrick McCall Kingsport, TN \r\n+•Kasie Summer Campbell ____ North Myrtle Beach, SC Jennifer Avice Mizell North Charleston, SC \r\nDavid William Cecil Ill Spartanburg, SC Jennifer Guerin Morris Pickens, SC \r\n•Joohyung Chung Seoul, Korea Jesse Andrew Roberts Wyoming, DE \r\nDennis Ryan Coleman Easley, SC Bryn Colette Sarvis Irmo, SC \r\nBradley Claud Crain Aiken, SC Sean Patrick Skelly Middletown, NY \r\nRobert Patton Durrett Montreal, Quebec ••Ray Willard Smith Ill Rock Hill, SC \r\nMichael Robert Elliott Chadds Ford, PA Elizabeth Ashley Stewart Hartsville, SC \r\nLee Augustus Froneberger Greenville, SC Andrew J. Taulbee Tucker, GA \r\nRichard Todd Garrison Pendleton, SC Michael Ham pron Taylor Batesburg, SC \r\nDaniel D. Goldrick Florence, SC James Gordon Thompson, Jr. Montgomery, NJ \r\nJohn Ohlen Cates Greene Gainesville, GA +••Sara Elizabeth Tracy Sandwich, NH \r\nIan Davenport Guerry Richmond, VA William Byrd Traxler Ill Greenville, SC \r\nCarla Lynn Holzer Anderson, SC Thomas Edward Trickett, Jr. Taylors, SC \r\nThomas Michael Hopkins Madison, CT Erin Suzanne Williamson ____ Cranberry Township, PA \r\nStephanie Leigh Keycck Atlanta, GA Richard Craig Wooten Anderson, SC \r\n*Eric Christopher Kuehnen Wall, NJ "
    },
    {
        "page_number": "21",
        "text": "Marketing \r\nRyan Todd Abrams Spartanburg, SC Michael Shane McGuffin Westminster, SC \r\nCharles Robertson A lien Summerville, SC Brian Steven Mercier Easley, SC \r\n•Meredith Lynn Backes Manasquan, NJ Michael Bruce Miller Dalton,GA \r\nLisa Marie Bartlett Orchard Park, NY Eric Steven Moeves Cincinnati, OH \r\nAlison Rebecca Biondi Monterey, CA B. Grey Moore Clearwater, FL \r\nJason Sanders Blanton Spartanburg, SC Mary Michon Morrow Lexington, KY \r\nRobert Roland Bradford Ill Columbia, SC Theofilos E. Mougros Tarpon Springs, FL \r\nSeth Charles Brizek Oley Valley, PA *Kelly Anne Nettles Charleston, SC \r\nKurt William Bultmann II Seminole, FL Ryan Christopher Newell Burtonsville, MD \r\nSara Ann Burkett Florissant, MO Patrick Andrew Nitsche Greer, SC \r\nJeffrey William Christner Newtown,CT J imese Sherrie Orange Columbia, SC \r\n•Meghan Casey Clabaugh Hilton Head Island, SC Patrick Langdon Owens Mt Pleasant, SC \r\n+**Anna Meredith Clark Simpsonville, SC Mark Register Pantsari Columbia, SC \r\nWilliam Avery Clark Marietta,GA Jeffrey Brian Pratt West Stockbridge, MA \r\nMattie Beulah Collins Liberty, SC Torey Damian Proctor Simpsonville, SC \r\n***Jacqueline Marie Cooper Greenville, SC Kevin Charles Purcer East Granby, CT \r\nShannon Lee Dupler Manhattan, KS Troy Anthony Pusateri Baltimore, MD \r\nFrank Buist Eaves Ill Rock Hill, SC Darius Fitzgerald Rapley Greenville, SC \r\nDavid Marshall Evans, Jr. Abbeville, SC Margaret Ann Riley Shoreham, NY \r\nStacey Jean Finner Macon,GA Danielle Marie Satterfield Greenville, SC \r\nDaniel Sorrell Fnck Gaithersburg, MD Stephen Moore Schott Wichita Falls, TX \r\nJennifer Leigh Fries Frederick, MD *Darrel James Seaman Daytona Beach, FL \r\nKerri Lee Gamble Cades, SC Richard Bruce Sizemore Greenville, SC \r\n•Trenton Phillip Hardee Spartanburg, SC Sarah Courtney Smith Vineland, NJ \r\nMatthew Clinton Hines Hartsville, SC Stacy Lyn Smith Point Pleasant Beach, NJ \r\nJeffrey Tate Holley Iva, SC *Meredith Lea Starkey Lexington, SC \r\nJeremy Charles lwaszkowiec St Peters, MO Danielle Susan Stauffer Dagsboro, DE \r\nKelly Marie Jadlot Greenwood, SC Matthew Edward St. Louis Moore, SC \r\nBlanca Teresa Johns Fort Lauderdale, FL Jonathan Byron Storck Queens, NY \r\nJason Ellis Kamlet Englewood, CO William Larry Tolbert Ill Prosperity, SC \r\nChristopher Wayne Long Damestown, MD Ryan Vincent Tsai Joliet, IL \r\nChamp James Madigan Ill Orlando, FL Scott C. Tyndale Chester, NJ \r\n• Adam Curtis Massey Sausalito, CA Shawn Allen Vincent Wyoming, DE \r\nMatthew Maurer Pittsburgh, PA Kevin Todd Waters lrmo,SC \r\nHeather Lynn McDonald ____ Cranberry Township, PA \r\nPre~professional Studies \r\n•Jennifer Ashley King Easley, SC \r\nPsychology \r\nMarietta Abad1es Campbell Iva, SC ***M. Chantay Ivester Clayton, GA \r\nJay Christopher Cole Greenville, SC Rion Reid Odom Hartsville, SC \r\n***Erin Laurel Fields North Augusta, SC Dana Marie Page Florence, SC \r\nBryan Marshall Hansen Bloomington, MN Jewel Ellen Prichard Aiken, SC \r\nI Tiffany Antonette Harris Lancaster, SC lain Patrick Cale Roberts Warwick, Bermuda \r\nRhonda Suzanne Hendrix Greenville, SC *Steven Anthony Simpson Anderson, SC \r\n' Jamal LombraJa Herrera Greenville, SC •William Mark Williams Abbeville, SC \r\nAlex Charles Hudson Goose Creek, SC \r\nSociology \r\nEric Michael Broermann Virginia Beach, VA Matthew Gilbert Hedtke Anderson, SC \r\nJake Douglas Fine Spartanburg, SC **Cynthia Lyn Picklesimer Highlands, NC \r\nCharley Ann Gordon Anderson, SC Ashley Morrow Watson Easley, SC \r\nKelly Andrew Hancock Seneca, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nI THOMAS MICHAEL KEINA TH, Dean \r\n~ BACHELOR OF ARTS \r\nChemistry \r\nArmaal Rashard Hunter Mullins.SC La Toya Denise James Harleyville, SC \r\n! Geology \r\nGary Lonny Clark Anderson, SC \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering \r\nAshley Kay Bryant Ponte Vedra Beach, FL Laura Elizabeth Neil Townville, SC \r\nJames Alan Darby, Jr. Pelzer, SC Maureen Maria Wingfield Largo, FL \r\nCeramic Engineering \r\nJacob Russell Cunningham Lexington, NC Paul Barrett Matthews Avon,CT \r\nThomas Quinn Engesser McClellanville, SC Frederic Pare Florence, SC \r\nAlison Fleming Jackson Spartanburg, SC Roy Sean Parton Roebuck, SC \r\nAndrew James MacQueen Watertown, NY Michael Eugene Walker Travelers Rest, SC "
    },
    {
        "page_number": "22",
        "text": "Chemical Engineering \r\nSuzanne Marie Ani _________ Goose Creek, SC Alex Charles Hudson ________ Goose Creek, SC \r\nNaomi Jean Ballenger Spartanburg, SC Jeffery Edward Kemp Columbia, SC \r\nMark Temple Davis Kingsport, TN Tanika Lanell Wallace Barnwell, SC \r\nChemistry \r\n*Victor K. Li ____________ Cheraw, SC *Jessica Dawn Quinlan _________ Yelm, WA \r\nKenneth Germaine Littlejohn Gaffney, SC Kaleta Laveshira Shuler Ridge Spring, SC \r\nPatrick Allen Michener Goose Creek, SC Kirk Durand Thomas Florence, SC \r\nCivil Engineering \r\n*Angela Lyn Allen __________ Clemson, SC William Travis McDowell ________ Pauline, SC \r\nRyan Ernest Allen Anderson, SC *Todd Pennock Mercer Dover, DE \r\nSteven Grant Branyon Honea Pach, SC Michael Randolph Moseley, Jr. Anderson, SC \r\n*James Coleman Curry 111 Cheraw, SC *Brian George Nickerson Gainesville, FL \r\nChad Richard Elledge Lexington, SC Michael Glenn Norkett Spartanburg, SC \r\nRyan Thomas Galasso Lawrenceville, GA *David Carson Pelfrey Easley, SC \r\nClifton Thomas Goldsmith Holmdel, NJ Reynold D. Peterson Pamplico, SC \r\nJohn Leo Grady, Jr. Summerville, SC Ryan Patrick Ray Columbia, SC \r\nRichard Ryan Haddock Kingstree, SC Susannah Jacqueline Sigaloff Greenville, SC \r\n*Michael Hoyt Hamilton Chapin, SC Henry Monroe Simpson Ill Hartsville, SC \r\nRonald MichaelJaruzel Moncks Comer, SC John). Stroke Chapin, SC \r\nMichael Kelly Victor, NY Katina Sherell Thompson Lake View, SC \r\n*Michael Deane Kleven Huntington Beach, CA ***John Michael Waters Iva, SC \r\n***Bryan Thomas Lechner Danbury, CT Barney Doyle Zeigler Orangeburg, SC \r\nComputer Engineering \r\n*Trent Jason Bradberry~------- Anderson, SC Joseph Brent Owens ________ Myrtle Beach, SC \r\nKatherine Jo Ann Chisholm Fallston, MD +*Raj iv A. Pace\\ Myrtle Beach, SC \r\n+**Ethan David Farquhar Greenville, SC Michael Scott Patterson Greenville, SC \r\n+***Karen Louisa Gray Anderson, SC *Brian Douglas Redd Greer, SC \r\n*Khadija Jirari Rabat, Morocco Wesley Leyton Renfroe Greenville, SC \r\nChristopher Allen Jones Greenville, SC Joshua Joseph Stenger Tabernacle, NJ \r\nSean Lee Keller Hanahan, SC *Bryan Lee Wilson Charleston, SC \r\nJason Andrew Miller Rock Hill, SC \r\nComputer Information Systems \r\nCornelius Cooper _________ Georgetown, SC Robert Edward Johnson ________ Kingsport, TN \r\nNancy Kay Greer Belton, SC **Nicola Michele Page Greenville, SC \r\nTonyna Autry Hudgens Belton, SC Robert Curtis Parker A clan ta, GA \r\nComputer Science \r\n***Rachel Lynn Adams _________ Aiken, SC *Robert Kenneth Johnston _______ ~ Easley, SC \r\nAudrey Rena Alexander Fort Lawn, SC Byeong Un Lee Greenville, SC \r\n*Thomas Martin Auchter Cincinnati, OH **Timothy Scott Rawls Atlanta, GA \r\nJason Scott Barden Seneca, SC ***Kristin Lee Reid Montclair, VA \r\nDavid Robert Dilworth Greer, SC Kenneth Scott Sandefur Greer, SC \r\nYasin Mohamed Esmail Dar Es Salaam, Tanzania Henry Gibson Williamson Simpsonville, SC \r\nAlmon Eagles Fountain Ill Anderson, SC Ariel Wolfer Clemson, SC \r\nRonnie Craig Hyams Greenville, SC \r\nElectrical Engineering \r\n*Dennis Tyree Ancrum ________ Hollywood, SC *David Brian Mattison------- Spartanburg, SC \r\nDelia LaShaye Bromell Conway, SC William Frederich Munn Mt Pleasant, SC \r\nJoseph Eric Ellis Charleston, SC Daniel Paul Stirna Naperville, IL \r\nStephen Raymone George Cartersville, GA Susanna Mildred Stratmann Columbia, SC \r\nSherisse Alicia Goodwin Columbia, SC Bryson Dial Tucker Irmo, SC \r\nCurtis Anthony Grant, Jr. Hopkins, SC Eric Christopher Venable Waterloo, SC \r\nAndrea Denise Holmes Pinewood, SC Zane Thomas Whiteley Florence, SC \r\nAmanda Jean Lintzenich Cranberry Township, PA Robert A. Williams Springfield, VA \r\nJason Gerard Massey Rock Hill, SC *Wayne Carl Yount Greer, SC \r\nGeology \r\nErvin Erkinda Lane __________ Pomaria, SC Robert Bryan Shealy---------- Moore, SC \r\nLori Leigh Mauldin Greer, SC \r\nIndustrial Engineering \r\nJill Allyn Blocher __ ~ _______ Knoxville, TN Patrick Brown McClary _______ Simpsonville, SC \r\nEdwin Deleon Boatwright Lodge, SC Heidi Marie Meek Simpsonville, SC \r\nMelanie Lynn Clayton Greer, SC Shawna Lynn Molchan Fairmont, WV \r\nBrian Keith Diebold Anderson, SC Christoper Kennard Pooler Darlington, SC \r\n*Stacy Ann Hanna Wilmington, NC +***Sandra Kay Powers Painted Post, NY \r\nDouglas Eugene Hemphill, Jr. Spartanburg, SC Andrico Jauron Tanner Spartanburg, SC \r\nMichael Joseph Jerome North Augusta, SC Eric Weathers Watson Cordova, SC \r\nCindy Hsin Lin Greenville, SC *Michael Patrick Williams Fairfax, VA \r\nDeiona Sharcne Long Eastover, SC Dawn Nicole Woods Lexington, SC "
    },
    {
        "page_number": "23",
        "text": "I \r\n' \r\nMathematical Sciences \r\nMichele Lynn Scotti Whitehouse Station, NJ \r\nMechanical Engineering \r\nJeffery Lynn Barron _________ Greenville, SC David Edward Ramey _________ ~ Easley, SC \r\nJonas Lee Benjamin Greenville, SC +••Marc Christopher Ramsey Collierville, TN \r\nOmar Bravo Anderson, SC Martin Duane Rhodus Camden, SC \r\nRussell Clint Frazier Greenville, SC John Elsworth Robison Anderson, SC \r\n••Robert Emory Gaskins Society Hill, SC +•Brian Tavis Rundgren Eggleston, VA \r\n•••Waddy Thomson Haynie Belton, SC Nathan Andrew Russell Blue Ridge, GA \r\nRobert Clinton Hearne Pamplico, SC Jill Russell Salley Holly Hill, SC \r\nStephanie Patrice Hicks Ninety Six, SC *Harold Bernard Samuels Timmonsville, SC \r\nTyler Warren Jacobs Camden, SC Ernest Andrew Shuler Darlington, SC \r\nBrian B. Johnson Myrtle Beach, SC Justin Bryant Shum Brookeville, MD \r\nDeborah Kaye Johnson Florence, SC David Tristan Smith Anderson, SC \r\n*Robert Moffatt Kennedy IV Myrtle Beach, SC *Timothy Brian Smith Cope, SC \r\nJames Robert Massey Goose Creek, SC +**Shayndus Dawn Sperry Greenwood, SC \r\nCourtney Rene Mayes Bluffton, SC +•Matthew Scott Stanford Greenville, SC \r\nJeffery Robert McGowan Brandon, FL Joseph Ephraim Whisenhunt Greenville, SC \r\nDavid Christopher Merli Swiftwater, PA Jeremy Alan White Charleston, SC \r\nJody Alicia Nix Pickens, SC John Claude Wilson IV Newberry, SC \r\nIan Paradis Greenville, SC John Michael Wolf Pittsburgh, PA \r\nMatthew Lee Peterson Portland, OR *Donald Mark Wood Mechanicsburg, PA \r\nChad Edward Porginski Greenville, SC Ian DeShea Yankosky Mt Pleasant, SC \r\nTextile Chemistry \r\nJoshua Daniel Corley ___________ Greer, SC Thomas Lawrence Gilbert _______ Anderson, SC \r\nRobert Wade Finklea Pamplico, SC \r\nTextile Management \r\nRana Ghufran Rasheed _______ Karachi, Pakistan Corey Taylor Reedy ___________ Lugoff, SC \r\nTextile Science \r\nShazad Iqbal ___________ Karachi, Pakistan Usman Shafl ___________ Karachi, Pakistan \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nHAROLD ERNEST CHEATHAM, DEAN \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\nElizabeth Bartlce Akers ________ Columbia, SC +•••Amy Elizabeth Pounds--------,- Easley, SC \r\nKrista Marie Ayres Aiken, SC Laura Beth Rush Mauldin, SC \r\n*Brandi Diane Collins Piedmont, SC Karen Beth Sfeir Greenville, SC \r\nNatalie Louise Cordray Charleston, SC **Angela Ruth Shelley Florence, SC \r\nJulie Lynn Cumbee Orangeburg, SC **Kimberly Beth Silkworth Vero Beach, FL \r\nAmy Wright Davies Greenville, SC Allison Ruth Swords Williamston, SC \r\nKirsty Louise Dobbs Sumter, SC Anastasia Marie Trueman Germantown, MD \r\nKelly Eileen Durell Anderson, SC Wenonah Galatea Wells Laurens, SC \r\nBrenna Kaye Johnson Greer, SC Jennifer Gwyn Wethington Greenville, SC \r\nMichelle Lynne Johnson Easley, SC +***Brooke Danielle Young Lexington, SC \r\nElizabeth Cole Maxwell Jonesboro, GA Jennifer Renee Zappa Allison Park, PA \r\nJennifer Dawn Morgan Greer, SC \r\nElementary Education \r\nAshley Edith Alward _________ Greenville, SC Kimberly Nicole Gibbs _______ Westminster, SC \r\nKarie La Pierre Anderson Seneca, SC *Jennifer Allison Hooks Anderson, SC \r\nRyan Douglas Bauer Doylestown, PA Alyson Kristine Humphreys Randolph, NJ \r\n*Margaret Kathryn Black Greenville, SC Rita Michelle Isom Rock Hill, SC \r\n***Kristie Michele Brennan Ballston Lake, NY Laura Potuto Kaufmann East Hanover, NJ \r\nSusanah Elizabeth Chetwood Winston-Salem, NC *Kathleen Ann Mang Charleston, SC \r\n**Christina Marie Cody Greenville, SC Laura Lynn Norwood Travelers Rest, SC \r\n+*Dayna Marie Cooper Allendale, NJ Amy Grace Roberts Charleston, SC \r\nNicole Ann Cooper Kennett Square, PA *Wendy Christina Roberts Greenville, SC \r\nStacey Ann Crandall Columbia, SC *Leah Frances Sauls Hampton, SC \r\nRashuna Elsaria Cunningham Gaffney, SC Sarah Rebecca Sicherman Columbia, SC \r\nCheri Leigh Dapprich Columbia, SC Heather Leigh Spivey Anderson, SC \r\nJanet Elizabeth Davis Aiken, SC Jennifer Lee Stewart Rocky Hill, CT \r\nKeri Dyar Davis Anderson, SC Teri Elizabeth Stokes Greer, SC \r\nAmy Danielle Dickson Seneca, SC Nancy Loraine Swanson Toccoa, GA \r\n*Jessica Louise Earley Greenville, SC Stephanie Christina Tyner Honea Path, SC \r\nAlyson Christina Edwards Taylors, SC Ja'Nese Shovon Wright Beaufort, SC \r\nUrsula Jane Feurtado Quincy, MA "
    },
    {
        "page_number": "24",
        "text": "Secondary Education \r\nCatherine Thackston Adams _____ Simpsonville, SC Jennifer Michelle Johnson _________ Greer, SC \r\nElizabeth Finley Cate Columbia, SC Megan Price Jones Greer, SC \r\nSummer Hope Dale Summerton, SC Felicia Gabralee McCommon Walhalla, SC \r\nLindsay Kaye Donald Westminster, SC Carrie Amanda Nixon Abbeville, SC \r\nBrian Keith Feltman Westminster, SC Katherine Danielle Paschal North Augusta, SC \r\nJimmy Marvin Griffin, Jr. Belton, SC Jason Paul Winstead Boiling Springs, SC \r\n*Danny Paul Hamm Boiling Springs, SC April Elizabeth Witherspoon Seneca, SC \r\nDana Catherine Hawkins Belton, SC \r\nSpecial Education \r\nKirsten Marie Odom--------- Columbia, SC Jenny Rene Swizdaryk _________ Anderson, SC \r\nSecondary Education and Spanish \r\nJenny Rebecca Austen Charlotte, NC \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\n*Kelly Jo Andres ----------- Beaufort, SC Jenny Leigh Lawson __________ Spartanburg, SC \r\nStacey Jane Brennan Grayslake, IL Nancy Theresa McGinty Oak Lawn, IL \r\nKristen Dyan Brown Greenville, SC Eric Martin Ramsey Virginia Beach, VA \r\nAmie Kaye Derrick Seneca, SC Louanne Elizabeth Rotola Anderson, SC \r\nTanya Johnston Dillard Clemson, SC Melissa Ann Sox Lexington, SC \r\nBrian John Everhart Fanwood, NJ \r\nIndustrial Education \r\n*Romona Y. Armstead -,-------- Metuchen, NJ ••John Wendell Gillespie _________ Seneca, SC \r\nChristopher Kevin Crenshaw Moore, SC \r\nMathematics Teaching \r\nJesse Edward Breneman _____ Palm Beach Gardens, FL Melvin Anthony Robinson, Jr. ______ Columbia, SC \r\nCourtney Myers McCallion Long Island, NY Bryan Douglas Smith Angelus, SC \r\nRyan Lee Player Lancaster, SC \r\nNursing \r\nApril Joy Abercrombie--------- Pickens, SC **Alma~Katherine Rast Hunter _____ Greenville, SC \r\n••Carol Layton Adkins Taylors, SC Karin Lynn Hyatt Simpsonville, SC \r\nAngela Nicole Beam Lugoff, SC *Tara Elizabeth Johnson Columbia, SC \r\nMary Elizabeth Burnett Belton, SC Kimberly Teresa Kamp Seneca, SC \r\nRhiannon Nicole Capps Goose Creek, SC Rebecca Elizabeth Koch Ninety Six, SC \r\n*Cynthia S. Chasteen Taylors, SC Kimberly Michelle Landree Sterling Heights, Ml \r\nLeslie Elizabeth Cribb Camden, SC *Stacey Kratzer Link Lugoff, SC \r\n*Lynn Allyson Curry Fountain Inn, SC Anna Dell Marchant Charleston, SC \r\n••Angela June Davis Easley, SC Michelle Ann Owens Moncks Corner, SC \r\n*Kimberly Michelle DeWitt Columbia, SC •Jennifer Lee Peterson Simpsonville, SC \r\nGina Marie Dom is Columbia, SC Iris L. Stovall Greenville, SC \r\n••Nancy Rankin Ewin Anderson, SC *Todd Joseph Cameron Tedesco Greenville, SC \r\n•Jason Cointemente Hadley Columbia, SC •••Marguerite Kathrine Teer Sumter, SC \r\nKellie Katherine Ham Florence, SC Allison Amanda Watts Florence, SC \r\nApril Millicent Hardwick Mull ms, SC Ann Mary Wielgus Scotch Plains, NJ \r\nDonna Smith Hemphill Central, SC Debra Kai Wilfong Greenville, SC \r\nRodney Shane Home Lake View, SC Jennifer Elizabeth Lynn Will Marlboro, NJ \r\n•••Ellen Elizabeth Hotz Cincinnati, OH \r\nParks, Recreation, and Tourism Management \r\nBarrie Roberts Alewine ________ Greenville, SC Christine Marie Goepfert ________ Chatham, NJ \r\nChadwick Mitchell Bishop Greenville, SC Elly James Jones Marion, SC \r\nLeslie Jean Bloking Long Valley, NJ William Dee Kirby, Jr. Greenville, SC \r\nJustin Tyson Boggs Central, SC Nancy Hunter Lowder Sumter, SC \r\nPaula Jane Brewer Manning, SC Jay Marshall McAdams Greenwood, SC \r\nRoy Edward Broughman Ill Cayce, SC Allison Courtney McNeill Columbia, SC \r\nJoshua Gene Burgess Seneca, SC *Merid1th Kathleen Melton Clemson, SC \r\nJames Riley Cathcart Ill Chapin, SC Mark Barrera Molinar Van Horn, TX \r\nJustin Wade Catto Moore, SC Anne Beaumont Nichols Miami, FL \r\nDavid Furman Cave Charleston, SC Meleana Luika Pierce Charleston, SC \r\nK. Brooke Comer Rock Hill, SC Anna Lorraine Rich Wellford, SC \r\nJason Edward Crawford Central, SC Eileen Benton Skeoch Frederiksted, St Croix \r\nLisa Michelle Dantzler Lexington, SC Erin Elizabeth Weir Severna Park, MD \r\nAllison Healy Deland Edison, NJ Wen<ly Leigh Willingham Columbia, SC \r\nJamie Lea Gibson Pickens, SC Andrew Henry Woolum Chapin, SC \r\nScience Teaching \r\nLeverett Marlin Bruner _________ Clemson, SC *Stacy Melton Powell __________ Libcrcy, SC \r\nAngela Marie Clark Simpsonville, SC Michael Eugene Wald Westminster, SC \r\nNathan Paul Crawford Lancaster, SC "
    },
    {
        "page_number": "25",
        "text": "' \r\n•Cum laude: A grade point ratio of 3.40 to 3.69 \r\n••Magna cum laude: A grade point ratio ofJ.70 to 3.89 \r\n•••Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\n+Departmental Honors: The graduates so designated have completed an enriched program of study designed by their \r\ndepartments with the approval of the Calhoun College Honors Program. To earn Departmental Honors students must \r\ncomplete an honors thesis and/or other upper division honors courses, while maintaining an overall grade~point ratio of 3.40 or \r\nhigher. Departmental Honors graduates appear in the line of march wearing the Calhoun College Honors Medallion on an \r\norange and purple ribbon. This medallion is made possible by an endowment established by Mrs. Katherine Inabinet Vickery of \r\nColumbia, South Carolina, to honor the memory of her husband and Clemson graduate, the late B. C. Inabinet. \r\nStudents wearing the white stoles over their gowns are members of honorary societies that require a minimum 3.00 grade point \r\nratio for membership. The stoles have the University seal embroidered on one side, and on the other side are the emblem(s) of \r\nhonorary societies in which the student is a member. "
    },
    {
        "page_number": "26",
        "text": "Awards \r\nTHE CLASS OF '39 A WARD FOR EXCELLENCE \r\nIn 1989 on the occasion of the 50'\" Anniversary of its graduation from Clemson \r\nUniversity (then the Clemson Agricultural College of South Carolina), the Class of \r\n1939 established the Award for Excellence . It is presented annually to a faculty \r\nmember whose contributions over the immediately preceding five-year period are \r\njudged by the faculty member's peers to represent the highest achievement of service \r\nto the University and the Student Body. \r\nRECIPIENT OF THE CLASS OF '39 AW ARD FOR EXCELLENCE \r\nJUDITH MARY MEL TON \r\nProfessor of German and Women's Studies \r\nFACULTY SCHOLARSHIP A WARD \r\nEstablished at Clemson University in 1959, this is presented by the faculty of \r\nClemson University to the member of the graduating class who has the highest \r\nscholastic achievement. All graduates who have completed the requirements for the \r\nbachelor's degree since the last commencement exercise and who have completed at \r\nClemson at least 75 percent of the work required for graduation shall be eligible for \r\nconsideration. \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AWARD \r\nSANDRA KAY POWERS \r\nPost, NY \r\nMARGUERITE KA TH RINE TEER \r\nSumter, SC "
    },
    {
        "page_number": "27",
        "text": "1 \r\nI \r\n' I \r\nI \r\n' \r\nThe University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present at any convocation where the University, \r\nthrough its delegated members, is acting officially. At any official convocation \r\nsuch as commencement, the University Marshal, carrying the mace, precedes \r\nthe President into the assembly. The mace rests before the President's chair or \r\nspeaker's stand throughout the ceremony, and its removal from the assembly at \r\nthe close of a convocation is symbolic of the official withdrawal of the \r\nUniversity and, thus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic \r\nclublike shape, however, is much more ancient, probably going back to man's \r\nprehistory. It is made of walnut wood and silver, with the seal of the University \r\nin gold and the University colors represented by insets of comelian (orange) \r\nand amethyst (purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the \r\noffice of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the whole \r\nbody of the institution. Clemson's chain and seal are made of silver and gold, \r\nand comelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most \r\nacclaimed goldsmiths of our era. The enamel plaques for the batons were \r\nexecuted by the late Professor Marshall C. Bell, and the lapidary work was \r\nexecuted by the late Mr. C. C. Wilson of Clemson University. "
    },
    {
        "page_number": "28",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green Clemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the \r\nRoyal School of Mines in Paris (1828-1832). His early profession was that of a \r\nmining engineer; however, circumstances diverted his interests into politics \r\nand the life of a southern planter, and he soon became an enthusiastic advocate \r\nof scientific agricu lture. He had a career as a diplomat ( charge d'affaires to \r\nBelgium, 1844-1852) and served as the first Superintendent of Agricultural \r\nAffairs in Washington (1860). As a scientist he published numerous articles in \r\nthe fields of mining, chemistry and agricu lture. His varied activities included \r\nhis assistance in the founding of the Maryland Agricultural College, his support \r\nof the Morrill Act, his leadership in South Carolina after the Civil War, and \r\nhis part in founding Clemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two four-yea r \r\ncurricula, supplemented by two two-year preparatory courses. Today the \r\nUniversity has six major academic units. These are the College of Agriculture, \r\nForestry and Life Sciences, the College of Architecture, Arts and Humanities, \r\nthe College of Business and Public Affairs, the College of Engineering and \r\nScience, the College of Health, Education and Human Development, and the \r\nGraduate School. \r\nThe institution is an accred ited member of the Southern Association of \r\nColleges and Schools; various curricula are accredited by the Accreditation \r\nBoard for Engineering and Technology, American Assembly of Collegiate \r\nSchools of Business, American Council for Construction Education, American \r\nSociety of Landscape Architects, Computing Science Accreditation Board, \r\nHuman Factors and Ergonomics Society, International Association for \r\nManagement Education, National Architectural Accrediting Board, National \r\nAssociation of Industrial Technology, National Association of State Directors \r\nof Teacher Education and Certification, National Council for Accreditation of \r\nTeacher Education, National League for Nursing, Planning Accrediting Board, \r\nand Society of American Foresters. \r\nClemson is a land-grant institution. As such , it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is \r\nalso heavily committed to a varied program of public service, including the \r\nwork of agricultural extension which has professional personnel located in each \r\nof the State's counties. "
    },
    {
        "page_number": "29",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. \r\nJI "
    }
]