[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n8-7-1999\r\nClemson Commencement Program, August 1999\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, August 1999\" (1999). Clemson Commencement Programs. 86.\r\nhttps://tigerprints.clemson.edu/comm_programs/86"
    },
    {
        "page_number": "2",
        "text": "' Graduation Exercises \r\nAugust 7, 1999 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "Graduation \r\nSaturday, August 7, 1999 \r\n11:00 a.m. Littlejohn Coliseum \r\nORDER OF ,CEREMONIES \r\n(Audience will please stand as 'faculty and candidates march in and \r\nremain standing for the invocation.) \r\nInvocation \r\nBeverly Elwina McAdams, Student Representative \r\nIntroduction of Trustees \r\nPresident Constantine W . Curris \r\nConferring of Honorary Degrees \r\nPresident Constantine W. Curris \r\nRecognition of the Deans of the Colleges \r\nVice President for Academic Affairs and Provost \r\nSteffen H. Rogers \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident Constantine W. Curris \r\nRecognition and Presentation of Awards \r\nBoard of Visitors Graduate Teaching Assistant Award \r\nFaculty Scholarship Award \r\nAurora Brass Quintet \r\nFrank W. Breazeale, Organist \r\nKevin Davidson, Soloist \r\nDr. Bruce Yandle, University Marshal "
    },
    {
        "page_number": "4",
        "text": "BOARD OF TRUSTEES \r\nLawrence M. Gressette, Jr., Chairman _________ Columbia \r\nJoseph D. Swann, Vice Chairman Greenville \r\nBill L. Amick Batesburg \r\nJ. J. Britton Sumter \r\nLeon J. Hendrix, Jr. New York, NY \r\nHarold D. Kingsmore Aiken \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee Greenwood \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick Ill Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nWilliam C. Smith, Jr. Columbia \r\nAllen P. Wood Florence \r\nTrustees Emeriti \r\nLouis P. Batson, Jr. _______________ Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW . G. DesChamps, Jr. Bishopville \r\nPaul W. McAlister Laurens \r\nPaul Quattlebaum, Jr. Charleston \r\nD. Leslie Tindal Pinewood \r\nJames M. Waddell, Jr. Columbia \r\nExecutive Secretary to the Board of Trustees \r\nJ. Thornton Kirby \r\nADMINISTRATIVE OFFICERS \r\nConstantine W. Curris ______________ President \r\nSteffen H. Rogers Vice President for \r\nAcademic Affairs and Provost \r\nJohn Kelly _______________ Vice President for \r\nPublic Service and Agriculture \r\nNeill Cameron Vice President for Advancement \r\nAlmeda Jacks Vice President for Student Affairs \r\nScott Ludlow Chief Financial Officer \r\nDavid Stalnaker Executive Director of the Commission \r\non the Future of Clemson and Assistant to the President "
    },
    {
        "page_number": "5",
        "text": "HONORARY DEGREE \r\nMINORU OHNISHI \r\nDOCTOR OF LAWS \r\nFuji Photo Film Chairman and CEO Minoru Ohnishi is a v1s1onary ~oth in the \r\nintroduction of technology and in the recognition of the beneficial relationship between \r\ncorporations, communities and universities. He has greatly contributed to the social and \r\neconomic growth not only of Japan, but also to that of South Carolina. \r\nMr. Ohnishi joined Fujifilm shortly after graduating from Tokyo University in 1948. \r\nHis degree in economics coupled with his love of photography led to many early Fujifilm \r\nsuccesses, including the introduction of the world's first Quick Snap one-time use \r\nrecyclable camera, the manufacturing of ISO 400 color negative film and the \r\ndevelopment of the digital medical diagnosis system. \r\nMr. Ohnishi was named manager of Fujifilm's New York office in 1964. In 1972, he \r\nbecame director of the board for the company and, after successful stints as both managing \r\ndirector and senior managing director, he was named president of Fuji Photo Film Co., Ltd. \r\nin 1980. \r\nIn this role, Mr. Ohnishi made the decision to build the first Fujifilm factory in the \r\nUnited States in Greenwood, S.C., which opened in 1989. In 1996, Mr. Ohnishi was named \r\nchairman and CEO of Fuijifilm's global operations and continues to implement his vision \r\nof a strong international commercial partnership throughout North America and the \r\nworld. \r\nThe Greenwood community embraced Fujifilm, and the partnership has flourished. \r\nFujifilm-Greenwood now has six major production facilities, a major research and \r\ndevelopment center and the largest Fujifilm distribution center in the world. The \r\nGreenwood complex is recognized as Fujifilm's North American manufacturing and R&D \r\nheadquarters. Fujifilm has helped strengthen our state's economy, with more than 1,300 \r\nassociates employed in South Carolina and an annual payroll approaching $50 million. \r\nIn 1997, Fujifilm made a contribution of $200,000 to help create the Greenwood \r\nCommunity Children's Center. The company has also given 100 cherry trees to \r\nGreenwood and has established scholarship programs at Clemson University, the \r\nUniversity of South Carolina, Lander University and Piedmont Technical College for the \r\nbenefit of Greenwood County students. \r\nFujifilm and Clemson have partnered to form the U.S.-Japan Alliance with Clemson, \r\nan organization that furthers international relations through research and industry. The \r\nties run strong: Mr. Hirokuni \"Harry\" Watanabe, president of Fujifilm's Greenwood \r\noperations and co-chair of the UJAC, serves as a member of the Commission on the Future \r\nof Clemson University, and Mr. Bill West, a Fujifilm-Greenwood's vice president of \r\nmanufacturing, serves on the Advisory Board of the Industrial Engineering Department. \r\nFurther, Fujifilm has had 23 Clemson co-op students since 1992 and recently enlisted \r\nseveral industrial engineering students to help address concerns related to process issues. \r\nIn recognition of his contributions to the international partnership between the United \r\nStates and Japan, to the state and constituency of South Carolina, and to the betterment of \r\nhis communities and educational institutions, it is a distinct privilege to present Mr. \r\nMinoru Ohnishi with our first foreign national honorary degree, the Doctor of Laws. "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nWILLIAM LEON SCHACHTE, JR. \r\nDOCTOR OF LAWS \r\nOver the course of his exemplary careers as an officer and attorney in the United States \r\nNavy, Rear Admiral William Leon Schachte, Jr. has dedicated himself to the service of \r\nour nation and to the support of Clemson University. \r\nRear Admiral Schachte began his military career as a shipboard officer after graduating \r\nfrom Officer Candidate School. He later volunteered for duty in Vietnam, serving in \r\ncombat and earning the distinguished Bronze star with \"Y\" for \"courage under fire and \r\ninspiring leadership.\" After receiving a law degree from the University of South Carolina \r\nunder the Navy's Excess Leave Program, he furthered his service to our country through \r\nvarious assignments of increasing responsibility leading to over 10 years at the Pentagon. \r\nRear Admiral Schachte later received a Master of Laws degree in international law with \r\nhighest honors from the George Washington University Law School. \r\nAn authority on the law of the sea, Rear Admiral Schachte has served as Department of \r\nDefense Representative for Ocean Policy Affairs, in which capacity he was senior \r\nspokesman for the Secretary of Defense and the Chairman of the Joint Chiefs of Staff. \r\nRear Admiral Schachte demonstrated his skills in international diplomacy in law of the \r\nsea negotiations that ended in resolution of complex and sensitive issues with Russia, \r\nCanada, Greece, Turkey, Japan, and several Latin American and South Pacific nations. In \r\nacknowledgement of his diplomatic successes and his expertise in international ocean \r\nmatters, he was nominated by the Department of Defense to represent the United States at \r\nthe law of the sea tribunal in Hamburg, Germany. \r\nIn his final military post as Acting Judge Advocate General of the Navy, he served as \r\nthe senior uniformed lawyer in the Navy and Marine Corps, as personal legal and policy \r\nadviser to the Secretary of the Navy, the Chief of Naval Operations and the Commandant \r\nof the Marine Corps. \r\nOver his outstanding record of service to our country, he has earned numerous personal \r\nawards, including the highest peacetime awards from both the Department of Defense and \r\nDepartment of the Navy, and he has received the prestigious Legion of Merit award twice. \r\nAs a testimony to his religious faith, Rear Admiral Schachte was the keynote speaker at \r\nthe 1995 Annual Mayor's Prayer Breakfast in Augusta, Ga. He was also the keynote \r\nspeaker at the largest Mayor's Prayer Breakfast in America. \r\nRear Admiral Schachte's leadership service to Clemson University began early at \r\nClemson. As a student, he served as president of both his freshman and sophomore classes \r\nand went on to serve as president of the Student Senate. He also served as news editor of \r\nthe Tiger, vice president of the Tiger Brotherhood, first president of the Interfraternity \r\nCouncil and president of Sigma Alpha Zeta, the first social fraternity at Clemson. \r\nAdditionally, he was elected senator and later governor of the South Carolina State \r\nStudent Legislature. \r\nRear Admiral Schachte continues to serve the University as a member of the College of \r\nArchitecture, Arts and Humanities Advancement Board and as a Legislative Advocate. \r\nWe hold Rear Admiral William L. Schachte and his lifetime achievements in the \r\nhighest esteem. In recognition of his remarkable service to the United States of America \r\nand his contributions to Clemson University, it is a distinct privilege to present him with \r\nthe Doctor of Laws honorary degree. "
    },
    {
        "page_number": "7",
        "text": "Awards \r\nBOARD OF VISITORS GRADUATE TEACHING ASSIST ANT A WARD \r\nThe Graduate Teaching Assistant Award was established to recognize the valuable \r\ncontributions that graduate. teaching assistants make to the education of Clemson \r\nundergraduate students. Two individuals are selected each year from nominations by \r\nstudents and endorsed by University faculty. A bronze medallion is presented to each \r\nrecipient, and the award carries with it a stipend of five hundred dollars. \r\nBOARD OF VISITORS GRADUATE TEACHING ASSISTANT AWARDS FOR 1999 \r\nALAN RUSSELL CANNON \r\nGreenville, SC \r\nVICTOR FREDERICK SEAMON \r\nBurlington, NC \r\nFACULTY SCHOLARSHIP AWARD \r\nEstablished at Clemson University in 1959, this award is presented by the faculty of \r\nClemson University to the member of the graduating class who has the highest scholastic \r\nachievement. All graduates who have completed the requirements for the bachelor's \r\ndegree since the last commencement exercise and who have completed at Clemson at least \r\n75 percent of the work required for graduation shall be eligible for consideration. \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AWARD FOR AUGUST 1999 \r\nMELISSA LYNN NEWMAN \r\nNorth Augusta, SC \r\nERIK KRISTOPHER OTTO \r\nShepherdstown, WV \r\nBRANDI MARIE SLATON \r\nAnderson, SC "
    },
    {
        "page_number": "8",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, \r\na senior faculty member, with the college baton, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the \r\nAmerican Council on Education, are as follows: \r\nCollege \r\nAgriculture, Forestry and Life \r\nSciences \r\nArchitecture, Am and \r\nHumanities \r\nBusiness and Public Affairs \r\nEngineering and Science \r\nHealth, Education and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and Orange \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitecture \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocial Sciences \r\nLibrary \r\nAcademic Support \r\nInstruction \r\nCollegiate faculty follow their marshal in order of academic rank wearing academic \r\ncostumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United States wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions are \r\nspecified by a uniform code maintained by the American Council on Education. Caps are \r\nblack and are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels \r\nusually of metallic thread; other degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is to replace black velvet \r\nwith velvet in the discipline color. A second variation is a colored gown usually of the \r\nuniversity's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awarding \r\ninstitution. First, degree level is signified by the size of the hood with bachelors' smallest, \r\nmasters' larger, and doctors' quite large and of a different shape. Clemson does not award \r\nhoods to bachelors. The width of the velvet trim also conveys the degree. Secondly, the \r\ndegree is indicated by the color of the trim edging the hood to form the throat over the gown. \r\nThe most frequently seen is dark blue, which designates the doctor of philosophy (Ph.D.) \r\ndegree. Finally, the color of the hood's lining specifies the awarding institution. The colors \r\nare displayed in combinations that are drawn from heraldry. Notice that the Clemson \r\nUniversity hood is lined with purple through which is an orange chevron (a \"V\"). Although \r\nmany combinations are duplicated by dozens of institutions, Clemson is presently the only \r\ninstitution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastical, or military \r\nregalia as set forth by their professions. They are preceded by the University Marshal. Clad \r\nin a gown of office in gold and purple, the marshal wears no hood and bears the University \r\nmace. At the ceremony's close, the faculty do not exit as a part of the recessional but are \r\ndismissed, along with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "9",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present at any convocation where the University, \r\nthrough its delegated members, is acting officially. At any official convocation \r\nsuch as commencement, the University Marshal, carrying the mace, precedes \r\nthe President into the assembly. The mace rests before the President's chair or \r\nspeaker's stand throughout the ceremony, and its removal from the assembly at \r\nthe close of a convocation is symbolic of the official withdrawal of the \r\nUniversity and, thus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic \r\nclublike shape, however, is much more ancient, probably going back to man's \r\nprehistory. It is made of walnut wood and silver, with the seal of the University \r\nin gold and the University colors represented by insets of comelian (orange) \r\nand amethyst (purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the \r\noffice of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the whole \r\nbody of the institution. Clemson's chain and seal are made of silver and gold, \r\nand comelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most \r\nacclaimed goldsmiths of our era. The enamel plaques for the bacons were \r\nexecuted by the late Professor Marshall C. Bell, and the lapidary work was \r\nexecuted by the lace Mr. C. C. Wilson of Clemson University. "
    },
    {
        "page_number": "10",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green Clemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the \r\nRoyal School of Mines in Paris (1828-1832). His early profession was that of a \r\nmining engineer; however, circumstances diverted his interests into politics \r\nand the life of a southern planter, and he soon became an enthusiastic advocate \r\nof scientific agriculture. He had a career as a diplomat (charge d'affaires to \r\nBelgium, 1844-1852) and served as the first Superintendent of Agricultural \r\nAffairs in Washington (1860). As a scientist he published numerous articles in \r\nthe fields of mining, chemistry and agriculture. His varied activities included \r\nhis assistance in the founding of the Maryland Agricultural College, his support \r\nof the Morrill Act, his leadership in South Carolina after the Civil War, and \r\nhis part in founding Clemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two four-year \r\ncurricula, supplemented by two two-year preparatory courses. Today ·the \r\nUniversity has six major academic units. These are the College of Agriculture, \r\nForestry and Life Sciences, the College of Architecture, Arts and Humanities, \r\nthe College of Business and Public Affairs, the College of Engineering and \r\nScience, the College of Health, Education and Human Development, and the \r\nGraduate School. \r\nThe institution is an accredited member of the Southern Association of \r\nColleges and Schools; various curricula are accredited by the Accreditation \r\nBoard for Engineering and Technology, American Assembly of Collegiate \r\nSchools of Business, Computing Sciences Accreditation Board, Council on \r\nAccreditations of the National Recreation and Park Association, National \r\nArchitectural Accrediting Board, National Association of State Directors of \r\nTeacher Education and Certification, National Council for Accreditation of \r\nTeacher Education, National League for Nursing, and Society of American \r\nForesters. \r\nClemson is a land-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is \r\nalso heavily committed to a varied program of public service, including the \r\nwork of agricultural extension which has professional personnel located in each \r\nof the State's counties. "
    },
    {
        "page_number": "11",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO 'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "12",
        "text": "CANDIDATES FOR THE DOCTOR'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nApplied Economics \r\nSteven Wayne Lindsey --------------------------------Charlotte, NC B.A., Brigham Young University \r\nDissertation: Time Sensitive Nature of Pacenc Value: Food Addicives \r\nAdvisor: Dr. M. T. Maloney \r\nVictor Frederick Seamon _______________________________ Burlington, NC \r\nB.S., University of North Carolina-Wilmington \r\nDissertation: An Analysis of Regional and Seasonal Differences in the Cotton Basis \r\nAdvisor: Dr. K. H. Kahl \r\nYesim Rabia Subasi Ankara, Turkey \r\nB.S., Middle Ease Technical University; M.A., Clemson University \r\nDissertation: The Effect of Inflation on the Difference between Investment and Savings and the Relacion to the Twin Deficits \r\nAdvisor: Dr. M. S. Wallace \r\nEnvironmental Toxicology \r\n]in-Ying Liu Taipei, Taiwan \r\nB.S., Providence College; M.S., Tamkang University \r\nDissertation: Effects of 2,3, 7 ,8 TCDD PAHs, and ochec Endocrine Modulating Chemicals on Immune Function and Phase I and \r\nPhase 11 Metabolism in the Deer Mouse \r\nAdvisor: Dr. A. B. Bodine \r\nMargaret Mae Peden-Adams ------------------------------ Greenville, SC B.S., M.S., Clemson University \r\nDissertation: Evaluation ofXenobiotic-lnduced lmmunocoxicicy and CYP450 Induction in Wildlife Species \r\nAdvisor: Dr. A. B. Bodine \r\nGenetics \r\nYuhong Tang Sichuan, China \r\nB.S., Beijing Normal University; M.S., University of Science and Technology \r\nDissertation: Developmental and Molecular Characterization of the Fasciation Mutation in Soybean, Glycine mac (L.) Merr. \r\nAdvisor: Dr. H. T. Knap \r\nYihong Wang Ahui, China \r\nB.S., Nanjing Agriculture University; M.S., University of the Philippines \r\nDissertation: Genome Mapping and Marker Development for Localizing Disease Resistance Genes in Melon (Cucunis melo L.) \r\nAdvisor: Dr. R. A. Dean \r\nMicrobiology \r\nChristine Marie Kitsos Have rhill, MA \r\nB.S., Westfield Scace College; M.S., Clemson University \r\nDissertation: The lmmunomodulacion of Major Hisco Compatibility Class I Antigens in Human Papilloma Virus Type 16· \r\nInduced Cervical Cancer Cell Lines \r\nAdvisor: Dr. L. L. Larcom \r\nAmy Lynn Tuck ---------------------------------- Greenville, SC B.S., Bob Jones University \r\nDissertation: DNA Repair Defects in Chronis Lymphorytic Leukemia \r\nAdvisor: Dr. L. L. Larcom \r\nNutrition \r\nChristie Elaine Campbell Rogersville, MO \r\nB.S., Southwest Missouri Seate University; M.S., Clemson University \r\nDissertation: The Effect ofDomperidone on Production and Endocrine Parameters Related co Fescue Toxicosis in Beef Cattle \r\nAdvisor: Dr. D. L. Cross \r\nPlant Pathology \r\nLeonard Fcank Yourrnan Washington, DC \r\nB.A., George Washingron University; M.S., Texas A & M University \r\nDissertation: Incidence and Genetic Characterization of Fungicide Resisrnnce in Greenhouse Isolates of lkllrYill: ~ \r\nAdvisor: Dr. S. N. Jeffers "
    },
    {
        "page_number": "13",
        "text": "Zoology \r\nDavid Stewart Mizrahi Island Park, NY \r\nB.S., State University of New York College \r\nDissertation: Migratory Behavior and Ecophysiology of Semipalmated Sandpipers During Spring Migration Stopover \r\nAdvisor: Dr. S. A. Gauthreaux \r\nAndrew Stanley Mount Clemson, SC \r\nB.S., University of Tampa; M.S., College of Charleston \r\nDissertation: Nucleation of Calcite in the E3stern OySter ~ Y.ir.e.inka: Biochemical and Functional Studies of the Organic \r\nMatrix from Foliated Shell \r\nAdvisor: Dr. A. P. Wheeler \r\nGulsen Ulukoy Antalya, Turkey \r\nB.S., M.S., Mediterranean University \r\nDissertation: Studies of the Structure, Function, and Differentiation of the Trophotaeniae and Gut in Embryonic Goodeid Fishes \r\nAdvisor: Dr. J.P. Wourms \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nDOCTOR OF PHILOSOPHY \r\nIndustrial Management \r\nMehmet Barut Istanbul, Turkey \r\nB.S., M.S., Istanbul Technical University \r\nDissertation: On Allocating Capacity to Customer Orders in a Class of Make-To-Order (MTO) Production Systems \r\nAdvisor: Dr. V. Sridharan \r\nIndustrial/Organizational Psychology Mary Ann Hooten _________________________________ Mt Pleasant, SC \r\nB.S., University of Alabama-Birmingham; M.S., Clemson University \r\nDissertation: The Interaction Between Error~Bascd Training and Trainee Goal Oriencation \r\nAdvisor: Dr. R. Perlow \r\nManagement Science Laura Carmen Lancaster ________________________________ Maitland, FL \r\nB.S., Stetson University; M.S., Clemson University \r\nDissertation: A Generalization of Multiple Objective Dynamic Programming with Time~Depcndent Costs \r\nAdvisor: Dr. M. M. Kostreva \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nBioengineering \r\nStephen Daniel Ainsworth ----~-~--~---------------------Delmar, NY B.S., Rensselaer Polytechnic Institute; M.S., Clemson University \r\nDissertation: Modeling of Artery Restenosis Influenced by Endovascular Stent Geometry \r\nAdvisor: Dr. M. LaBerge \r\nMarc Long ~-~--------~~----------------''--------Cannes, France B.S., Ecole Nat Sup D'arts Et Metier; M.S., Clemson University \r\nDissertation: Reciprocating-Sliding Friction and Wear Performance of Titanium Alloys \r\nAdvisor: Dr. H. j. Rack \r\nBiosystems Engineering \r\nWayne Scott Rial ----~-~---,--~-~---------------------Bristol, TN B.S., Indiana Institute of Technology; M.Engr., Cornell University \r\nDissercation: Using Complex Permittivity to Assess the Volumecric Water Concem of Agronomic Soil \r\nAdvisor: Dr. Y. J. Han \r\nCeramic Engineering \r\nJennifer Ann Landsly --,...,.-;:-=-:---.,.,-- -------------------------Lansing, IL B.S., Purdue University; M.S., Clemson University \r\nDissertation: A Statistical Model to Predict Hazardous Waste Glass Durability \r\nAdvisor: Dr. E. C. Skaar \r\nWilliam Emmett Paradise _______________________________ Boca Raton, FL \r\nB.S., Clemson University \r\nDissertation: Characteristics of Elcctropric PLZT Thin Films Under Applied Stress \r\nAdvisor: Dr. E. C. Skaar "
    },
    {
        "page_number": "14",
        "text": "Chemistry \r\nMatthew Lewis Hartenstein Glen Rock, PA \r\nB.S., Gettysburg College \r\nDissertation' Development of Radio Frequency Atomic Emission Spectrometry for the Depth Resolved Analysis of Solids \r\nAdvisor: Dr. R. K. Marcus \r\nGlenn Edward Lawson --~----------------------------Cambridge, MA \r\nB.S., M.S., East Tennessee State University \r\nDissercacion: Preparation and CharaccerizatiOn of Fullerene Derivacives and Polymers \r\nAdvisor: Dr. Y. P. Sun \r\nElectrical Engineering \r\nGurudutt Sacish Hosangadi _______________________________ Bombay, India \r\nB.E., University of Mumbai; M.S., Clemson University \r\nDissertation: Sequential Acquisition Schemes for Direct#Sequences Spread#Spectrum Systems \r\nAdvisor: Dr. C. W. Baum \r\nCengiz Ozzaim Ankara, Turkey \r\nB.S., M.S., Middle East Technical University \r\nDissertation' Electromagnetic Fields and Currents Excited by Dipoles Normal co the Conducting Surface of Dielectric Loaded Bodies \r\nAdvisor: Dr. C. M. Butler \r\nVijay Parihar Sonipat, India \r\nB.S., M.T., Kurukshetra University \r\nDisscrcation: Process Optimization and the Development of Manufacturing Equipment for Deposition of lncer,Level Dielecnic for SJ \r\n!C's \r\nAdvisor: Dr. R. Singh \r\nArvind Ramachandran Raghavan --,-----,-,------------------------Bangalore, India \r\nB.E., Mangalore University; M.S., Clemson University \r\nDissercacion: Protocols for Distributed Direcc#Sequence Packet Radio Networks \r\nAdvisor: Dr. C. W. Baum \r\nKorkut Yegin Tekirdag, Turkey \r\nB.S., Middle East Technical University; M.S., Clemson University \r\nDissertation: Broadband Wire Antennas and Improved Integral Equation Methods for Penetration into Body of Revolution \r\nSuuctures \r\nAdvisor: Dr. A. Q. Marcin \r\nEngineering Mechanics \r\nRunnong Huan ___________________________________ N. anjin1 China \r\nB.S., M.S., Shanghai Jiaotong University \r\nDissenation: Finite Element Formulacion of Asympcotic and Exact Radiation Boundary Condicions \r\nAdvisor: Dr. L. L. TI1ompson \r\nEnvironmental Engineering and Science \r\nJohn Mathis Rudolph ---,..,...,,.....-,,---0----,,,.,..------------------------ Paducah, KY B.E., Vanderbilt University; M.S., Stanford University \r\nDissertation: Bacterial Responses to Mixtures of Glucose, Benzoate and Salicylate in Continuous Culture \r\nAdvisor: Dr. C. P. L. Grady \r\nMaterials Science and Engineering \r\nZhicheng Cao ,-,------0--0--c-'.C----=-,,.--:----------------------Jilin, China \r\nB.S., Fudan Universiry; M.S., Birla Institute of Technology \r\nDissertation' Synthesis and Characterlzation of Phosphate Ceramics Derived Thwugh Sol-Ge l Process \r\nAdvisor: Dr. B. 1. Lee \r\nMathematical Sciences \r\nXibin Chen -------------------------------- ---- Hubei, China \r\nB.S., Nankai University \r\nDissertation' Methods of Feasible Directions for Nonlinear Pwgramming' Theory and Algorithms \r\nAdvisor: Dr. M. M. Koscreva \r\nDonald Dale Mills _______________________________ Oglesby, IL \r\nB.S., Bob Jones University; M.S., Clemson University \r\nDissertation' Root-based Polynomial Compositions over Finite Fields \r\nAdvisor: Dr. J. V. Brawley \r\nDr. X. Gao \r\nMechanical Engineering \r\nTimothy Allan Conover --------------------------------Clemson, SC \r\nB.S., M.S., Clemson University \r\nDissenacion: Experimental Study of Heat and Mass Transfer in a Buoyant Councercurrent Exchange Flow \r\nAdvisor: Dr. D. E. Beasley "
    },
    {
        "page_number": "15",
        "text": "Textile and Polymer Science \r\nZhentao Mao =---=:---:--,-,.------------------------------liangsu, China · B.E., M.E., China Textile University \r\nDissertation: Modeling and Experimental Studies of the Process of Ultrasonic Bonding of Non-wovens \r\nAdvisor: Ot. B. C. Goswami \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF EDUCATION \r\nVocational and Technical Education \r\nMichael Wayne Freeman Chesterfield, SC \r\nB.S., M.H.R.D., Clemson University \r\nDissertation: Effectiveness and Costs of Hybrid Audiographics and Instructional Television for Delivering Graduate Distance \r\nEducation \r\nAdvisor: Ot. S. T. Ingram \r\nJimmy Ray Holliday -,,.,--------------------------------Six Mile, SC \r\nB.S., M.S., Clemson University \r\nDissertation: An Assessment of Student Attitudes Toward Computer Based Audiographics Distance Education \r\nAdvisor: Ot. C. D. White \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction \r\nPatricia McMillan Chandler Myrtle Beach, SC \r\nB.S., M.N.S., Clemson University \r\nDissertation: Conveying the Vision of Science: Mera-lessons on Inquiry Found in a Content Analysis of Two High School Biology \r\nTextbooks \r\nAdvisor: Ot. W. H. Leonard \r\nEudora Hubbard Dickey --------------------------------Wellford, SC \r\nB.A., Norfolk State University; M.Ed., Virginia Commonwealth University \r\nDissenation: Envisionmenc Building: African American Girls Reading African American Texts \r\nAdvisor: Ot. B. E. Naff \r\nPatricia Eck Smith Easley, SC \r\nB.A., Florida Atlantic University; M.Ed., University of South Carolina \r\nDissertation: Applying Kegan's Constructive-Developmental Theory of the Evolving Self and the Role of Experience to the \r\nLeadership Effectiveness of Teacher Leaders \r\nAdvisor: Ot. D. M. Switzer \r\nSusan Lee Wainscott Clemson, SC \r\nB.S., Miami University-Oxford; M.Ed., Clemson University \r\nDissertation: Promise and Performance: Determining the Relationship of Advanced Placemcnc Mathematics with Actual \r\nPerfonnance Rigorous Undergraduate Mathematics Coursework \r\nAdvisor: Ot. R. L Blackboum \r\nEducational Leadership \r\nCorey Renell Amaker Lexington, SC \r\nB.A., M.Ed., Clemson University \r\nDissertation: Persistence of African American Scudencs at Predominantly White Universities: Bicultural Efficacy, Social \r\nDevelopment and Student Outcome \r\nAdvisor: Ot. R. A. Marion \r\nParks, Recreation, and Tourism Management \r\nKenneth Evan Silverberg ----,,-,-,--,.,-----=,,---------------------Salt Lake City, UT \r\nB.S., Arizona State University; M.S., University of Wyoming \r\nDissertation: An Idencification and Explication of a Typology of Public Parks and Recreation Volunteers \r\nAdvisor: Ot. S. ). Backman "
    },
    {
        "page_number": "16",
        "text": "CANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nPaul Marcus Earle -----------Central, SC Heidi Elizabeth Fanning _________ Neeses, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nFurman R. Dukes __________ Reevesville, SC Shelley Grant Stevenson ________ Swansboro, NC \r\nLauren Elizabeth Edgington Clermont, FL Gaixia Zhang Clemson, SC \r\nCarolyn L. Reynolds Columbia, SC \r\nAnimal and Food Industries \r\nEun-ju Kim _____________ Seoul, Korea Christopher Robert Talley -------- Salem, SC \r\nYannick Le mar Fargues, France \r\nAnimal Physiology \r\nStaci Neas Johnson Greeneville, TN \r\nAquaculture, Fisheries, and Wildlife Biology \r\nKimberly Ann Bjorgo _________ Clemson, SC Robert William Starkey _________ Warren, OH \r\nEmily Cummings Cope Lodge, SC \r\nBiochemistry \r\nMark Taylor Corbett ________ Norfolk, VA \r\nBotany \r\nKaren Carlson Hall ------- Bryson City, NC \r\nCrop and Soil Environmental Science \r\nChristopher Ryan Bond ________ Winnsboro, SC Michelle Leigh Paris --------- Manasquan, NJ \r\nKe llee Suzanne McCarley Morningside, MD \r\nEntomology \r\nEric Scott Paysen ___________ Tega Cay, SC Will Karlisle Reeves __________ Atlanta, GA \r\nMichael Petridis Kozani, Greece \r\nEnvironmental Toxicology \r\nSandra L. Knuteson _________ Whitewater, WI Eric Wilson Montie ________ Old Saybrook, CT \r\nForest Resources \r\nBrian Sears Meccs.,....,,--..,..-------North Augusta, SC David Burke Yandermast _______ .South Salem, NY \r\nCharlene Louise Neihardt Traverse City, Ml \r\nGenetics \r\nGinger Anne Swire-Clark _____ Beavercreek, OH \r\nHorticulture \r\nYing Li ----------- Guangan, China \r\nMicrobiology \r\nKerri Marie Worthy _________ Seneca, SC \r\nZoology \r\nDonald Galen DeHay _______ .Moncks Comer, SC Steven M. Lohr ----------- Beaufort, SC \r\nKenneth H. Kozak Sparta, NJ \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nMASTER OF ARCHITECTURE \r\nWilliam Winfred Decker _______ -,,-St Louis, MO Leigh Angela Marcin ________ Spartanburg, SC \r\nWatson Lee Dom III Greenwood, SC Anjali Salve Pune, India \r\nPhillip Kennerh Huggins, Jr. Charleston, SC Robert David Tallarico Mt Pleasant, SC \r\nChristopher William Lepine Rock Hill, SC \r\nMASTER OF CITY AND REGIONAL PLANNING \r\nAri Daman New Delhi, India "
    },
    {
        "page_number": "17",
        "text": "MASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nMichael David Dunlap -------- Greenville, SC Robert Clifford Judd ---------Greenville, SC \r\nSidney Jeffrey Hymes Greensboro, NC \r\nMASTER OF ARTS \r\nEnglish \r\nJason Matthew Berry _________ Concord, MA Amanda Ann Lirchfield ____ Grosse Poime Woods, Ml \r\nMark Phillip Brodie Queens Village, NY Melinda Kay Morrow Springfield, MO \r\nKimberly Laine Dunscombe Seneca, SC Suzanne Marie Richard Laurens, SC \r\nSteven Scott Hazle Greenville, SC \r\nHistory \r\nMarcus Keith Gore ________ Myrtle Beach, SC Christopher Charles Pinkney ______ Raytown, MO \r\nProfessional Communication \r\nDustin Lee Annan ---------- Decatur, AL Scott Michael McCulloch ------ -Richmond, VA \r\nJodi Dawn Fogle -----------Conway, SC Michael j. Waters Aiken, SC \r\nJacquelynn Michelle Jordan Queens. NY John King Williams, Jr. Spartanburg, SC \r\nAmber Dahn Lofthouse Billings, MT \r\nMASTER OF SCIENCE \r\nArchitecture \r\nShilpa Chandramohan Shinde __ Maharashrra, India \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nMASTER OF BUSINESS ADMINISTRATION Nikhil Aggarwal __________ Amritsar, India Giancarlo Ramiro Martini _________ Erie, PA \r\nElena Agrizzi Treviso, Italy David Glenn Mayemik Simpsonville, SC \r\nBrian Lee Barbery Greenville, SC Erin Kate Meehan Aiken, SC \r\nLaura Basso T reviso, Italy Damjan Mencej Ljubljana, Slovenia \r\nLuigi Becherini Vicenza, Italy Michelle Anne Miller Greer, SC \r\nStefano Bello Marostica, Italy Matthew Stephen Monaghan ___ Lauenheath, England \r\nDaniel Robert Bradley Chatham, NJ Brian Keith Morgan Greenville, SC \r\nGregor Bremik Ljubljana, Slovenia George Lawrence Moser Raymond, ME \r\nPatti Harrison Bridges Honea Path, SC Tamara L. Nerwin Seattle, WA \r\nDerrick Weldon Brown Augusta, GA Manoj Nigam Greenville, SC \r\nJoseph M. Caligiuri Buffalo, NY Judith D. Niver Taylors, SC \r\nMatthew Scott Cardone Greenville, SC Ashley Lynette Page Shreveport, LA \r\nJose Gabriel.Carrasco Panama City, Panama William David Pcheny · Taylors. SC \r\nSena Judge Claxton Simpsonville, SC Andreja Pogacnik Kranj, Slovenia \r\nGary Arthur Clayton Blue Springs, MO janez Pretnar Domzale, Slovenia \r\nAjaykumar H. Dedhia Mumbai, India Salvatore Gino Renzo Eastchester, NY \r\nEdward Lee Devore Greenville, SC Stephanie Marie Rouse Mauldin, SC \r\nTimothy Dean Ellis Simpsonville, SC Primoz Rutar Maribor, Slovenia \r\nGary Dean Enterline Greenville, SC Christine Mary Ryal! Orlando, FL \r\nJanez Ferbar Ljubljana, Slovenia john Orlando Sacco Cleveland, OH \r\nRoberto David Filippano Toronto, Ontario Marco Samel Padova, Italy \r\nZachary Robert Frank Woodstock, GA Richard Joseph Schellhammer, Jr. Nashua, NH \r\nJoseph Jerome French International Falls, MN Stephen Thomas Schilf Clemson, SC \r\nJohn Michael Garbarino New York, NY Kimberli Lollis Scott Gray Court, SC \r\nAmanda Denise Giles Spartanburg, SC Renata Smit Ljubljana, Slovenia \r\nHubert Gleissner Munich, Germany Riccardo Speranza Cassola, Italy \r\nMichelle Lee Gosnell Campobello, SC Devin Patrick Stelljes Syracuse, NY \r\nRichard Paul Grammer Hanover, PA Jeffrey Scott Scull Greenville, SC \r\nKenneth David Hiott Williamston, SC Petra Tavcar Ljubljana, Slovenia \r\nSharon Lynn Horensky Ellicott City, MD Carter Grosvenor Thompson Greenville, SC \r\nMichael Scott Hunnicutt Greenville, SC Melissa Toffoli Treviso, Italy \r\nChristopher Shannon Hunt Anderson, SC Andrea Venturato Treviso, lraly \r\nVikas Jain Chandigarh, India Giorgio Venturato Treviso, Italy \r\nJon William Jaskwhich Greenville, SC Mojca Vrecar Ljubljana, Slovenia \r\nJitendra Gurunath Joshi Bombay, India Joseph Al Westmoreland Gainesville, GA \r\nMichael john Koma Greenville, SC Robert Lawrence Wiggins, Jr. Clemson, SC \r\nMatej Linke Ljubljana, Slovenia Jason Brooks Williams Powdersville, SC \r\nRomana Linke Ljubljana, Slovenia Gregory Alan Wingo Lewisburg, WV \r\nJames Scott Magnuson Simpsonville, SC CharleeAnne Michelle Wunderlin St Louis, MO \r\nSuresh Kumar Maramreddy Hyderabad, India David Bruce Yates Kingsport, TN \r\nRobert Richardson Martin Ill Georgetown, SC Greg Yurkovich Newport Coast, CA "
    },
    {
        "page_number": "18",
        "text": "MASTER OF PROFESSIONAL ACCOUNTANCY \r\nDavid Lawrence Alexander _______ Anderson, SC Karen Lee Hoover __________ Hanahan, SC \r\nJason Travis Bayne Greer, SC Velislav Kirilov lltchev Sofia, Bulgaria \r\nJason E. Causey Wheeling, WV Matthew David Lee Marietta, GA \r\nRebecca Louise Comer Houston, TX Charles Arthur Tegen Central, SC \r\nKathryn Elizabeth Craig Mt Pleasant, SC \r\nMASTER OF PUBLIC ADMINISTRATION \r\n(Master of Public Administration is jointly administered by \r\nClemson University and the University of South Carolina.) \r\nMark Daniel Colburn ---------- Naples, FL David Michael Collins, Jr. Landrum, SC \r\nAlma Waddell Miller ________ Spartanburg, SC \r\nRobert M. Welborn, Jr. Spartanburg, SC \r\nMASTER OF ARTS \r\nEconomics \r\nPrateek Goorha ---------- Bhopal, India \r\nMASTER OF SCIENCE \r\nApplied Psychology \r\nMarcus Edward King--------- Anderson, SC Brandy Leigh Watson -------- Bossier City, LA \r\nApplied Sociology \r\nSonya Takia Henley -----------.,..Saluda, SC Jennifer Amy Schultheis _______ Blue Poinc, NY \r\nRichard Matthew Kivior Hickory, NC \r\nIndustrial Management \r\nGokhan Ozdemir __________ Ankara, Turkey Rhotarus Olitia Rice --------- Columbia, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCeramic Engineering \r\nJeffrey Christian Anderson Allison Park, PA \r\nElectrical Engineering \r\nCurtis Andrew Dalton _________ Columbus, OH David Ernest Walder _________ Columbus, OH \r\nWarren Scott Page Raymond, NH Linda Pauline Wheeler Columbus, OH \r\nJon Noah Seibel North Bay, Ontario Lawrence Wilson Lithonia, GA \r\nEnvironmental Engineering and Science \r\nDean Alan Sawyer Mauldin, SC \r\nMASTER OF SCIENCE \r\nBioengineering \r\nPaul Daniel Amarant~----- North Miami Beach, FL Clark Rutherford Dickerson ______ St Leonard, MD \r\nRebecca Anne Caldwell Aiken, SC Joseph Brent Knight Huntsville, AL \r\nPeter Michael Cannell Annapolis, MD Bradford Graydon Toulmin Atlanta, GA \r\nChemistry \r\nStewart Peden Curry __________ Marion, SC Clifford Wayne Padgett _________ Cowpens, SC \r\nCivil Engineering \r\nAshwin Arv ind Agate __________ Pune, India Ali Asim Qizilbash --------___,,-Sebastian, FL \r\nTheodore Martin Beecher Abingdon, MD Shams E. Riffat Bangladesh, India \r\nAndrew Kenneth Kennedy Virginia Beach, VA Thomas Scott White Spartanburg, SC \r\nCharles Earle Kennedy Pinopolis, SC \r\nComputer Engineering \r\nIrene Ester Collado Di Nubila ______ Cuenca, Spain Padmashri Sugavananathan _______ Madras, India \r\nScott Patrick McMillan Augusta, GA \r\nComputer Science \r\nIshraq Mohammed Ahmed -,-,.----Visakhapamam, India Rajeshkumar Kanayalal Sahetiya -----Bombay, India \r\nPushkar Balkrishna Deshmukh Pune, India Karl Stanley Self Fairhope, AL \r\nMin Jiang Jiang Xi, China Brent Adam Shelly Telford, PA \r\nGregory Michael Kesden Norcross, GA Denise Eileen Shoup Greenville, SC \r\nAnthony Orapallo lll Philadelphia, PA Subbulakshmi Sundararaman Tamilnadu, India \r\nTushar Deepak Pandit Bombay, India \r\nElectrical Engineering \r\nRoman Joseph Bednarek--------Syracuse, NY Ann Marie Ramos ----------::::-:-_Laredo, TX Lee Ward Collins Chatham, VA Saiyue Yu Zhejiang, China \r\nMark Adriaan Kwist Summerville, SC )inlin Zhang Hebei, China "
    },
    {
        "page_number": "19",
        "text": "MASTER OF PROFESSIONAL ACCOUNTANCY \r\nDavid Lawrence Alexander _______ Anderson, SC Karen Lee Hoover---------- Hanahan, SC \r\nJason Travis Bayne Greer, SC Velislav Kirilov lltchev Sofia, Bulgaria \r\nJason E. Causey Wheeling, WV Matthew David Lee Marietta, GA \r\nRebecca Louise Comer Houston, TX Charles Arthur Tegen Central, SC \r\nKathryn Elizabeth Craig Mt Pleasant, SC \r\nMASTER OF PUBLIC ADMINISTRATION \r\n(Master of Public Adminisrration is jointly administered by \r\nClemson University and the Universicy of South Carolina.) \r\nMark Daniel Colburn __________ Naples, FL Alma Waddell Miller ________ Spartanburg, SC \r\nDavid Michael Collins, Jr. Landrum, SC Robert M. Welborn, Jr. Spartanburg, SC \r\nMASTER OF ARTS \r\nEconomics \r\nPraceek Goorha --------~Bhopal, India \r\nMASTER OF SCIENCE \r\nApplied Psychology Marcus Edward King _________ Anderson, SC Brandy Leigh Watson ________ Bossier City, LA \r\nApplied Sociology \r\nSonya Takia Henley ---------_,.,Saluda, SC Jennifer Amy Schukheis \r\nRichard Matthew Kivior Hickory, NC \r\n-------Blue Point, NY \r\nIndustrial Management \r\nGokhan Ozdemir ---------- Ankara, Turkey Rhotarus Olitia Rice ---------Columbia, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCeramic Engineering \r\nJeffrey Christian Anderson ____ Allison Park, PA \r\nElectrical Engineering \r\nCurtis Andrew Dalton -------- Columbus, OH David Ernest Walder -------- Columbus. OH Warren Scott Page Raymond, NH Linda Pauline Wheeler Columbus. OH \r\nJon Noah Seibel North Bay, Ontario Lawrence Wilson Lithonia, GA \r\nEnvironmental Engineering and Science \r\nDean Alan Sawyer Mauldin, SC \r\nMASTER OF SCIENCE \r\nBioengineering \r\nPaul Daniel Amarant ______ North Miami Beach, FL Clark Rurherford Dickerson St Leonard, MD \r\nRebecca Anne Caldwell Aiken, SC Joseph Brent Knight --------- Huntsville, AL \r\nPeter Michael Cannell Annapolis. MD Bradford Graydon Toulmin Atlanta, GA \r\nChemistry \r\nStewart Peden Curry ------ ----Marion, SC Clifford Wayne Padgeu -------- Cowpens, SC \r\nCivil Engineering \r\nAshwin Arvind Agate - -------- Pune, India Ali Asim Qizilbash __________ Sebastian, FL \r\nTheodore Martin Botcher Abingdon, MD Shams E. Riffat Bangladesh, India \r\nAndrew Kenneth Kennedy Virginia Beach, VA Thomas Scott Whice Spartanburg, SC \r\nCharles Earle Kennedy Pinopolis, SC \r\nComputer Engineering \r\nIrene Escer Collado Di Nubila ______ Cuenca, Spain Padmashri Sugavananachan ------ Madras, India \r\nScott Patrick McMillan Augusta, GA \r\nComputer Science \r\nlshraq Mohammed Ahmed ____ Visakhapatnam, India Rajeshkumar Kanayalal Sahetiya Bombay, India \r\nPushkar Balkrishna Deshmukh Pune, India Karl Stanley Self ___________ Fairhope, AL \r\nMin Jiang Jiang Xi, China Brent Adam Shelly Telford, PA \r\nGregory Michael Kesden Norcross, GA Denise Eileen Shoup Greenville, SC \r\nAnthony Orapallo Ill Philadelphia, PA Subbulakshmi Sundararaman Tamilnadu, India \r\nT ushar Deepak Pandit Bombay, India \r\nElectrical Engineering \r\nRoman Joseph Bednarek ________ Syracuse, NY Ann Marie Ramos----------- Laredo, TX Lee Ward Collins __________ Chatham, VA Saiyue Yu Zhejiang, China \r\nMark Adriaan Kwist Summerville, SC Jinlin Zhang Hebei, China "
    },
    {
        "page_number": "20",
        "text": "Engineering Mechanics \r\nPrabhu Bharathan Clemson, SC \r\nEnvironmental Engineering and Science \r\nKim-Lee Murphy--.,..-------- Wallingford, CT Amy Hart Ringberg _________ Chittenango, NY \r\nRobert William Popelka Mt Pleasant, SC Jennifer Ann Rubrake Warren, OH \r\nMaisha Nneka Richard New Orleans, LA Krista Berry Shurtz Shawnee, KS \r\nIndustrial Engineering \r\nGuillaume Michael Liebhold _ Le Chareau D'Olonne, France Subodh Sunderlal Shiohare _______ Nagpur, India \r\nGeorge Mcleland Nickles III Greenville, SC \r\nMathematical Sciences \r\nJirapha Limbupasiriporn ____ Nakhon-Parhom, Thailand Victoria lvanova Pashova _______ Bourgas, Bulgaria \r\nMechanical Engineering \r\nManuel). Daskalos _________ Charleston, WV Matthew Craig Rice _________ Rock Hill, SC \r\nJeffrey Daniel Ferguson Sumter, SC James Bryan Taliaferro Laneview, VA \r\nSubhadeep Gan Calcutta, India Yuhuan Tong Nan) in, China \r\nMingjie Lin Ma'anshang, China Jiong Wan Ningxia, China \r\nEdward Lee McGrath Easley, SC \r\nPhysics \r\nDonna Jane Mullenax------ Horse Shoe Run, WV Amy Liann Pope ____________ Seneca, SC \r\nJeannette Marie Myers Richtoeld, MN Jonathan Edwin Wromy North Litrle Rock, AR \r\nTextile Chemistry \r\nLili Ding ___________ Zhejiang, China \r\nTextile Science \r\nWei Tian -----------Nanjing, China \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\nFaye Elizabeth Allen-------- Bowersville, GA Virginia Ann Sanders Skelton ______ Hartwell, GA \r\nAnnette Christian Sayles Athens, GA \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nSerita Wakefield Acker ________ Anderson, SC Julia Lee McBride __________ Walhalla, SC \r\n). Michael Bonnette Lugoff, SC Jodie Harr Nicholson Greenwood, SC \r\nTeresa A. Brookshire Mountain City, TN Ashley Claire Prickett Sr Matthews, SC \r\nEllen Harper Burriss Belton, SC Mani Wallace Reed Spartanburg, SC \r\nLinda Louise Burler Clemson, SC Alla H. Sifuentes Moscow, Russia \r\nApril Lynn Eller Long Creek, SC Diane C. Stanton Seneca, SC \r\nDawn Marie Foltz Greenville, SC Lisa Michelle Stone Cenrral, SC \r\nJennifer Ann Gillespie Greenville, SC Judie E. Ulsh Greenville, SC \r\nMichael Robert Hawkins Anderson, SC Jason Scott Walter Simpsonville, SC \r\nBabette Bouvier Jones Greer, SC Trina La'Toyia Wilson Dalzell, SC \r\nMarilyn Sue Jordan Simpsonville, SC Jennifer Yeargin-Bush Simpsonville, SC \r\nDoris Lynnette Lee Anderson, SC \r\nMASTER OF INDUSTRIAL EDUCATION \r\nJohn Kevin Atchley __________ Pauline, SC Kem Thomas Cox _________ Bennettsville, SC \r\nElizabeth A. Buege Madison, Wl Scott R. Schoenwiesner Little Silver, NJ \r\nSarah Heath Cooke Warwick, NY Joseph Graham White Berea, KY \r\nJeffery Lynn Corley Columbia, SC \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nJoyce Michelle Beatty __________ .Seneca, SC Catherine Ann Marrin Lariff ------ Columbia, SC \r\nAaron Boyles Easley, SC Leslie Ann Lollis Greenville, SC \r\nTraci Taylor Boyles Easley, SC John Mark McCall Pelzer, SC \r\nTerrance Henry Bradley Lexington, SC Jay Bradley Mcjunkin Liberty, SC \r\nHoward Fyfe Campbell, Jr. Philadelphia, PA Janet T. Mills Pendleton, SC \r\nMelissa Odom Cole Columbia, SC Brenda Lamb Richardson Clinton, SC \r\nPhyllis Myles Gaines Honea Path, SC Margaret H. Spivey Anderson, SC \r\nSarah Doran Hooks Anderson, SC Page Hucks Wofford Pinopolis, SC "
    },
    {
        "page_number": "21",
        "text": "Counseling and Guidance Services \r\nCarol Ann Burns ___________ Laurens, SC Tonya Renee Johnson Piedmont, SC \r\nLois W. Capps Easley, SC Kimberly Seaford Kuru _________ Easley, SC \r\nChristine Frances Chatellier Summerville, SC Linda Harper Mattern Greenville, SC \r\nPamela Propes Childers Easley, SC Tricia Nalepa Mayer Anderson, SC \r\nJudy Cochran Coble Simpsonville, SC Kevin Joseph McSloy Easley, SC \r\njohn Preston Darby, Jr. Seneca, SC Kristi Faye Padgett Easley, SC \r\nKenyon Dion Foster Spartanburg, SC Elbert Mackeruie Shell Laurens, SC \r\nJennifer Lyn Halliwell . Columbia, SC Ann M. Sistare Pickens, SC \r\nWendy Michelle Hamilton Fort Mill, SC Cory 0. Williams Anderson, SC \r\nLemario B. Jackson Conway, SC \r\nElementary Education \r\nDenise T. Cothran ---------Piedmont, SC Gary Ruehl Mohr, Jr. _________ Pendleton, SC \r\nGwendolyn McCurry Duncan West Union, SC Julia Beth Nicholson Westminster, SC \r\nRebecca Michelle Gram Seneca, SC Barbara Wimphrie Laurens, SC \r\nReading \r\nKristin Lee Lane ----------- Seneca, SC Staci Steadman Stein ,..---------Anderson, SC \r\nMoriah S. Larson Central, SC Michelle LeMay Woosley Easley, SC \r\nSecondary Education \r\nLaura Christine Bellum _______ Darlington, SC Amanda Gail King ___________ Easley, SC \r\nFaith Elizabeth Bruner ---------=Clemson, SC Randall Dean Newton Donalds, SC \r\nYolanda Michelle Harrison Greenville, SC Brian Glenn Owens Anderson, SC \r\nKaren Cheryl Hildebran Seneca, SC Alison Evans Rainey Starr, SC \r\nSpecial Education \r\nLeslie Marie Barnes -----------Irmo, SC Angela Michelle Wilson Phillips ____ Williamston, SC \r\nCassie Serdearest Cagle Aiken, SC Erica Heather Scheffler Acworth, GA \r\nTonya Nechole Gray Hemingway, SC Karla Mae Schu tz_---,---------~ Easley, SC \r\nJennifer Renee Hays Ringgold, GA Kristin Allison Willis Syracuse, NY \r\nShaley D. Klepfer Greenwood, SC Tracey Anne Wolf Simpsonville, SC \r\nBeth Ann Murphy Bellevue, WA \r\nMASTER OF SCIENCE \r\nNursing \r\nYolanda Yvette Levy \r\nSara Lynn Wallenius \r\n_________ Fort Mill, SC Linda Lorraine Williams ------- Greenwood, SC \r\n---------Seneca, SC \r\nParks, Recreation, and Tourism Management \r\nMark Daniel Colburn ---------,,.---Naples, FL Stephen Daniel Ross \r\nThomas Keith Dismukes Spartanburg, SC \r\n_________ Granby, CT "
    },
    {
        "page_number": "22",
        "text": "CANDIDATES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nWILLIAM BUSSE WEHRENBERG, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\n••Tracey Elaine McCarroll ________ Carmel, IN Jennifer Anne Smirh __________ Gilbert, SC \r\nBACHELOR OF SCIENCE \r\nAnimal Industries \r\nJason Conrad Fleck ----------- Lugoff, SC Mollie Susan Richardson ________ Newberry, SC \r\nAquaculture, Fisheries, and Wildlife Biology \r\n•John Raymond Boyd ________ Winchester, TN William Addison Stuckey lll ---------'Sumter, SC \r\nPatricia Lea Brueggeman Longwood, FL \r\nBiochemistry \r\n••Marian Calhoun Bryan _______ Edisto Island, SC ••Brad Eric Hollister _________ Greenville, SC \r\nBiological Sciences \r\n*Rachel Marguerite Barker _______ Charleston, SC Kelly Marie Phillips __________ Barnwell, SC \r\nDawn Pele Brackro Las Vegas, NV •Caroline Ackins Porter Mt Pleasanc, SC \r\nElizabeth Ashley Earl Greenville, SC Jennifer Ann Schepp Columbia, SC \r\nJennifer Marie Nocico Deltona, FL Darrell Lamont Shuler Sc Mauhews, SC \r\nForest Resource Management \r\nMichael Andrew Bozard --------- Easley, SC Phillip Kevin Poore ___________ Be Icon, SC \r\nJames Samuel Brown Anderson, SC Alicia Kay Wood Roebuck, SC \r\nJamie Michelle Browning Greenville, SC \r\nHorticulture \r\nThomas Jefferson Dossect lll ______ Summerville, SC Alphurd Blade Waldrop -~------Gre nville, SC \r\nMary Kachryn Doyle Havectown, PA *William Mauhew Wisenbaker Germantown, MD \r\nBlaire Laceia Nicole Elam Moncgomery, TX \r\nMicrobiology \r\nHeacher Leigh Erek--- -------- Naples, FL Andrea Lucia Pauerson ________ Antreville, SC \r\nDaniel Wallace Fices Columbia, SC Cynthia Riuer Olar, SC \r\nKelly Annecte Guinn Edgemoor, SC Christopher Alan Saski Seneca, SC \r\nDavid Chakeris Henry Abbeville, SC Kenca Anrron Scokes Greenville, SC \r\nLori Michelle Lomax Greenville, SC \r\nPackaging Science \r\nKimberly Michelle Swine Charleston, SC \r\nPre-professional Studies \r\n... Holly Brooke Gibson Gaffney, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nJAMES FRAZIER BARKER, Dean \r\nBACHELOR OF FINE ARTS \r\nKelly Noelle Bengier __________ Orlando, FL •Dennis Lamar Scevens, Jr. ______ Spartanburg, SC \r\n.. Jennifer Dawn Aucry Chappell Easley, SC •Fredrick Melcon Taylor Ill Tampa, FL \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\nGarth Alexander Castle --------Frederick, MD Jason Lamberc Crossway -------- Beaufort, SC \r\nSceven Auscin Charlton Irmo, SC *Penelope Britcon Saulnier Greenville, SC \r\nBACHELOR OF ARTS \r\nDesign \r\nAllison Lynn Couick ________ Rock Hill, SC *Charles David Diehl Clemson, SC \r\nDaniel Ryan Culbercson Greenville, SC Cacherine Lourisa Earls Frischknecht ____ Blacksburg, SC \r\nEnglish \r\nSheneka M. Black ---------- San Diego, CA ••Sarah Cacherine Rees _________ Bowie, MD \r\nAmy Helen Farrell Simpsonville, SC Aucumn Rae Sam Norcross, GA \r\nJames Edgar Moody lll Greenville, SC Ronald Edward Trescoc, Jr. Spring Grove, PA \r\nAnchony ]on Narducci Los Gatos, CA Lagina Patrice Wade Spartanburg, SC \r\nTaylor Marie Pelick Stone Mouncain, GA "
    },
    {
        "page_number": "23",
        "text": "History \r\nTaylor Milynn Bridges -~--------Easley, SC Nancy Melinda Ladson Georgetown, SC Howard Richmond Brown II Jasper, AL Jacob William Mellin _________ Columbia, SC \r\nlanguage and International Trade \r\nStefan Bendfeldt _____ Guatemala City, Guatemala *Zaneta Tiana Mowatt Charleston, SC \r\nJonathan Britton Larkby Hilton Head Island, SC Heidi H. Schoepf --------- Pequannock, NJ \r\nAmy Elizabeth Mcleod Ormond Beach, FL Delores Ann Teaford Lexington, VA \r\nPhilosophy \r\nNathan Wade Masters -------Easley, SC \r\nSpeech and Communication Studies \r\nGregory John Jawski ------ Port Washington, NY *Kristen Sheh Nivica -------- Bridgewater, MA \r\n*Melanie Ann Klass Pittsford, NY Allison Ann Severns Fort Lauderdale, FL \r\nMichael Wayne Mikhin Vero Beach, FL \r\nDOUBLE MAJOR \r\nEnglish and History \r\nBrianne Colleen McCarthy ______ Newark, DE \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\n•Graydon Wardell Jackson Ill _______ Sumter, SC Cordes Clifford Towles _______ Mt Pleasant, SC \r\nJennifer Lynn Reese Rock Hill, SC \r\nDesign \r\nAngela Helen Avildsen ------- St Matthews, SC Bradley Bonner McDermott North Augusta, SC \r\nMiles Stokely Bowman Summerville, SC Gregory L. McQueen ________ Bennettsville, SC \r\nMatthew Hayslip Cantrell Augsburg, Germany Jamie Dawn Minick Saluda, SC \r\nLuke Zeigler Jarrett Myrtle Beach, SC **Thomas Orion Parham Florence, SC \r\nBoudewyn Willem Laterveer, Jr. Atlanta, GA Kevin Cecil Shokes Charleston, SC \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nArnita Joshi __________ Anderson, SC \r\nPolitical Science \r\nMark Day Douglas ________ ..,,.,...Beaufort, SC Crystal Culler Selfridge Easley, SC \r\nJo Ellen Gawronski Blythewood, SC Jason D. Wallace ___________ Clemson, SC \r\nTony Lamont Johnson Perry, FL \r\nPsychology \r\nShelly Denise Hannon _________ Taylors, SC Katherine Anne Lowry Terrace Park, OH \r\nAmy Elizabeth Higgs Fairfax, VA Dana Lynn Marangelli _________ Yaphank, NY \r\nAmy Lee Hook Columbia, SC ••Donald Patrick Sullivan Pageland, SC \r\nJeffrey Shane Hunt Wichita Falls, TX \r\nSociology \r\n*Robert Cleo Hayes, Jr. __________ Easley, SC Dexter Fitzgerald Stowers Westfield, NJ \r\nJenaii Dawkins Miranda Sumter, SC Kimberly Lynn Zachar --------Palm City, FL \r\nDOUBLE MAJOR \r\nPsychology and Sociology \r\n•••Brandi Marie Slaton _______ Anderson, SC Brent Sandor Ur ---------- Greenville, SC \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nStephanie Kimyatta Anderson _____ Columbia, SC Kelly Austin Rife Florence, SC \r\nDevin 0. Clouden ___________ Buffalo, NY Terrell James Singleton Walhalla, SC \r\nJohn Reginald Latimer Belton, SC Kendra Elaine Smith Hemingway, SC \r\nAmanda Jaylen Lenoci Silver Spring, MD Latorrey R. Webb ----------Beaufort, SC \r\n*Magda Vandermeer O'Dell Weaverville, NC Meridith McGee Welch Anderson, SC \r\n***Erik Kristopher Otto Shepherdstown, WV Charles Harrison Yarber IV Lexington, SC \r\nCharmayne Reneta Rhodes Stone Mountain, GA \r\nEconomics \r\nTik Kai Fu ..,.,-~---------,,.---Barnwell, SC Paul M. Leverrier __________ Bethesda, MD \r\nRachel LaBelle Graves Brittons Neck, SC Larki MacArthur Robinson Ridgeway, SC "
    },
    {
        "page_number": "24",
        "text": "Financial Management \r\nRyan Thomas Ballard-------~ Woodruff, SC Jason Ryan Scheibe! ~-------Trumbull, CT \r\n+•Kevin Joseph Citron West Windsor, NJ Janine Michele Sheridan Marlboro, NJ \r\n*Scott Edwin Gregory Spartanburg, SC Caroline Siau Smith Datlington, SC \r\nKostas Jeffrey Ioannidis Charleston, SC Michael Albert Todd Aiken, SC \r\nTravoi Eugene Jenkins Charleston, SC Neeraj Walia Taylors, SC \r\nLinda Jill Josey Anderson, SC Emily Roxanne Webb Waterloo, SC \r\nCarter Anthony Martling Great Falls, VA Christina Emily Wester Beaufort, SC \r\nAllison Kristine Russell Cordova, TN Jeff Scott Zacapa Tegucigalpa, Honduras \r\nGraphic Communications \r\nKasey Lynn Carden ----------=Aiken, SC Robyn lungermann __________ Old Bridge, NJ Eric Ryan Ferguson __________ Toccoa, GA Sara Alice Porter Aiken, SC \r\nTraci Elizabeth Hunter Anderson, SC Jennifer Helen Smith Mt Pleasant, SC \r\n**Stephanie Jan Isbill Lawrenceville, GA \r\nIndustrial Management \r\nTimothy Ralph Crisp --------Rock Hill, SC Jeffrey Michael Jones Anderson, SC \r\nDewey William Dorsey, Jr. Anderson, SC Hiroshi Kanno __________ Iwate-Ken, Japan \r\nWalter Jerome Foster Ill Columbia, SC \r\nManagement \r\nThomas Gregg Anderson -------Greenville, SC Richard Lucas Lawall ________ Charleston, SC \r\nThomas K. Bratcher Nashville, TN William Frank Manus, Jr. Atlanta, GA \r\nDanny Dwayne Church Dillon, SC Michelle Watkins Niinobe Clemson, SC \r\nDavid Christopher Grendysz Burke, VA *Robert Allen Ruth Harrisburg, PA \r\nJames Orlando Herbert, Jr. Anderson, SC Michael James Spradlin Lexington, SC \r\nLeslie Milling James Columbia, SC Darren Michael Streets Fairfax, VA \r\nSamantha Joan Knight Duluth, GA Troy Matthew Thompson Columbia, SC \r\nMarketing \r\nKristen Carol Bakcc ________ Powdersville, SC Richard Travis Macklin ------- Pittsburgh, PA \r\nCharlotte Hawkins Bolton Fort Lauderdale, FL *Tiffany Felise Metzger Columbia, SC \r\nJames Edward Bozard Easley, SC *Carrol Lynn Mills Mauldin, SC \r\nKevin Terence Bulla North Babylon, NY Gabriela Perez Quito, Ecuador \r\nVictoria Lollis Campbell Williamston, SC *Kimberly Erin Rauch Sumter, SC \r\nJamie Lyn Derrick Irmo, SC Regina Denis Redfearn Wallace, SC \r\nJoseph Robert Dorsett Pennington, NJ Ashley Catherine Rice Clinton, SC \r\nShannon Leigh Doyle Greenville, SC Hunter Leigh Robinson Charlotte, NC \r\nJeremiah Beau Graham New Hope, PA Jennifer Mehera Rubin Myrtle Beach, SC \r\nJackie Louise Green Westminster, SC Lisa Marie Scars Simsbury, CT \r\nJason Michael Howell Spartanburg, SC Scott Andrew Seitz Springfield, OH \r\nDaniel Carl Jackson IV Florence, SC Tai David Slann Clemson, SC \r\nMark Lewis Jackson Lyman, SC Matthew Stanchek Watkinsville, GA \r\nAnthony Charles Kalka Greenville, SC Joseph Scott Thompson Rock Hill, SC \r\nJohn Sun Kim Greenville, SC Jennifer Lynn Ward Livonia, NY \r\nBruce Li West Hempstead, NY Julie Anne Whatton Greenville, SC \r\nPsychology \r\n*Heather Suzanne Burgess -------- Mauldin, SC *Julia Lee Hay __________ Myrtle Beach, SC \r\nJohn Twner Childress Piedmont, SC +••Keith Andrew May Greenville, SC \r\nJustin Jeffrey Dowd Irmo, SC ••Amanda Dean Moss Anderson, SC \r\n+••Emma Elizabeth Harris Brussels, Belgium +•••Melissa Lynn Newman Edgefield, SC \r\nSociology \r\nCatherine-Anne Cox Clardy ____ Galivants Ferry, SC Jennifer Hope Davis -------- Beech Island, SC \r\nNancy Catherine Cromer Anderson, SC Sarah Melissa Krewson Annandale, VA \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF ARTS \r\nComputer Science \r\nMatt Lee Herbert ________ Arlington, TX \r\nGeology \r\nMichael Dale May, Jr. ________ Aiken, SC \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering \r\nCarl Thomas Andersen _________ Clover, SC Gregory Scott Mitchell _________ Belton, SC \r\nMichael Douglas Bums-------- Greenville, SC "
    },
    {
        "page_number": "25",
        "text": "Chemical Engineering \r\n••Jason Lewis Adams ------- Summerville, SC William Edwin Willis _________ Rock Hill, SC \r\nWilliam George Paine Hartsville, SC \r\nChemistry \r\n**Marian Calhoun Bryan ------ Edisto Island, SC Brandon Michael Shealy ________ Prosperity, SC \r\nJason Elliott Mullins _________ Columbia, SC Demetrius 0. Simmons McClellanville, SC \r\nCivil Engineering \r\nTerance Miquel Brooks _______ Myrtle Beach, SC *Kevin Stanley Hinde -------Indian Trail, NC \r\nJohn David Cox, Jr. __________ Easley, SC Jason Eric Simpson Iva, SC \r\nStuart Matthew Fuller Florence, SC Janeen Marie Smith Grafton, MA \r\nMelissa Beth Henkel Imperial, PA Howard Benjamin Vinson Manning, SC \r\nComputer Engineering \r\nDouglas Allen Binenti ------- Mt Vernon, NY Shayla Monee Williams _______ Bennettsville, SC \r\n**Krista Marie Chenoweth Watkinsville, GA \r\nComputer Information Systems \r\nJames Chandler Felder Ill -------,,..-Sumter, SC John Andrew Trice---------- Seneca, SC \r\n*Anthony Adam Jones _______ Greenville, SC •••Kelly Sue Vollrath Anderson, SC \r\nComputer Science \r\nPatrick Jon Antonio -------- Goose Creek, SC *Megan Lynne Murphy _____ Woodbury Heights, NJ Marc Henry Bryant Echirolles, France Huyngan Phan Nguyen _________ Taylors, SC \r\nScot Franklin Cole Atlanta, GA Wiley Chester Wimberly, Jr. Greenville, SC \r\nMatthew Robert Hubley Dover, PA \r\nElectrical Engineering \r\nLacry James Allen II ---------Columbia, SC Christopher Norman Prosser ______ Charlesron, SC \r\nChung-Chang Chiu Fort Mill, SC +••Jennifer Lynn van der Horst ____ Myrtle Beach, SC \r\n+*Edward Francis McDonough Tampa, FL +••Nathan Travis Youell North Augusta, SC \r\nGeology \r\nGeorge Douglas Adams _________ Belton, SC Lynn Jenkins Hendrix ________ Whitmire, SC \r\nGraham Carl Bradner _________ Fort Mill, SC \r\nIndustrial Engineering \r\nWilliam Duncan Bradshaw, Jr. ______ Chapin, SC Chia Sheng Lin __________ Taipei, Taiwan \r\nKimberley Michelle Bryson ________ Aiken, SC John McCarley Woods Greenville, SC \r\nMathematical Sciences \r\nMark Jason Albert _________ Anderson, SC +•••Diane Elizabeth Harrold ______ Hartsville, SC \r\nChi Wing Chan ___________ Clemson, SC \r\nMechanical Engineering \r\n•Jeffrey George Hoyt Butler ------~ Conway, SC Adam Todd Gramling ------- Orangeburg, SC \r\nWilliam Edward Cheek, Jr. ------ Charlotte, NC Daniel Paul Thompson Greer, SC \r\nStefan Oliver Forbes Mt Pleasant, SC John David Williams Anderson, SC \r\nPhysics \r\nDaniel Summers Bu5ch _______ Walhalla, SC \r\nTextile Chemistry \r\nRyan Anthony Wentworth _____ Anderson, SC \r\nTextile Management \r\nJada Charlene Banks _________ Mangham, LA Vincent Pascal Decabooter Anderson, SC \r\nDenise Brooks St George, SC Mohammad Osman ____ Huddersfield, United Kingdom \r\nTextile Science \r\nMuhammad lfrahim _________ Clemson, SC Muhammad Shazib Shehzad _____ Karachi, Pakistan \r\nBahar Hussain Kizilbash Karachi, Pakistan \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nCaroline Lawton Maner \r\nHAROLD ERNEST CHEATHAM, DEAN \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\n-------Columbia, SC Mary Ellen Middleton \r\nElementary Education \r\n_________ Gaffney, SC \r\n*Stacy Renee Davis _________ Walterboro, SC Beverly Anissa Schaffer -------- Hampton, SC \r\nRobin Anderson Edwards Easley, SC Alice M. Smith Seneca, SC \r\nAmelia Gervais Emanuel Clemson, SC *LaShawn N. Watson Summerville, SC \r\n**Crystal Nicole Kimbrell Santa Fe, TN Brook Ashlee Yates Laurens, SC \r\nLaurie Catherine Petillo Long Valley, NJ "
    },
    {
        "page_number": "26",
        "text": "Secondary Education \r\nElmer Keith Bench, Jr. -------- Manning, SC Jonathon Issac Pace Six Mile, SC \r\nKaren Elizabeth Bodigheimer __ Altamonte Springs, FL James Edwin Still Greenwood, SC \r\nJa'Ncll Bostick Scotia, SC Scan William Stockton ______ Rutherfordton, NC \r\nBlake David DuBose Greer, SC \r\nSpecial Education \r\nJinni Ann Adams _________ Spartanburg, SC Amy Elizabeth Harper -------- Columbus, GA \r\nHeather Renee Allscp Walhalla, SC Stephen Todd Hunnicutt Clemson, SC \r\n*Alice Mitchell Harper Campbell Walhalla, SC Heather Ann O'Flaherty Dhahran, Saudi Arabia \r\nAlleen Margaret Duyn West Milford, NJ ••Christina Louise Walker Los Angeles, CA \r\nSarah Rhunette Pym Franks Powdcrsvillc, SC Tanya Lee Wheeler Andrews, SC \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\nJennifer Dougherty ----------Ramsey, NJ Stephanie Michelle Schulz St Louis, MO \r\nJennifer Lee Henderson Cenrral, SC Kristen Alisha Stevenson West Union, SC \r\nElisa Firler Miot Columbia, SC Leslianne Swanson _________ Lake Ridge, VA \r\nWendy Yvonne Owens Hillsville, VA ... Elizabeth Adams Tucker Columbia, SC \r\nIndustrial Education \r\nMark Allen O'Shields _______ Taylors, SC \r\nMathematics Teaching \r\nHenry Franklin McCormack, Jr. ____ Bamberg, SC \r\nNursing \r\nCristy Gail Bobo----------- Seneca, SC .. •Teresa Sue Hudson--------- Perry, OH \r\nGeoffrey Warren Duncklee Strafford, VT \r\nParks, Recreation, and Tourism Management \r\nScott Alan Ackerman _______ Hampton Bays, NY •Agata Jankowska -------- -Poznan, Poland \r\nAnne Stevens Adams ---------::,...--- Seneca, SC Andrew Taylor Linn Greer, SC \r\nJames Chadwick Alverson Simpsonville, SC Trude Lynn Molin Seneca, SC \r\nElyse Barbara Angelo Glastonbury, CT Scott Craig Nelson New Orleans, LA \r\nEdwin F. Bailey Summerville, SC Jean Michelle Noren Dunwoody, GA \r\nElizabeth Slade Batcheldor Taylors, SC Holland Daniel Postell Summerville, SC \r\nKelley Ann Brown Greenville, SC Jennifer Lynn Puckhaber Anderson, SC \r\nMichael Bradley Brown Lexington, SC Stephen Foster Rice Seneca, SC \r\nPaula M. Carpenter North Augusta, SC Robert William Schmitt Wixom, Ml \r\nAmber Suzanne D'Alpe Lexington, SC Robert Austin Scort, Jr. Okatie, SC \r\nCarlos Demond Davis Chester, SC Elizabeth Brown Shuler Kingstree, SC \r\nJeanette Michele Davis Greeneville, TN Kimberly Alice Sponsler Walhalla, SC \r\nMichael Legare Delaney Orangeburg, SC David Hartwell Stafford Irmo, SC \r\nMelvin David Fort, Jr. Sumter, SC Jennifer Ann Tapp Greenville, SC \r\nCatherine Newell Frank Florence, SC Bradley Matthew T umer Roswell, GA \r\nJames Daniel Gambrell Easley, SC Christopher Bradley Woody Pickens, SC \r\nWendy Rose Henson Forest City, NC Margaret Barton Zeigler Sumter, SC \r\nDavid Carson Herrin 11 Clemson, SC \r\nPre-professional Studies \r\n•Katie Lynn Myers Mt Pleasant, SC \r\nScience Teaching \r\nJoshua Jude Burke -------- Rock Hill, SC \r\n•Cum laude: A grade point ratio of 3.40 to 3.69 \r\n••Magna cum laude: A grade point ratio of 3. 70 to 3.89 \r\n•••Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\n+Departmental Honors: The graduates so designated have completed an enriched program of study designed by their departments \r\nwith the approval of the Calhoun College Honors Program. To earn Departmental Honors students must complete an honors \r\nthesis and/or ocher upper division honors courses, while maintaining an overall grade-point ratio of 3.40 or higher. Departmental \r\nHonors graduates appear in the line of march wearing the Calhoun College Honors Medallion on an orange and purple ribbon. \r\nThis medallion is made possible by an endowment established by Mrs. Katherine Inabinet Vickery of Columbia, South Carolina, \r\nto honor the memory of her husband and Clemson graduate, the late B. C. Inabinet. \r\nStudents wearing the white stoles over their gowns are members of honorary sociccies thac require a minimum 3.00 grade point \r\nratio for membership. The stoles have the University seal embroidered on one side, and on che other side are che cmblem(s) of \r\nhonorary sociecics in which che scudenc is a member. "
    },
    {
        "page_number": "27",
        "text": "8/13/99 "
    },
    {
        "page_number": "28",
        "text": "Graduation Exercises \r\nDecember 16, 1999 \r\nClemson, South Carolina "
    },
    {
        "page_number": "29",
        "text": "Congratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for individual \r\ngraduates. Such expressions frequently detract from the recognition due the \r\nnext graduate in line. Your cooperation is respectfully requested. "
    },
    {
        "page_number": "30",
        "text": "Graduation \r\nThursday, December 16, 1999 \r\n11:00 a.m. Littlejohn Coliseum \r\nORDER OF CEREMONIES \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation.) \r\nInvocation \r\nJohannah Leigh Cornwell, Student Representative \r\nIntroduction of Trustees \r\nPresident James F. Barker \r\nConferring of Honorary Degrees \r\nPresident James F. Barker \r\nRecognition of the Deans of the Colleges \r\nVice President for Academic Affairs and Provost \r\nSteffen H. Rogers \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident James F. Barker \r\nRecognition and Presentation of Awards \r\nClass of '39 Award For Excellence \r\nFaculty Scholarship Award \r\nAurora Brass Quintet \r\nFrank W . Breazeale, Organist \r\nKevin Davidson, Soloist \r\nDr. Bruce Yandle, University Marshal "
    },
    {
        "page_number": "31",
        "text": "BOARD OF TRUSTEES \r\nLawrence M. Gressette, Jr., Chairman _________ Columbia \r\nWilliam C. Smith, Jr., Vice Chairman Columbia \r\nBill L. Amick Batesburg \r\nJ. J. Britton Sumter \r\nLeon J. Hendrix, Jr. New York, NY \r\nHarold D. Kingsmore Aiken \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee Greenwood \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick III Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nAllen P. Wood Florence \r\nTrustees Emeriti \r\nLouis P. Batson, Jr. ________________ Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW. G. DesChamps, Jr. Bishopville \r\nPaul W. McAlister Laurens \r\nPaul Quattlebaum, Jr. Charleston \r\nD. Leslie Tindal Pinewood \r\nJames M. Waddell, Jr. Columbia \r\nExecutive Secretary to the Board of Trustees \r\nJ. Thornton Kirby \r\nADMINISTRATIVE OFFICERS \r\nJames F. Barker _________________ President \r\nSteffen H. Rogers Vice President for \r\nAcademic Affairs and Provost \r\nJohn Kelly ________________ Vice President for \r\nPublic Service and Agriculture \r\nNeill Cameron Vice President for Advancement \r\nAlmeda Jacks Vice President for Student Affairs \r\nScott Ludlow Chief Financial Officer \r\nDavid Stalnaker Executive Director of the Commission \r\non the Future of Clemson and Assistant to the President "
    },
    {
        "page_number": "32",
        "text": "HONORARY DEGREE \r\nSUSAN GOODWIN DELONY \r\nDOCTOR OF HUMANITIES \r\nEsteemed University leader fo r two decades, Susan Goodw in Delony was instrumental in \r\ndefining the social and educational culture of today's C lemson University. The \r\ncontributions she made to students, colleagues and the future of C lemson are immeasurab le \r\nand resonate in the lives she personally touched and in those who never knew her but feel \r\nher impact today. \r\nDean Delony received her bachelor's degree in 1945 from Auburn University and her \r\nmaster's from Cornell Un ive rsity in 1951. She followed her fo rmal e<lucation with summer \r\nstudies at Michigan State and the Teachers College of Columbia University. \r\nHer first appointment in Academe was as an instructor at the Woman's College of North \r\nCaro lina, fo llowed by assistant professorships at Montana State Co llege and A uburn \r\nUniversity. Dean Delony became the assistant dean of women at Auburn in 1957 an<l \r\nremained there until 1963 when she was hired as the first dean of women at C lemson. For 14 \r\nyears, she served in this post and was later promoted to associate dean of students. \r\nWhen Dean Delony joined C lemson's ranks, there was a great need for programs, \r\nopportunities and fac ilities fo r women. (They had been admitted to C lemson only yea rs \r\nbefore, in 1955.) Dean Delony met this challenge with resolve and passion. During her \r\ntenure, she was instrumental in the format ion and development of the Resi<lence H a 11 \r\nProgram for women and the Resident Assistant Program. In 1969, she brought nat io nal \r\nwomen's socia l fraternities to C lemson, establishing the foundat ion fo r the successful Greek \r\nLife the University enjoys today. She helped fou nd Alpha Lamba Delta freshman honor \r\nsoc iety as well as Mortar Board. President Emeritus Walter Cox has ca lled hiring Dean \r\nDelany \"one of the best recommendations I made in my tenure at C lemson.\" \r\nIn add ition to her achi evements at the University, Dean Delony has provi<led \r\noutstand ing service to her community. While enjoy ing retirement in her birthplace of \r\nTuscumbia, Alabama, she retains active membership in her church and has served on a \r\nfeasibility study for the Consolidation Committee of Tuscumbia. She is past presi<lent nf the \r\nMaud Lindsay Study Club, volunteer of the Tennessee Valley Art Association Guild a nd \r\nhas served and is currently on the Board of Friends of the Helen Keller Public Library. \r\nDean Delony has made it her life's work to establish a high stan<lard nf characte r and \r\nvision for all with whom she has contact. Her spirit pervades the campus each and every <lay \r\nthe University thrives. It is with great honor and pleasure that we recognize this individual \r\nwho truly made a difference in the lives of stu<lents and of this University <luring a c ritical \r\ntime in its history. We hereby present Susan Goo<lwin Delony with the honorary Doctor of \r\nHuman ities degree. "
    },
    {
        "page_number": "33",
        "text": "HONORARY DEGREE \r\nROBERT FRANCIS NOWACK \r\nDOCTOR OF LAWS \r\nAs a teacher, adviser, friend, confidant, colleague and mentor, Robert Francis Nowack \r\nepitomizes excellence. For over 50 years, he has served Clemson University in numerous \r\ncapacities-from the Clemson Little Theatre to the Social Committee of Clem on \r\nCollege to being a charter member of Omicron Delta Kappa. He has contributed not only \r\nto Clemson University, but to tens of thousan<ls of students who now define the cultural, \r\nsocial an<l educational fabric of America. \r\nProfessor Bob Nowack, or P.B. as he is better known, received his bachelor's <legree from \r\nCarnegie Mellon and a master's from the University of Pittsburgh. He also attended VP! \r\nfor post-gra<luate work. He began teaching at Clemson on September l, 1948, and has been \r\nhere ever since. \r\nOnce referred to by President Emeritus Robert Edwards as \"one of the truly great \r\nteachers in Clemson's first century of service to mankind,\" P.B. has served under seven of \r\nl 4 presi<lents and has won virtually every award the University bestows. He was the first \r\nrecipient of the Byars Awar<l for Teaching Excellence in Engineering Mechanics and the \r\nFrank F. Burtner Awar<l for A<lvising. He has been a member of the Order of Athena \r\nChapter of Mortar Boar<l National Honor Society, Tiger Brotherhood, Blue Key and Chi \r\nEpsilon. He's won the National Society of Professional Engineers Educator of the Year \r\nAward, Tau Beta Pi Eminent Engineer Award, Chi Epsilon Outstanding Teacher Award, \r\nRobert W . Moorman Award from Tiger Brotherhood, Algernon Sidney Sullivan Award \r\nand Master Teacher Award. In 1989 he was honore<l as an Alumni Distinguished Professor \r\nof Civil Engineering. \r\nAlthough highly decorate<l by official honors and awar<ls, P.B. is best known for his \r\nteaching style, his re lationship with students, his ability to befriend and father. He's been \r\nknown to spen<l five hours per <lay just talking with students in his office. He learns every \r\nstudent's name in his classes, so he builds a personal relationship with each one of them. \r\nThere are thousan<ls of students who are inspired by his wisdom and achieve beyond their \r\nhopes because of his encouragement. As one colleague sai<l, \"P.B. does more than educate \r\nstudents; he makes them better human beings.\" \r\nMaybe P.B.'s contributions are best summarized in the words of one of his students: \r\n\"What really sets you apart from other professors is your interest in each of your students as \r\nindividuals, not merely as students. Teachers who take this kind of approach to students are \r\nthe ones who truly make a <lifference in shaping our lives.\" \r\nBecause of his dedication an<l genuine concern for stu<lents as well as his unsurpassed \r\nloyalty and 50-year service to Clemson University, we are honored to present Professor \r\nRobert Francis Nowack with the honorary Doctor of Laws degree. "
    },
    {
        "page_number": "34",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, \r\na senior faculty member, with the college baton, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the \r\nAmerican Council on Education, are as follows: \r\nCollege \r\nAgriculture, Forestry and Life \r\nSciences \r\nArchitecture, Arts and \r\nHumanities \r\nBusiness and Public Affairs \r\nEngineering and Science \r\nHealth, Education and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and Orange \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitecture \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocial Sciences \r\nLibrary \r\nAcademic Support \r\nInstruction \r\nCollegiate faculty fo llow their marshal in order of academic rank wearing academ ic \r\ncostumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United States wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions are \r\nspecified by a uniform code maintained by the American Council on Education. Caps are \r\nblack and are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels \r\nusually of metallic thread; other degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is to replace black ve lvet \r\nwith velvet in the discipline color. A second variation is a colored gown usually of the \r\nuniversity's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the award ing \r\ninstitution. First, degree level is signified by the size of the hood with bachelors' sma ll est, \r\nmasters' larger, and doctors' quite large and of a different shape. Clemson does not award \r\nhoods to bachelors. The width of the velvet trim also conveys the degree. Secondly, the \r\ndegree is indicated by the color of the trim edging the hood to form the throat over the gown. \r\nThe most frequently seen is dark blue, which designates the doctor of philosophy (Ph.D.) \r\ndegree. Finally, the color of the hood's lining specifies the awarding institution. The colors \r\nare displayed in combinations that are drawn from heraldry. Notice that the C lemson \r\nUniversity hood is lined with purple through which is an orange chevron {a \"Y\"). Although \r\nmany combinations are duplicated by dozens of institutions, C lemson is presently the only \r\ninstitution with chat registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastica l, or military \r\nregalia as set forth by their professions. They are preceded by the University Marshal. Clad \r\nin a gown of office in gold and purple, the marshal wears no hood and bears the University \r\nmace. At the ceremony's close, the faculty do not exit as a part of the recessional but are \r\ndismissed, along with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "35",
        "text": "CANDIDATES FOR THE DOCTOR'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nApplied Economics \r\nPeter Christopher Melvin __ --,-,-,-,,.,----,-,---------------------- Winter Springs, FL \r\nB.S., Florida State University; M.A., Clemson University \r\nDissertation: Hedonic Prices of Golf Courses \r\nAdvisor: Dr. R. E. McCormick \r\nCrop and Soil Environmental Science \r\nLigia Aura Bejar _____ _ ~-,~--,~-------------------- Bucharest, Roman ia \r\nB.S., University of Bucharest; M.S., Clemson University \r\nDissertation: Modeling of Water Movement and Solute Transport in Disturbed and Undisturbed Soils \r\nAdvisor: Dr. V. L. Qu isenberry \r\nEntomology Deborah Sheryl Brickle _______________________________ Branchville, SC \r\nB.S., M.S., Georgia Southern University \r\nDissertation: Optimization of Management Strategics for Lepidopterous Pest in Transgenic B.t. Cotton \r\nAdvisor: Dr. S. G. Turnipseed \r\nHanping Lu Wuhan, China \r\nB.S., M.S., Huanzhang Agricultural University \r\nDissercacion: Housefly (Musca domestica L.) Management with Emphasis on the Facultative Predacor, Hydraraea aenescens in \r\nPoultry and Swine Operations \r\nAdvisor: Dr. P. M. Horton \r\nEnvironmental Toxicology \r\nRyan Edward Casey _________________________________ Mt Airy, MD \r\nB.S., Virginia Polytechnic Institute and State University \r\nDissercation: Receiving Golf Course Runoff \r\nAdv isor: Dr. S. J. Klaine \r\nDaniel Jorey Karen ________ ~------------------------Waccabuc, NY \r\nB.S., Emory University; M.S., College of Charleston \r\nDissertation: Sublethal Impact of Episodic Pesticide Exposures on Fundulus Heteroclitus \r\nAdvisor: Dr. S. J. Klainc \r\nCynthia Sills Ropesv ille, TX \r\nB.A., Case Western Reserve University; B.S., University of Idaho; M.S., Idaho Seate Univcrsi!.y \r\nDissertation: Effects of Six Endocrine Disrupters and their Binary Mixtures on American Alligators (All igator mississipoiensis), \r\nNorchem Bobwhites (Colinus virninianus), and Deer Micc(Peromyscus maticulatus) \r\nAdvisor: Dr. R. L. Dickerson \r\nFood Technology Anju Rao ___________________________________ Hyderabad, India \r\nB.S., M.S., Andhra Pradesh Agricultural University \r\nDissercacion: Optimization and Characterization of Membrane Processed Soy Protein Concentrate \r\nAdvisor: Dr. R. L. Thomas \r\nForest Resources Chau~Chin Lin __________________________________ Taipei, Taiwan \r\nB.S., National Chung Hsing University; M.S., Taiwan National University \r\nDissertation: An Integrated Model co Predict Human~Caused Forest Fire Danger in Taiwan \r\nAdv isor: Dr. W. E. Hammitt \r\nZicai Xu ____________________________________ Harbin, China \r\nB.A., Inner Mongolia Universityi M.F.R., Norcheast Forestry University \r\nDissertation: Evaluation of Properties Associated with Bacterial Wetwood in Red Oaks \r\nAdvisor: Dr. F. H. Tainter \r\nMicrobiology \r\nRicky Lee Ulrich Daytona Beach, FL \r\nB.S., C lemson University \r\nDissertation: Identification, Cloning, and Sequencing of the Genetic Determinant Coding for the Proposed Lactacin B Inducer \r\nProtein and Partia l Characterization of the Lactobacillus Delbrueckii ssp. Lactis ATOC 4 797 Genome by Shotgun Clon ing \r\nand Sequencing \r\nAdvisor: Dr. T. A. Hughes "
    },
    {
        "page_number": "36",
        "text": "Plant Pathology \r\nSuat Yilmaz lsparta, Turkey \r\nM.S., Oklahoma Seate University \r\nDissertation: Development of Non~Radioaccive Detection Methods for the Genomic RN As of Ilarviruses that Cause Disease in \r\nPeach and Their Use in Studying the Molecular Basis of the Synergistic Interaction between Prunys Necrotic Ringsooc Virus \r\nand Prnne Dwarf Virus \r\nAdvisor: Dr. S. W. Scott \r\nZoology \r\nJody Matthew Myers Eunice, LA \r\nB.S., M.S., Louisiana State Un iversity and A&M College \r\nDissertation: Studies on the Secretory Epithelium of the Mantle from the Eastern Oyster, Crassostrea Virginica, in Relation to \r\nShell Formation \r\nAdvisor: Dr. A. P. Wheeler \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nDOCTOR OF PHILOSOPHY \r\nIndustrial Management \r\nAlan Russe ll Cannon Greenville, SC \r\nB.S., M.B.A., Clemson University \r\nDissertation: Environments, Strategies and Manufacturing Flexibility-A Concingency Theory and An Empirical Test \r\nAdvisor: Dr. C. H. St. John \r\nLoretta Ferguson Cochran--,,-=---,.,--------------------------- Pottsville, AR B.S., Erskine College; M.S., Clemson University \r\nDissertation: Linking Corporate Goals and Shop Floor Performance \r\nAdvisor: Dr. J. W. Patterson \r\nlndustriaVOrganizational Psychology \r\nThomas Lloyd Killen~-------------------------------- Easley, SC \r\nB.S., Wofford College; M.S., Clemson University \r\nDissertation: The Effecc of Incentives to Fake on Personality Test Responses \r\nAdvisor: Dr. F. S. Switzer \r\nErica Lynn Lagasse_~~~,-~-~~~------------------------ Tampa, FL B.A., University of South Florida; M.S., Clemson University \r\nDissertation: Policy Capturing of Appel late Level Sexual Harassment Court Cases \r\nAdvisor: Dr. F. S. Swiuer \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nChemical Engineering Patrick Christopher Joyce _______________________________ Dumont, NJ \r\nB.S., M.S., Manhattan College \r\nDissercacion: Vapor#Liquid Equilibria for Long#Chain Hydrocarbons in Supercritical Alkane Solvents \r\nAdvisor: Dr. M. C. Thies \r\nChemistry \r\nLois Elizabeth Nice Jersey Shore, PA \r\nB.A., Lycoming College \r\nDissertation: Preparation and Reaction of Alpha-Aminoa lkyl Copper Reagents with: (I) Alpha, Beta-Unsaturated Enones/Enals, \r\nand (2) Propargyl Substrates \r\nAdvisor: Dr. P. K. Dieter \r\nHarry Wh ittier Roll ins Charleston, SC \r\nB.S. emson University \r\nOissercacion: Preparation and Characterization ofNanoscale Materials \r\nAdvisor: Dr. Y. P. Sun \r\nCivil Engineering \r\nJinxia Chen FuJian, China \r\nB.S., Shanghai Jiaotong University; M.S., Zhejiang Un iversity \r\nDissertation: Risk#Based Liquefaction Potential Evaluation Using Cone Penetration Tescs and Shear Wave Ve locicy \r\nMeasurements \r\nAdvisor: Dr. C. H. Juang \r\nMihail Grigore Chiru#Danzer Harrison, NJ \r\nB.S., Rensselaer Polytechnic Institute \r\nDissertation: Estimation of Liquefaction#lnduced Vertica l and Horimncal Displaccmencs Using Artificial Neural Networks and \r\nRegression \r\nAdvisor: Dr. C. H. Juang "
    },
    {
        "page_number": "37",
        "text": "Civil Engineering (continued) \r\nZhigang Huang_ ____ --o---=--c---c-,-------------------------Zibo, China \r\nB.S., Tongji Universicy, M.S., Tsinghua Universicy \r\nDis.scrtarion: Stochastic Models for Hurricane Hazard Analysis \r\nAdvisor: Dr. D. V. Rosowsky \r\nElectrical Engineering \r\nYi-Qun Jiang ---~-----,-.,,.-.,----,=-.,--:----------------------Duluth, GA B.E., M.E., National University of Defense Technology \r\nDis.serration: 30 Vector High~Order Finite Element Modeling for Doubly Periodic Structures \r\nAdvisor: Dr. A. 0. Marcin \r\nAlp Kustepeli __________________________________ Istanbul, Turkey \r\nB.S., lscanbul Technical University; M.S., Clemson University \r\nDissertation: Analysis and Implementation of chc Ema Id Method for Waveguide and Cavity Structures \r\nAdvisor: Dr. A. 0. Martin \r\nCl mt Simmons Wilkins, _______________________________ Blacksburg, SC \r\nB . ., M.S., Clemson University \r\nDissertation: Adaptation of Code Rate and Transmicrer Power in Frequency~Hop Communication \r\nAdvisor: Dr. M. B. Pursley \r\nEngineering Mechanics Andrzej Tadeusz Baranski ______________________________ Krakow, Poland \r\nB.S., Cracow University of Technology \r\nDisserrncion: Postbuckling Analysis of Laminated Composite Places with Damage \r\nAdvisor: Dr. S. B. Biggers \r\nEnvironmental Engineering and Science \r\nSilong Lu Clemson, SC \r\nB.E., Hohai University; M.E., lnstirute of Water Conservation \r\nDisserrntion: Stochastic Fractal Characterization and Representation of Sub·Surface Hydraulic Conductivity Distributions and \r\nFluid Flow and Transport in Fractal Porous Media \r\nAdvisor: Dr. F. J. Molz \r\nIndustrial Engineering \r\nXingang Cheng .,.-,..---,.,.,..--,----,.--,------,.,..-~,,..,-----,-----,.,,.------------ Henan, China B.S., Harbin College of Shipbuilding Engineering; Ph.D., Chinese Academy of Sciences \r\nD1ssercat1on: A Markov Decision Process Approach co R & D Project Planning \r\nAdvisor: Dr. D. L. Kimbler \r\nMathematical Sciences \r\nPaul Trianta(ilos Hadavas Swarthmore, PA \r\nB.S., Carnegie·Mcllon University; M.S., Clemson University \r\nD1sserrntion: Exploiting Network Substructures and Persistency in Solving 0-1 and General Nonconvex Optimization Problems \r\nAdvisor: Dr. W. P. Adams \r\nLin<l:i Graynel Lawson_--:-=------------------------------ Cuthbert, GA B.S., M.S., University of Georgia \r\nDissertation: Dyn(lmic Progrnmming Based Leaming Methods Using Mulcigrid \r\nAdvisor: Dr. J. K. Peterson \r\nBernd Schandl _______________________________ Nieder-Olm, Germany \r\nDipl., University of Kaiserslautem \r\nDissertation: Norm-Based Evaluation and Approximation in Multicriteria Programming \r\nAdvisor: Dr. M. M. Wiecek \r\nMechanical Engineering \r\nX1<m Chang Li=---:--.,..,.---------------------------- Hebei Province, China B.S., M.S., Tsinghua University \r\nD1s~cmnion: Cooling by a Mist/Steam Jet \r\nAdvisor: Dr. J. L. Gaddis \r\nYugang Li -----------------------------------Shenyang, China B.E .. M.Engr., Tianjin University \r\nDisscrt;ltion: Adaptive Vibration Isolation Control for Continuous Systems \r\nAdvisor: Dr. C. D. Rahn \r\nSunder S. V. Vaduri ________________________________ Hyderabad, India \r\nB.E., Osmania University; M.S., Clemson University \r\nDissertation: Development of Computer Tools for Analysis of Track Test Data and for Prediction of Dynamic Handling Response \r\nfor Winston Cup Cars \r\nAdvisor: Dr. E. H. Law \r\nPhysics \r\nTunothy Richard Marshall _-c----,-.,,.--.,..,-------------------------Dahlonega, GA B.S., North Georgia College and Smee University \r\nDissertauon: I nvescigations or High Laucude Wind Shears in the Lower Thermo.5phere \r\nAdvisor: Dr. M. F. Larsen "
    },
    {
        "page_number": "38",
        "text": "Physics (continued) \r\nLeif Zebediah Scheick_~~~,---,-,------------------------- Nashville, TN B.S., Wofford College; M.S., Clemson University \r\nDissertation: Famos Transistor Spectroscopy and Microdosimetry \r\nAdvisor: Dr. P. J. McNulty \r\nTextiles, Fiber and Polymer Science Jiefeng Yu ____________________________________ FuJian, China \r\nB.S., M.S., Ch ina Textile University-Shanghai \r\nDissercation: Study of Yam Package Residual Tension During Ove ~End Unwinding \r\nAdvisor: Dr. B. C. Goswami \r\nCOLLEGE OF HEAL TH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF EDUCATION \r\nVocational and Technical Education Wells Blakeslee Doty _________________________________ Salem, SC \r\nB.S., M.S., United Scates Naval Academy \r\nDissertation: Personality Types and Traits as Academic Success Prediccors \r\nAdvisor: Dr. J.M. Leininger \r\nShelly Lin Schwartz Weatherford, TX \r\nB.S. 1 Tarleton State University; M.A., University of Texas Southwest \r\nDissertation: The Effect of Implementation of a Voice Messaging System on Student Perception of Interaction and Satisfaction in \r\nTelecourses \r\nAdvisor: Dr. G. G. Lovedahl \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction \r\nVicki Jean Phillips _________________________________ Walhalla. SC \r\nB.A., Winthrop University; M.Ed., Clemson Un iversity \r\nDissertation: The Effects of a Math Recovery Program: A Comparative Study \r\nAdvisor: Dr. W. H. Leonard \r\nEducational Leadership \r\nKatherine S. Sparks Lavonia, GA \r\nB.A., Berry College; M.Ed., Clemson University \r\nDissertation: Flagship Teachers for the 2 ln Century: A Profile of Behaviors and Values Which Exemplify Excellent Teachers \r\nAdvisor: Dr. D. L. Fuhr \r\nKenneth Harry Weichel Central. SC \r\nB.A., M.Ed., Clemson University \r\nDissertation: An Investigation of the Impact of School Culture on the Relationship Between South Carol ina Elememtary Schools \r\nand School Effectiveness \r\nAdvisor: Dr. D. L. Fuhr \r\nParks, Recreation, and Tourism Management \r\nDorothy Margaret C hase Clearwater Bay, O ntario \r\nB.A., University of Winnipeg; M.Ed., Lakehead University \r\nDissertation: Sense of Place: Resident and Visitor Assessments of a Tourism Destination Area Thunder Bay, Onrnrio, Canada \r\nAdvisor: Dr. G. W. Burnett \r\nRobert Wilson Dye, Jr. Brevard, NC \r\nB.S., Western Carolina University \r\nDissertation: Differentiating Between Private and Commercial Recreational Boaters on the C hattooga Wild and Scenic River; A \r\nDiscriminant Analysis \r\nAdvisor: Dr. G. W. Burnett \r\nKaren Paisley Hurtes ________________________________ Landcnberg, PA \r\nB.S., The American University; M.S., C lemson University \r\nDissertation: The Development of a Measure of Resiliency in Youth for Recreation and Ocher Social Services \r\nAdvisor: Dr. L. R. Allen \r\nWilliam Lewis Obenour ll-~-----~----------------------Pittsbu gh, PA B.S., Indiana Un iversity of Pennsylvania; M.S., Bowling Green Seate University \r\nDissertation: Understanding the Hermeneutis Meaning of the \"Journey\" in Travel and Tourism \r\nAdvisor: Dr. F. A. McGuire "
    },
    {
        "page_number": "39",
        "text": "CANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nGwendolyn Cummings McPhail Seneca, SC \r\nMASTER OF FOREST RESOURCES \r\nMadison Peyton Howell III Mt Pleasant, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nAbdullah Naci Dogrul ________ Ankara, Turkey Ferdinand Dimaculangan Vinuya _________ _ \r\nAvinash Noel Kessop C•lcutta, India _____________ Nueva Elija, Philippines \r\nAnimal Physiology \r\nJessica Lee Hall ___________ Charlotte, NC Kimberli Paige Yonce _________ Johnston, SC \r\nAndrea Marie Parkhursc Frederick, MD \r\nAquaculture, Fisheries, and Wildlife Biology \r\nTamara McCoy Koldyke Seneca, SC \r\nBiochemistry \r\nDiana Marie Rugh _______ Falls Church, VA \r\nBotany \r\nNathan Deas Missel _______ Summerville, SC \r\nCrop and Soil Environmental Science \r\nLori Ann Duis _________ Virginia Beach, VA Johnny Thorton Staples, Jr. --------Aynor, SC \r\nEnvironmental Toxicology \r\nAmy Leigh Bohannon Yorktown, VA \r\nForest Resources \r\nJoseph William Albiston ________ Altavista, VA Gregory Paul Smith ________ Cannonsburg, PA \r\nGenetics \r\nL<1Tonya Tymerria Jones _______ Sparcanburg, SC Francisco Romero-Pastrana _______ Puebla, Mexico \r\nMicrobiology \r\nDavid Enrique Correa --------- Suffern, NY C lyatt Elise Drakeford __________ Sumter, SC \r\nMc lflnic Pmricia Dauclc Cherry Hill, NJ Jannet Katherine Romero Simpsonville, SC \r\nMelanie Dawn DcCock Eldridge, IA \r\nNutrition \r\nCheryl Lynn Hooper ________ Naperville, IL \r\nPlant Pathology \r\nPayungsak Rauyarce Pathumchani, Thailand \r\nZoology \r\nJames Brent Varnadoe ________ Sumter, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nMASTER OF ARCHITECTURE \r\nJcannyc L;1Vcrnc Dudley ________ Arhmca, GA \r\nMichael Allan Gaffney Charlotte, NC \r\nHeather Annette Lentz ________ ~Walhalla, SC \r\nPatricia Dilger Newell Greenville, SC \r\nJustin Morgan Hughes Glen Dale, WV Hilary Grace Stevens Orlando, FL \r\nMASTER OF CITY AND REGIONAL PLANNING \r\nHilary Grace Stevens Orlando, FL \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nOmur Ehliz--,-=---__________ Kayseri, Turkey \r\nKenneth Prtu l Flower New Orleans, LA Ycsim Uncr~-~---------lscanbul, Turkey \r\nWilliam Taft Wirthlin Greenville, SC \r\nPaul Lynn Lavanish Sumter, SC Viswanadhan Raja Yallayi Andhra Pradesh, India \r\nSu:an Ozkinay Istanbul.Turkey \r\nMASTER OF FINE ARTS \r\nCecilia Frederic _______ Hendersonville, NC "
    },
    {
        "page_number": "40",
        "text": "MASTER OF ARTS \r\nEnglish Karen Ann Gentry _ ________ Bishopville, SC John Kwist, Jr. __________ Summerville, SC \r\nDeborah Veronica Holmes Wellford, SC \r\nHistory \r\nJohn Angus Martin __________ Brooklyn, NY Gregory J. Verhovshek __________ York, PA \r\nProfessional Communication \r\nAubrae Ann Wagner Greenville, SC \r\nMASTER OF SCIENCE \r\nArchitecture \r\nMaria Mercedes Posada----- Bogota, Colombia \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nMASTER OF BUSINESS ADMINISTRATION \r\nJoseph Charles Amell _________ Greenv ille, SC Julie Anne Lewis---------- Tallahassee, FL \r\nGreg Alan Bowen Moore, SC Elizabeth Lohr Longshore Greenwood, SC \r\nHeather Marie Brooks Greenville, SC Whitney Tillman Marcengill Greenwood, SC \r\nVicky Burgess Bryant Greer, SC Virginia Miller McManis Greenwood, SC \r\nGalen Eben Burdeshaw Greenville, SC Brian Allen Novatny C leveland, OH \r\nKaren Cothran Cannon Greenv ille, SC Terry Andrew Redmile Greenville, SC \r\nJose Gerardo Copello Campinas, Brazil Charles Anderson Rose, Jr. Greenville, SC \r\nMichael Lyn Couch Greenville, SC Vishal Pramod Shah C lemson, SC \r\nStacey Eichmeyer Couch Greenv ille, SC Randy Robert Sorenson Racine, WI \r\nMichele Ann Ensor Atlanta, GA Rowdy Dee Teague Newron, NC \r\nScott Br ian Freese Naperville, IL Jeffrey James Tewell Seneca, SC \r\nBruno Josef Hartmann Bavaria, Germany Michelle Ann Toporski Simpsonville, SC \r\nEric Robert Hendrickson Richmond, VA Daniel Lee VonDielingen Spartanburg, SC \r\nRandolfG. Hernandez Turrialba, Costa Rica Ting Xie Be ij ing, China \r\nKeith Allen King Zanesville, OH \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nGregory Allen Lewis ________ ___ G reer, SC Lee Elizabeth McConnell ________ Greenville, SC \r\nAshley Mauldin Pickens, SC Rebekah Lee Truesdale Kershaw, SC \r\nMASTER OF PUBLIC ADMINISTA T!ON \r\n(Master of Public Administration is jointly adm in istered by \r\nClemson University and che University of South Carolina.) \r\nChristopher Dav id Eldridge ________ Pickens, SC James Alexander Wiggins ________ Marion, SC \r\nMatthew Robert Streger Westwood, NJ \r\nMASTER OF ARTS \r\nEconomics \r\nAnja Geissler ___________ Essen, Germany Kristina Terkun ___________ Chantill y, VA \r\nMASTER OF SCIENCE \r\nApplied Psychology \r\nJoseph Christopher Jenkins _ _ _____ Greenville, SC Janet Achenbach McCarten _______ Carmel. NY \r\nIndustrial Management \r\nHarrrnur A. H. Peters Greenville, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCivil Engineering \r\nRobert Eric Burgess Chester, SC \r\nElectrical Engineering \r\nDominic John Ruffolo Somerdale, NJ \r\nMASTER OF SCIENCE \r\nBioengineering \r\nIshmael Bentley II _________ Owingsville, KY Michael K. McRoberts. ________ Greenwood, IN \r\nLeigh Anne Boros Austell, GA Jeffrey Eugene Mega Anderson, SC \r\nCindy Demian Columbia, SC Anupama Vinod Sarma Clemson, SC \r\nKory Patrick Hamel Prior Lake, MN Glenn Anthony Stiegman III Greenvi lle, SC \r\nMatthew Martin Holecko II Youngstown, OH "
    },
    {
        "page_number": "41",
        "text": "Biosystems Engineering \r\nWelch McNair Bostick Greenville, SC \r\nCeramic Engineering \r\nChristopher Byron Chesmut ______ ~Conway, SC Honggu Jiang-----------=- Shanghai, China \r\nPeter James Fernstrom North Augusta, SC Nisanart Navapan Bangkok, Thailand \r\nChemical Engineering \r\nMark Edward Beauharnois. _______ ~Lockport, NY Shiraz Yakub Sheikh--------- Columbia, SC \r\nJeffrey L. Meece Cincinnati, OH Justin Edward Wince Anderson, SC \r\nChemistry \r\nLiyana P.D.N.K. Abayasinghe ______ Clemson, SC James Duncan McClellan _________ Sellers, SC \r\nCivil Engineering \r\nJianhua Guan __________ Shandong, China Mark Joseph Radicchi -------Johnson City, NY \r\nBrian john Michot Moreauville, LA Brett Jackman Whitin Columbia, SC \r\nPaul Roland Moore Beaufort, SC Bradley S. Williams Easley, SC \r\nJohn Regan Prince Greenwood, SC \r\nComputer Science \r\nA ndreas Gerd Arens---- - Maring~Noviand, Germany Vikas Saraogi ____________ Gwalior, India \r\nMark Allen Bever Greenville, SC Vadivel Rajkumar Sreedar Tamilnadu, India \r\nMichael Joseph Bever Greenville, SC Krishnan Sridhar Madras, India \r\nThomas W. Crumpton Pickens, SC Xiaorong Tai Beijing, China \r\nKevin David Guthrie Fountain Inn, SC Sujani Viswanathan Chatham, NJ \r\nNualsawat Hiransakolwong Bangkok, Thailand Xianting Xu JiangX i, China \r\nManoj Bhaskaran Nair Nagpur, India Ling Zhang Shanghai, Ch ina \r\nJeffrey Mark Russo Atlantic City, NJ Sheng Zhang Shan Dong, China \r\nElectrical Engineering \r\nFrederick Joseph Block IV _______ Charleston, SC Pradeep Swethadri Setlur ______ \"7\"Bangalore, India \r\nYen-Chin Chen Taipei, China Choosak Taveekitikun Songkla, Thailand \r\nDurgesh Padmakar Manjure Bombay, India Jeffrey Scott Wysoearski Rochester, NY \r\nSachin D. Sapte Mumbai, India Zhixian Xiang Guangdong, China \r\nEngineering Mechanics \r\nPrapot Kunthong Bangkok, Thailand \r\nEnvironmental Engineering and Science \r\nKimberly Ann Davis __________ Aiken, SC Stacey Heyward Subcr ________ Simpsonville, SC \r\njohn Russell Hackett Beavercreek, OH Roland Dirk Thierbach Niebuell, Germany \r\nSigit Rcliancoro West Java, Indonesia Marc Raymond W<XXlworth Augusta, GA \r\nHydrogeology \r\nCrystal Ann Mattox -------- Fort Mill, SC \r\nIndustrial Engineering \r\nSii ikat Goswami __ =-------Serampore, India Jatin P. Thaker __________ Hyderabad, India \r\nRobert Frnncis Lemon Ill Merritt Island, FL Paresh S. Vakhariya Clemson, SC \r\nArnn Kumm Sriramineni Clemson. SC \r\nMaterials Science and Engineering \r\nJianling Li _____________ Hunan, China Matthew Lee Williams _______ White Springs, FL \r\nDcepak Pingalay Bangalore, India \r\nMathematical Sciences \r\nJeffrey Bryan Farr __________ Greenville, SC Jason Keith Martin Georgetown, SC \r\nl);ivid Cletus G illen Austin, TX Christopher Crevensten Woodard ____ Spartanburg, SC \r\nJennifer Mane LaVare Rouerdam, NY Mary Katherine Zachary Atlanta, GA \r\nMechanical Engineering \r\nKmhnad1tya Goutham Arkalgud Banga lore, India Shane Rabun Martin __________ Pauline, SC \r\nMark Anderson Eley White Plains, GA Guang Yang Beijing, China \r\nChristopher Erringcon Granger __ Hilton Head Island. C \r\nPhysics \r\nJinze Da1 _____________ Gansu, China Michelle Renee Stanley -------- Florence, SC \r\nSanjib Shankar Gupta Calcutta, India Korkut Yegin Tekirdag, Turkey \r\nAndre J;1cobus Muis Greenvi lle, SC \r\nTextile Science \r\nDan Liu ___________ Nanchang, China \r\nTextiles, Fiber and Polymer Science \r\nKrmicrn Asv<thcm _________ Sachom, Thailand Ying Huang ___________ Shanghai, China \r\nChristopher Michael Barr Spartanburg, SC "
    },
    {
        "page_number": "42",
        "text": "COLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\nSonya Vanessa Barnett -------~~Elberton, GA Diane Merritt ____________ Canon, GA \r\nJane W. Franks Clarkesville, GA Jackie Stancil Morgan Eastanollee, GA \r\nCharlotte Rice Harper Hartwell, GA \r\nMASTER OF HEAL TH ADMINISTRATION \r\n(Master of Health Administration is jointly admin istered by Clemson University and the Medical University of South Carolina.) \r\nCardell Elisha Shortt Laurens, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nKelly Ann Broome __________ Anderson, SC Robin Dorothea Jackson-------- Anderson, SC \r\nMandie Colette Campbell Anderson, SC Jane Elizabeth Kasoff Fairfax, VA \r\nJennifer Rebecca Diak Fort Mill, SC Leslie Nicole Murch Greenville, SC \r\nKory Camelia Epps Lake City, SC Heather Caroline Orr Cheraw, SC \r\nGretchen Elizabeth Golden Simpsonville, SC Michael Wallace Pitts Seneca, SC \r\nChris John Hallin Chaska, MN Angela Hope Ridings Spartanburg, SC \r\nDanny Lewis Hammond Lexington, SC Celeste Ray Scott Charleston, SC \r\nAmanda Kellie Harripaul Newrown, PA Bruce Allen Smith Travelers Rest, SC \r\nEric David Hellman Simpsonville, SC Patricia Anne Trent Greenville, SC \r\nSherry J. Herring Fort Myers, FL Tina Evette Collins Woodard Gainesville, GA \r\nReagan Kathleen Hutson Greer, SC Amanda Kei Wright Powdersville, SC \r\nMASTER OF INDUSTRIAL EDUCATION Glenn Alan Doherty _________ Palo Alto, CA Andrew Thomas Long _________ Clemson, SC \r\nEdward Eugene Grant Anderson, SC Madhura Nacaraj Clemson, SC \r\nHeath Jason Lindsey LaPlaca, MD Michelle Rae Spitzinger Upper Marlboro, MD \r\nCrystal Ellison Lominick Pomaria, SC \r\nMASTER OF PARKS, RECREATION, AND TOURISM MANAGEMENT \r\nZuna Mansoor Karachi, Pakistan \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nAlexander Cummings----------.,- Mauldin, SC Penny Spell Knight _________ Simpsonville, SC \r\nJeanne Coker Davis Hayesville, NC Krista Leigh Randall Seneca, SC \r\nGary Scott Dixon Walhalla, SC Sharon Lynne Ross Seneca, SC \r\nMichelle Richey Grant Seneca, SC David Lynn Smith Greer, SC \r\nRobert Warren Hammond Anderson, SC Michael Kent Stroud Newberry, SC \r\nMichael Douglas Hughes Piedmont, SC Anthony Ware Anderson, SC \r\nCounseling and Guidance Services \r\nGwendolyn Elaine Anderson ______ Greenville, SC Robin Gayle Hagy __________ Anderson, SC \r\nMarsha Denise Berry Greenville, SC Mikelle Renee Hicks Greenville, SC \r\nJan Leigh Blake Whitehall, PA Gail Sittmann Hoffman Greenville, SC \r\nPaula Ch ilds Chandler Greenville, SC Mary Elizabeth Lusk Anderson, SC \r\nKancy Tucker Cleve land Easley, SC Vicki W. Miller Seneca, SC \r\nLarene Nott Cruickshank Mauldin, SC Tiffany F. Peters C lemson, SC \r\nSteven Douglas Dean Belton, SC Larry Drew Printz Toccoa, GA \r\nCame Brooke Duggan Gainesville, GA Angela Gail Salyer Whittier, NC \r\nKelly Melinda Fanning Houston, TX Lesley Michelle Sexton AnJerson, SC \r\nMary Beth Green Clemson, SC James A. Wright Seneca, SC \r\nElementary Education \r\nElizabeth Milhous _________ Germantown, MD Earnestine Robinson Williams------- Mull ms, SC \r\nPamela Masters Putnam Six Mile, SC \r\nReading \r\nSuzanne Dupree Collins ________ .Kennesaw, GA Crysrnl Lynn Martin _________ Anderson, SC \r\nAngela Su llivan Garrett Seneca, SC Beth Marie Radford Aiken, SC \r\nGeorgelyn Syneth ia Martin Jeter Rock Hill, SC Barbara Seawright Wagher Greenv ille, SC \r\nSecondary Education \r\nKimberly Sue Eish ----------Columbia, SC Cynthia H. Parker ___________ Seneca, SC \r\nM iriarn Scone Johnson Anderson, SC \r\nSpecial Education \r\nJeanne Miller Hughes--------- Lavonia, GA Nathan Cole Stephens _________ Seneca, SC \r\nSusan Salena Smith Easley, SC \r\nMASTER OF SCIENCE \r\nNursing \r\nLinda Elaine Conn _________ Republic, OH \r\nParks, Recreation, and Tourism Management \r\nTiffany Joy McClinton C lemson, SC "
    },
    {
        "page_number": "43",
        "text": "CANDIDATES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCE \r\nWILLIAM BUSSE WEHRENBERG, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\nAmy Rosetta Gray _________ Woodstown, NJ Erin Marie Lynch _________ Scarborough, ME \r\n*Russell Jacey Kiefer, Jr. Westerville, OH Laura Elizabeth Profit Highlands Ranch, CO \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nSteven Scott Bolt __________ Orangeburg, SC John Tazwell Patton --------~Woodruff, SC \r\nAlison Monroe Gogue Logan, UT Tilden Frederick Riley IV Orangeburg, SC \r\nHugh Comer Morrison Yemassee, SC David McCarver Segars Hartsville, SC \r\nAgricultural Mechanization and Business \r\nCharles Herman Andrews IV --- --~·Sumter, SC Jason Lynn Rodgers ___________ Ward, SC \r\nSamuel Courtney McGee Greenv ille, SC Zachery Scott Tolley Ward, SC \r\nAnimal and Veterinary Sciences \r\nCassandra Lynn Carnes _________ Aiken, SC Annmarie Patrice McAuley ___ Westhampton Beach, NY \r\nEmily Elizabeth Chaplin_ Hartsville, SC Kelley Annette McPhail Seneca, SC \r\nNicola Gaile Gooden Columbia, SC Clark Jaudon O'Neal Johnston, SC \r\n**Laura Elizabeth Huckabee Lexington, SC Tonya Kale Riser Anderson, SC \r\nManha Bruce Leath Chapin, SC \r\nAquaculture, Fisheries, and Wildlife Biology \r\nJonathan Andrew Batson ________ Pickens, SC Marion Derrick Myers _________ Bowman, SC \r\n••Elizabeth Ann Ciuzio Tampa, FL Charles William Rush Greenwood, SC \r\n*Jason Rory Derrick Leesville, SC Jessica Elizabeth Simmons Aiken, SC \r\nMatthew Droze Garrett Clover, SC Kenneth Lynn Tootle, Jr. Beaufort, SC \r\nJason Bradley Hare Summerville, SC Garland Ray Wilkie III Laurens, SC \r\nMatthew Smith Holstein Chapin, SC Travis Wood Wilson Boiling Springs, NC \r\nBiochemistry \r\nWilliam John Berglind _______ Greenville, SC \r\nBiological Sciences \r\nGregory Richard Brownlee ______ Simpsonville, SC Jenny Elizabeth Michi~~------Mt Pleasant, SC \r\nJerbrena Latrice Career Myrtle Beach, SC +••Wendy Lynn Moreland Palm Harbor, FL \r\nE. Owen Cox, Jr. Mt Pleasant, SC Me lissa Ann Paulk Columbia, SC \r\nSteven Lawrence Czarscy, Jr. Fredericksburg, VA Courtney Leigh Rawlings Bethel Park, PA \r\nStan ley Wayne Darnell Piedmont, SC Wanda Lynette Seymour Sumter, SC \r\nMegan Ducate Columbia, SC *Addy Antley Smoke Decatur, AL \r\nFaith Demetria Geiger Mt Pleasant, SC **Elizabeth Lee Scokely Irmo, SC \r\nLiza Corrine Grant Westminster, SC •Veronica Torres Beaufort, SC \r\n*Russell Leon McElveen Florence, SC \r\nForest Resource Management \r\nPaul Baxter Beeson ----------,-.Marion, SC *Kristen Michelle Phillips Toccoa, GA \r\nJacob Horres Brown Newberry, SC **Karl Jerome Pokorny Hagerscown, IN \r\nSunburst Shell Crockett Charleston, SC Robert H. Purvis Summerton, SC \r\n••Harry Howard Crosby III Summerton, SC Kyle Daniel Ratliff Florence, SC \r\nAngie Marie Culler Sandy Run, SC Abena Naya Scott Bowman, SC \r\nMorgan Wells Drakeford Sumter, SC Adam Frederick Scull Rock Hill, SC \r\nC lay Hunter Folk Green Pond, SC Levi Walter Smith IV North Augusta, SC \r\nVa lentijn Hoff Long Creek, SC Travis Douglas Spainhour West Columbia, SC \r\nChad Tindal Lowder St Matthews, SC Frederick Brown Taylor Anderson, SC \r\n•••Robert Bazil Mathes Valparaiso, IN Christopher Blake Towne Charleston, SC \r\nMatthew Allen McCall Florence, SC John Phillip Truesdell Charleston, SC \r\nBenjamin Jackson McNeel Mt Pleasant, SC Benjamin Seabrook Whaley, Jr. ___ Wadmalaw Island, SC \r\nDouglas Ryan Mills Lexington, SC Todd Lewis Woody Rocky Mount, VA \r\nCharles Eugene Odell Ladson, SC \r\nHorticulture \r\nCollin Fredric Buckner --------- Chesnee, SC Gary William Scott ________ Yonges Island, SC \r\nForrest Clay Carter Westminster, SC Sara Adams Sightler Greenville, SC \r\nJames Mcintosh Dargan Darlington, SC Adrienne Virginia Smith Clemson, SC \r\nTanya Arflin Massey Anderson, SC Bradley James Stober Akron, OH \r\nJoshua Harlon Reed Hopkins, SC Adam Warren White Clinton, SC \r\nKevin Reed Rockville, MD Randall Scott Wilhelmson Central, SC \r\n*Mary Elizabeth Reitmeier South Wales, NY Michael Calvin Young, Jr. Joanna, SC "
    },
    {
        "page_number": "44",
        "text": "Medical Technology \r\nKimberlee Pranee Banks -------~-Cheraw, SC Amy Elizabeth Davis _________ Greenwood, SC \r\n*Kimberly Ann Clifcon Greenwood, SC Stacey Renee Wallace Cheraw, SC \r\nMicrobiology \r\nJeffery Wesson Dale ___________ Seneca, SC Dwyane Robert Suber __________ Sa luda, SC \r\nChristopher Court Lapish Greenville, SC Richard Leo Tallier Florence, SC \r\nGabriel Mitchell McAlister Hartsville, SC Roberta Lee Taylor Belton, SC \r\nGenie La Von Parker Hartsville, SC Bryan Robert Young Bishopville, SC \r\nPackaging Science \r\nWilliam Randall Adams ---------,,---Jackson, SC *Christine Marie Schwanda _____ Watkinsville, GA \r\nMichael Brandon Barker Ravenswood, WV Scott Elliott Shelley Green Sea, SC \r\nIvan Scewart Brewington Lancaster, SC ***Trisha Anngelique Uhrick Columbus, OH \r\nJonathan Tyler Hayes Greenville, SC Robert Bradley Walker Aiken, SC \r\nBenjamin Scott Reel Greenville, SC Joshua Allen Woods Myrtle Beach, SC \r\nSteve Benjamin Rowland Greer, SC \r\nPre,Professional Studies \r\nTeresa Lynn Johnson Charleston, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nJAMES FRAZIER BARKER, Dean \r\nBACHELOR OF FINE ARTS \r\n*Kristina Marie Homewood -------Columbia, SC Joshua Paul David Schaffer ________ St Paul, MN \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\nLucius Moore Cline IV ________ Greenvi lle, SC Jason Michael Whinghter _______ Beech Island, SC \r\nBACHELOR OF ARTS \r\nDesign \r\nLeKeith Anshorn Bufford ________ Westville, SC Renee Heather Richardson _____ Kennett Square, PA \r\nEnglish \r\n*Rona ld Bahij Baroody, Jr. -------,,--c-- Florence, SC Chnsropher Brandon Nixon ______ _,, Dansville, NY \r\nAudrey McCants Compton Sullivans Island, SC Charles Walton Pesavento Folly Beach, SC \r\nAmanda Jane Farish Darlington, SC Elizabeth Kate Reid Mt Pleasant, SC \r\nPamela Den ise Goldson Sumter, SC Otis Randolph Taylor, Jr. Columbia, SC \r\nJamie Jo Anne Huggins Williston, SC Walter Gray Tiller Georgetown, SC \r\nTimothy O'Neill Lewis Baltimore, MD Michael David Wade Six Mile, SC \r\nEric C. McGovern Columbia, SC Dawn Margaret Wheeler Saluda, SC \r\nHistory \r\n*David Christopher Caughman -----Columbia, SC Charles Archibald Kemaghan _____ Mt Pleasant, SC \r\nJames Kenneth Cluverius, Jr. Richmond, VA Robert Keith Nelson Elgin, SC \r\n***Lisa Lorraine Devereux Central, SC **Vincent Charles Northcutc Mt Pleasant, SC \r\nWilliam Stanley Dixon Ill Greensboro, NC Ronald Wyatt Simmons Pickens, SC \r\nNicholas Scott Elliott, Jr. Anderson, SC \r\nLanguage and International Trade \r\nJonathan Andrew Blume ________ Columbia, SC Beth Ann Hoover ---------....,.-- Reston, VA \r\nBria Monti Boydston C lemson, SC Alex Javier Ramos Spartanburg, SC \r\nEmma Lacy Chatneuff Roswell, GA Jeffrey Alan Sheets Winston-Sa lem, NC \r\nChristine Marie Clermont Summerville, SC *David John Vaught Seneca, SC \r\nKathryn Sutton Cuthbertson Myrtle Beach, SC Lucille Lee Wilson Wa lhalla, SC \r\nErnest Holloway II North Augusta, SC \r\nModem Languages \r\n*Leah Frances Sauls __________ Hampton, SC Sherice Michelle Walker _______ Georgetown, SC \r\nPhilosophy \r\nMatthew Holden Warren----- Catonsvill e, MD \r\nSpeech and Communication Studies \r\nSarah Edwards Bums _________ Ba ltimore, MD ***Felicia Dawn Merryman _______ Marietta, GA \r\nNatalie Marie Catalano Hilton Head Island, SC Dextra Dewayne Polite Moultrie, GA \r\nJason Ryan Gentry Holly Hill, SC **Meagan Marie Swingle esup, GA \r\nEric David Hagerman Greenville, SC Robert Haefele Trudeau Mt Pleasant, SC \r\nMichael Wayne Jackson Clemson, SC Jeff Hamilton Vessell Simpsonville, SC \r\nNancy Rutland Martin Georgetown, SC Amy Elizabeth Wilson Chester.SC \r\nDwayne Ontrell McCray Sumter, SC \r\nDOUBLE MAJOR \r\nHistory and Political Science \r\n**William Duffie Powers Columbia, SC "
    },
    {
        "page_number": "45",
        "text": "Sociology and Speech and Communication Studies \r\nSusan Kimberly Martin ____ Hilton Head Island, SC \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nJonathan Edward Campbell, ______ Spartanburg, SC Kevin Christopher Lindler ________ Gaffney, SC \r\nDaniel Mario Cipriani Buffalo, NY Joseph Douglas Matthews Marietta, GA \r\nJames Randolph Curtis, Jr. Anderson, SC Gordon Keith McLeod Ill Irmo, SC \r\nNathan Daniel Elliott Seneca, SC Nicholas H. Pagani Rockville, CT \r\nChad John Frederick Valatie, NY Louis Vincent Ruscilli Columbus, OH \r\nDavid Allen Frye Duncan, SC Benjamin Bernard Singletary Lake City, SC \r\nBrice Holmes Harry Darlington, SC Adam Jonathan Thomas Snellville, GA \r\nAlex Brandon Henry Edgewater, MD Jason W. Waddingham Central, SC \r\n*Jason Wade Lecroy Easley, SC \r\nDesign \r\nScott R. Bouchard ___________ Salem, MA Nicole Angeline Lillo~~------- Atlanta, GA \r\n*Emily Elizabeth Cox Mullins, SC Paul Robinson Massengill Ill Easley, SC \r\nJoseph Michael Jett Pacolet, SC *Dawn Elizabeth Pryor Anderson, SC \r\nKoria Kukua Kudjiku Willingboro, NJ Donald Richard Siglin, Jr. Ventnor City, NJ \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nTravis Coleman Cork IV _________ Conway, SC Jeffrey Alan Sheets _______ Winston-Salem, NC \r\nRichard Ingram Horton, Jr. Columbia, SC \r\nPolitical Science \r\n*Danielle Yvonne Clermom ______ Summervillc, SC ***Sherzod Teshaevich Muminov __ Tashkent, Uzbekistan \r\nCandice Arren Jeffords Lamar, SC Stephen Andrew Price West Columbia, SC \r\nJohn Joseph Martinelli Vineland, NJ Jared Zola Great Barrington, MA \r\nPsychology \r\nJennifer Rebecca Ballew Easley, SC *Connelly Casey Harvey _______ Mt Pleasant, SC \r\n*Tracy Kathryn Barnett Acworth, GA Gena Caroline Hughes Powdersville, SC \r\nAutumn Lacea Bodie Seneca, SC *Amanda Kathleen Lahey Longwood, FL \r\n**Mary Harper Boyd Georgetown, SC Daniel John McGrogan North Charleston, SC \r\nHolly M. Brown Columbia, SC Elizabeth Davis Morgan Roanoke, VA \r\nBrent Martin Buckner Greenville, SC Joyce Nifong Pickett Liberty, SC \r\n+•••Emily Jeanne Fornwalt ___ Hilton Head Island, SC *Charles David Scorza, Jr. Pequannock, NJ \r\nTroyann Isabella Gentile Yuba City, CA Michael Jason Shannon Chester, SC \r\nStacy Christine Gibson Seneca, SC Jameitre Willinda Shefton Florence, SC \r\nAshley Wilkes Goebel Columbia, SC Spencer James Space Greenville, SC \r\n*Paul R. Graber Wescminster, SC *Anna Frances Steen Kingwcxxl, TX \r\nYvonne Michelle Greene Lexington, SC *Genevieve Marie Stracos Charlescon, SC \r\nStephenie Ann Hammond Seneca, SC Candace Michael Vickery Anderson, SC \r\nSociology \r\nEdwina Pertish Allgood _________ Seneca, SC Melanie Jean Palmer--------- Anderson, SC \r\nBradley Jason Brewer Walhalla, SC *Michael Timothy Shapiro Marietta, GA \r\nAmy Boggs Giles Seneca, SC Eric Douglas Thompson Beaufort, SC \r\n*Jordan Shelby Harger Atlanta, GA Wendy Caroline Weil Rockville, MD \r\nAmy Ross Hogberg Anderson, SC \r\nEnglish and Political Science \r\n*Geoffrey Matthew Bentzel Greenville, SC \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nRita Michelle Cothran ________ Honea Path, SC Meredith Ellen McCoy------- Myrtle Beach, SC \r\nDouglas Franklin Cottingham Moncks Corner, SC *Kenneth Derrick Mims, Jr. Sumter, SC \r\nMatthew Chad Cottingim Greenville, SC Marcie Ann Pacterson Greenville, SC \r\nRichard Douglas Cullinan Roanoke, VA Christopher Paul Reidy Bayville, NJ \r\nCatherine Rebecca Fousek Anderson, SC +**Roxanne Louise Rich Donalds, SC \r\nAngela Crystal Gosnell Spartanburg, SC **Lucinda Nan Stallings Columbia, SC \r\nBenjamin Shane Highsmith Taylors, SC LaKeiya Ashawn Stephens Bowman, SC \r\nLeslie Ann Johnson Conway, SC Benjamin Alex Stevens Lancaster, SC \r\nDevin Thomas Kalman Cammack, NY Judon L. Stevens Columbia, SC \r\n*James Joseph Kozar P1ttsburgh, PA *Mary Elizabeth Trull Richardson, TX \r\nAlicia Ann Lynch Ridgeland, SC Shawn Alexander Wienke Aiken, SC \r\nErin Catherine MacGeorge Livingston, NJ "
    },
    {
        "page_number": "46",
        "text": "Economics \r\nAndrew Paul Babb _______ ___,-,---,-~ Taylors, SC Roberto C. Flores ___________ Clemson, SC \r\nFrank Carmine Caporusso North Potomac, MD Brian Patrick Gantt Clemson, SC \r\nKevin Michael Elden Laurel, MD Craig Victor Hallman Gilbert, SC \r\n*Matthew Randolph Eskridge Mauldin, SC Edward Brayden Parks Mt Pleasant, SC \r\nFinancial Management \r\nR. Glen Adair ___________ Greenville, SC Cynthia Chrystine Maddox _______ ----,~Pelzer, SC \r\nDamon Dwight Barker Salem, SC Christa Eleanor Martin McCormick, SC \r\n••Vera Jacqueline Beasley Florence, SC Joseph Brian McNeill Columbia, SC \r\nJames Scott Bloemker Levittown, PA Melissa Anne Meyer Florence, SC \r\n*Walter Thomas Burke Ill Charleston, SC Casey Alan Peters Point Pleasant, NJ \r\nDavid Richard Coggins, Jr. Laurens, SC Jack William Ramos North Augusta, SC \r\nKevin Charles Cote Charleston, SC Jonathan James Reid Hanover, MA \r\nJesse Michael Cubbison Orangeburg, SC Kathryn Denise Robertson Greenville, SC \r\nMarcus Andrew Decry Oshkosh, WI +•Jenifer Marie Robinson Clover, SC \r\nJames Ralph Hardin Ill Baxley, GA Sandra Hope Shands Pauline, SC \r\nJohn Mauldin Hoffman Dublin, GA Elizabeth Margaret Story Darien, CT \r\nCarrie Ann Hoover Marietta, GA Tom Chi-Hoo Tse Myrtle Beach, SC \r\nAshley Rebecca Kingsmore Moore, SC Jamael Goodwin Tucker Paget, Bermuda \r\nEric Brian Laquiere Charlescon, SC Kevin Peter Varkoly Newton, NJ \r\nStacy Marie Lauderdale Hilton Head Island, SC Todd Joseph Wasilewski Fenton, Ml \r\nShawn Thomas Leonardi Staten Island, NY Mary Elizabeth Wilborn Spartanburg, SC \r\nDavid Christopher Lusk North Augusta, SC \r\nGraphic Communications \r\nAshley Crawford Bowers _______ Simpsonville, SC *Vanessa Catherine Nunnally _____ Westminster, SC \r\nKatrena Ellen Callahan Erlanger, KY •Carol Lynn Parkinson Clifton Park, NY \r\nBradford Franklin Cardell Greenville, SC Scott Joseph Pavao Geneva, IL \r\nDeborah Lloyd Carson Columbia, SC Benjamin Durham Price North Augusta, SC \r\nAnthony Francis Cayetano Goose Creek, SC Ashley Elizabeth Reese Greenville, SC \r\nVictoria Socorro Dulay Bartow, FL Erich Paul Rodenberg Charleston, SC \r\nColeman Ellenberg Greenville, SC Mandy Michelle Rowland Charleston, SC \r\nJeffrey Lee David Ellis San Diego, CA *David Oscar Sheriff, Jr. Seneca, SC \r\nBrent Cobia Frampton Mt Pleasant, SC Ryan Daniel Edward Sorrels Centerville, OH \r\nRebecca Lynn Freeman Greenville, SC Allison Brooke Suddeth Easley, SC \r\n*Michael Patrick Hayden Columbia, SC •Amanda Caroline Terrell Florence, SC \r\nHayden Leigh Hesse Mt Pleasant, SC Peter Scott Tortora Manassas, VA \r\n+•Heather Anne Lankford Pittsburgh, PA Aaron David Warren Columbia, SC \r\nKeri Ann Lipscomb Newberry, SC Jamie Diane Warson North Augusta, SC \r\nJonathan Wesley Ludwig Inman, SC Holly Taylor Williams Cold Spring Harbor, NY \r\nElizabeth Louise McElveen Kingstree, SC John Alan Witherspoon Greer, SC \r\nDouglas Michael Morro Old Tappan, NJ Tiffany Hope Woodford Easley, SC \r\nJames Halbert Moseley Ill Gastonia, NC Russell Vernon Yates C lemson, SC \r\nIndustrial Management \r\nRyan Michael Chun _________ Grccnvillc, SC Matthew Todd Moore __________ Easley, SC \r\nCornelius Jcrel Cunningham Laurens, SC John Ryan Weaver Morristown, TN \r\nH. Lee Drumhiller Mission Viejo, CA Jonathan Luke Woody Fountain Inn, SC \r\nManagement \r\nMichael Linwood Blanding, Jr. Sumter, SC Bradley Edward Lisman Charlotte, NC \r\nRobert Allen Boozer Columbia, SC James Thomas Martin Anderson, SC \r\nEric Daniel Brunault Salisbury, MA Brian Patrick McCall Kingsport, TN \r\n+•Kasie Summer Campbell ____ North Myrtle Beach, SC Jennifer Avice Mizell North Charleston, SC \r\nDavid William Cecil Ill Spartanburg, SC Jennifer Guerin Morris Pickens, SC \r\n•Joohyung Chung Seoul, Korea Jesse Andrew Roberts Wyoming, DE \r\nDennis Ryan Coleman Easley, SC Bryn Colette Sarvis Irmo, SC \r\nBradley Claud Crain Aiken, SC Scan Patrick Skelly Middletown, NY \r\nRobert Patton Durrett Montreal, Quebec **Ray Willard Smith Ill Rock Hill, SC \r\nMichael Robert Elliott Chadds Ford, PA Elizabeth Ashley Stewart Hartsville, SC \r\nLee Augustus Froneberger Greenville, SC Andrew J. Taulbee Tucker, GA \r\nRichard Todd Garrison Pendleton, SC Michael Hampton Taylor Batcsburg, SC \r\nDaniel D. Goldrick Florence, SC James Gordon Thompson, Jr. Montgomery, NJ \r\nJohn Ohlen Cates Greene Gainesville, GA +**Sara Elizabeth Tracy Sandwich, NH \r\nIan Davenport Guerry Richmond, VA William Byrd Traxler Ill Greenville, SC \r\nCarla Lynn Holzer Anderson, SC Thomas Edward T ricken, Jr. Taylors, SC \r\nThomas Michael Hopkins Madison, CT Erin Suzanne Williamson ____ Cranberry Township, PA \r\nStephanie Leigh Keyeck Atlanta, GA Richard Craig Wooten Anderson, SC \r\n*Eric Christopher Kuehnen Wall, NJ "
    },
    {
        "page_number": "47",
        "text": "Marketing \r\nRyan Todd Abrams Spartanburg, SC Michael Shane McGuffin _______ Westminster, SC \r\nCharles Robertson Allen Summerville, SC Brian Steven Mercier Easley, SC \r\n•Meredith Lynn Backes Manasquan, NJ Michael Bruce Miller Dalton, GA \r\nLisa Marie Bartletc Orchard Park, NY Eric Steven Moeves Cincinnati, OH \r\nAlison Rebecca Biondi Monterey, CA B. Grey Moore Clearwater, FL \r\nJason Sanders Blanton Spartanburg, SC Mary Michon Morrow Lexington, KY \r\nRobert Roland Bradford Ill Columbia, SC Theofilos E. Mougros Tarpon Springs, FL \r\nSeth Charles Brizek Oley Valley, PA *Kelly Anne Nettles Charleston, SC \r\nKurt William Bultmann 11 Seminole, FL Ryan Christopher Newell Burtonsville, MD \r\nSara Ann Burkett Florissant, MO Patrick Andrew Nitsche Greer, SC \r\nJeffrey William Christner Newtown, CT Jimese Sherrie Orange Columbia, SC \r\n•Meghan Casey Clabaugh Hilton Head Island, SC Patrick Langdon Owens Mt Pleasant, SC \r\n+••Anna Meredith C lark Simpsonville, SC Mark Register Pantsari Columbia, SC \r\nWilliam Avery Clark Marietta, GA Jeffrey Brian Pratt West Stockbridge, MA \r\nMattie Beulah Collins Liberty, SC Torey Damian Proctor Simpsonville, SC \r\n•••Jacqueline Marie Cooper Greenville, SC Kevin Charles Purcer East Granby, CT \r\nShannon Lee Dupler Manhattan, KS Troy Anthony Pusateri Baltimore, MD \r\nFrank Buist Eaves Ill Rock Hill, SC Darius Fitzgerald Rapley Greenville, SC \r\nDavid Marshall Evans, Jr. Abbeville, SC Margaret Ann Riley Shoreham, NY \r\nStacey Jean Finner Macon, GA Danielle Marie Satterfield Greenville, SC \r\nDaniel Sorrell Fnck Gaithersburg, MD Stephen Moore Schott Wichita Falls, TX \r\nJennifer Leigh Fries Frederick, MD •Darrel James Seaman Daytona Beach, FL \r\nKerri Lee Gamble Cades, SC Richard Bruce Sizemore Greenville, SC \r\n•Trenton Phillip Hardee Spartanburg, SC Sarah Courtney Smith Vineland, NJ \r\nMatthew Clinton Hines Harcsville, SC Stacy Lyn Smith Point Pleasant Beach, NJ \r\nJeffrey Tate Holley Iva, SC *Meredith Lea Starkey Lexington, SC \r\nJeremy Charles lwaszkowiec St Peters, MO Danielle Susan Stauffer Dagsboro, DE \r\nKelly Marie Jadlot Greenwood, SC Matthew Edward St. Louis Moore, SC \r\nBlanca Teresa Johns Fort Lauderdale, FL Jonathan Byron Storck Queens, NY \r\nJason Ellis Kamlet Englewood, CO William Larry Tolbert Ill Prosperity, SC \r\nChristopher Wayne Long Damestown, MD Ryan Vincent Tsai Joliet, IL \r\nChamp James Madigan Ill Orlando, FL Scott C. Tyndale Chester, NJ \r\n*Adam Curtis Massey Sausalito, CA Shawn Allen Vincent Wyoming, DE \r\nMatthew Maurer Pitcsburgh, PA Kevin Todd Waters Irmo, SC \r\nHeather Lynn McDonald ____ Cranberry Township, PA \r\nPre#professional Studies \r\n•Jennifer Ashley King _________ Easley, SC \r\nPsychology \r\nMarietta Abadies Campbell _________ Iva, SC •••M. Chantay Ivester--------- Clayton, GA \r\nJay Christopher Cole Greenville, SC Rion Reid Odom Harcsville, SC \r\n***Erin Laurel Fields North Augusca, SC Dana Marie Page Florence, SC \r\nBryan Marshall Hansen Bloomington, MN Jewel Ellen Prichard Aiken, SC \r\nTiffany Antonette Harris Lancaster, SC lain Patrick Cale Roberts Warwick, Bermuda \r\nRhonda Suzanne Hendrix Greenville, SC *Steven Anthony Simpson Anderson, SC \r\nJamal Lombrada Herrera Greenville, SC *William Mark Williams Abbeville, SC \r\nAlex Charles Hudson Goose Creek, SC \r\nSociology \r\nEric Michael Broermann ______ Virginia Beach, VA Matthew Gilbert Hedtke ________ Anderson, SC \r\nJake Douglas Fme Spartanburg, SC ••Cynthia Lyn Picklesimer Highlands, NC \r\nCharley Ann Gordon Anderson, SC Ashley Morrow Warson Easley, SC \r\nKelly Andrew Hancock Seneca, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF ARTS \r\nChemistry \r\nArmaal Rashard Hunter ---------Mullins, SC La Toya Denise James _________ Harleyville, SC \r\nGeology \r\nGary Lonny Clark _________ Anderson, SC \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering \r\nAshley Kay Bryant _______ Ponte Vedra Beach, FL Laura Elizabeth Neil .,.-,..,--------Townville, SC \r\nJames Alan Darby, Jr. Pelzer, SC Maureen Maria Wingfield Largo, FL \r\nCeramic Engineering \r\nJacob Russell Cunningham _____ -,.-~Lexington, NC Paul Barrett Matthews __________ Avon, CT \r\nThomas Quinn Engesser McClellanville, SC Frederic Pare Florence, SC \r\nAlison Fleming Jackson Spartanburg, SC Roy Sean Parton Roebuck, SC \r\nAndrew James MacQueen Watertown, NY Michael Eugene Walker Travelers Rest, SC "
    },
    {
        "page_number": "48",
        "text": "Chemical Engineering \r\nSuzanne Marie Ani _________ Goose Creek, SC Alex Charles Hudson ________ Goose Creek, SC \r\nNaomi Jean Ballenger Spartanburg, SC Jeffery Edward Kemp Columbia, SC \r\nMark Temple Davis Kingsport, TN Tanika Lanell Wallace Barnwell, SC \r\nChemistry \r\n*Victor K. Li ____________ Cheraw, SC *Jessica Dawn Quinlan __________ Yelm, WA \r\nKenneth Germaine Littlejohn Gaffney, SC Kaleta Laveshira Shuler Ridge Spring, SC \r\nPatrick Allen Michener Goose Creek, SC Kirk Durand Thomas Florence, SC \r\nCivil Engineering \r\n*Angela Lyn Allen ----------Clemson, SC William Travis McDowell ________ Pauline, SC \r\nRyan Ernest Allen Anderson, SC *Todd Pennock Mercer Dover, DE \r\nSteven Grant Branyon Honea Path, SC Michael Randolph Moseley, Jr. Anderson, SC \r\n*James Coleman Curry Ill Cheraw, SC *Brian George Nickerson Gainesville, FL \r\nChad Richard Elledge Lexington, SC Michael Glenn Norkett Spartanburg, SC \r\nRyan Thomas Galasso Lawrenceville, GA *David Carson Pelfrey Easley, SC \r\nClifton Thomas Goldsmith Holmdel, NJ Reynold D. Peterson Pamplico, SC \r\nJohn Leo Grady, Jr. Summerville, SC Ryan Patrick Ray Columbia, SC \r\nRichard Ryan Haddock Kingstree, SC Susannah Jacqueline Sigaloff Greenville, SC \r\n*Michael Hoyt Hamilton Chapin, SC Henry Monroe Simpson Ill Hartsville, SC \r\nRonald Michael Jaruzel Moncks Comer, SC John J. Stroke Chapin, SC \r\nMichael Kelly Victor, NY Katina Sherell Thompson Lake View, SC \r\n*Michael Deane Kleven Huntington Beach, CA •••John Michael Waters Iva, SC \r\n***Bryan Thomas Lechner Danbury, CT Barney Doyle Zeigler Orangeburg, SC \r\nComputer Engineering \r\n*Trent Jason Bradberry ________ Anderson, SC Joseph Brent Owens ________ Myrtle Beach, SC \r\nKatherine Jo Ann Chisholm Fallston, MD +*Rajiv A. Patel Myrtle Beach, SC \r\n+**Ethan David Farquhar Greenville, SC Michael Scott Patterson Greenville, SC \r\n+***Karen Louisa Gray Anderson, SC *Brian Douglas Redd Greer, SC \r\n*Khadija Jirari Rabat, Morocco Wesley Leyton Renfroe Greenville, SC \r\nChristopher Allen Jones Greenville, SC Joshua Joseph Stenger Tabernacle, NJ \r\nSean Lee Keller Hanahan, SC *Bryan Lee Wilson Charleston, SC \r\nJason Andrew Miller Rock Hill, SC \r\nComputer Information Systems \r\nCornelius Cooper _________ Georgetown, SC Robert Edward Johnson ________ Kingsport, TN \r\nNancy Kay Greer Belton, SC **Nicola Michele Page Greenville, SC \r\nTonyna Autry Hudgens Belton, SC Robert Curtis Parker Atlanta, GA \r\nComputer Science \r\n***Rachel Lynn Adams--------~ Aiken, SC *Robert Kenneth Johnston _______ ~ Easley, SC \r\nAudrey Rena Alexander Fort Lawn, SC Byeong Un Lee Greenville, SC \r\n*Thomas Manin Auchter Cincinnati, OH **Timothy Scott Rawls Atlanta, GA \r\nJason Scotc Barden Seneca, SC ***Kristin Lee Reid Montclair, VA \r\nDavid Robert Dilworth Greer, SC Kenneth Scott Sandefur Greer, SC \r\nYasin Mohamed Esma ii Dar Es Salaam, Tanzania Henry Gibson Williamson Simpsonville, SC \r\nAlmon Eagles Fountain Ill Anderson, SC Ariel Wolfer Clemson, SC \r\nRonnie Craig Hyams Greenville, SC \r\nElectrical Engineering \r\n*Dennis Tyree Ancrum ________ Hollywood, SC *David Brian Mattison _______ Spartanburg, SC \r\nDelia LaShaye Bromell Conway, SC William Frederich Munn Mt Pleasant, SC \r\nJoseph Eric Ellis Charleston, SC Daniel Paul Stirna Naperville, IL \r\nStephen Rayrnone George Cartersville, GA Susanna Mildred Scratmann Columbia, SC \r\nSherisse Alicia Goodwin Columbia, SC Bryson Dial Tucker Irmo, SC \r\nCurtis Anthony Grant, Jr. Hopkins, SC Eric Christopher Venable Waterloo, SC \r\nAndrea Denise Holmes Pinewood, SC Zane Thomas Whiteley Florence, SC \r\nAmanda Jean Lintzenich Cranberry Township, PA Robert A. Williams Springfield, VA \r\nJason Gerard Massey Rock Hill, SC *Wayne Carl Yount Greer, SC \r\nGeology \r\nErvin Erkinda Lane __________ Pomaria, SC Robert Bryan Shealy __________ Moore, SC \r\nLori Leigh Mauldin Greer, SC \r\nIndustrial Engineering \r\nJill Allyn Blocher __________ Knoxville, TN Patrick Brown McClary _______ Simpsonville, SC \r\nEdwin Deleon Boatwright Lodge, SC Heidi Marie Meek Simpsonville, SC \r\nMelanie Lynn Claycon Greer, SC Shawna Lynn Molchan Fairmont, WV \r\nBrian Keith Diebold Anderson, SC Christoper Kennard Pooler Darlington, SC \r\n*Stacy Ann Hanna Wilmington, NC +***Sandra Kay Powers Paincc<l Pose, NY \r\nDouglas Eugene Hemphill, Jr. Spartanburg, SC Andrico Jauron Tanner Spartanburg, SC \r\nMichael Joseph Jerome North Augusta, SC Eric Weathers Watson Cordova, SC \r\nCindy Hsin Lin Greenville, SC *Michael Patrick Williams Fairfax, VA \r\nDeiona Sharene Long Eastover, SC Dawn Nicole WoOOs Lexington, SC "
    },
    {
        "page_number": "49",
        "text": "Mathematical Sciences \r\nMichele Lynn Scotti Whitehouse Station, NJ \r\nMechanical Engineering \r\nJeffery Lynn Barron _________ Greenville, SC David Edward Ramey'--------~~ Easley, SC \r\nJonas Lee Benjamin Greenville, SC +••Marc Christopher Ramsey Collierville, TN \r\nOmar Bravo Anderson, SC Martin Duane Rhodus Camden, SC \r\nRussell Clint Frazier Greenville, SC John Elsworth Robison Anderson, SC \r\n**Robert Emory Gaskins Society Hill, SC +*Brian Tavis Rundgren Egglescon, VA \r\n•••Waddy Thomson Haynie Belton, SC Nathan Andrew Rus.>;ell Blue Ridge, GA \r\nRobert Clinton Hearne Pamplico, SC Jill Ru..,ell Salley Holly Hill, SC \r\nStephanie Patrice Hicks Ninety Six, SC *Harold Bernard Samuels Timmonsville, SC \r\nTyler Warren Jacobs Camden, SC Ernest Andrew Shuler Darlington, SC \r\nBrian B. Johnson Myrtle Beach, SC Justin Bryant Shum Brookeville, MD \r\nDeborah Kaye Johnson Florence, SC David Tristan Smith Anderson, SC \r\n*Robert Moffatt Kennedy IV Myrtle Beach, SC *Timothy Brian Smith Cope, SC \r\nJames Robert Mas.>;ey Goose Creek, SC +••Shayndus Dawn Sperry Greenwood, SC \r\nCourtney Rene Mayes Bluffton, SC +*Matthew Scott Stanford Greenville, SC \r\nJeffery Robert McGowan Brandon, FL Joseph Ephraim Whisenhunt Greenville, SC \r\nDavid Christopher Merli Swiftwater, PA Jeremy Alan White Charleston, SC \r\nJody Alicia Nix Pickens, SC John Claude Wilson JV Newberry, SC \r\nIan Paradis Greenville, SC John Michael Wolf Pittsburgh, PA \r\nMatthew Lee Peterson Portland, OR *Donald Mark Wood Mechanicsburg, PA \r\nChad Edward Porginski Greenville, SC Ian DeShea Yankosky Mt Pleasant, SC \r\nTextile Chemistry \r\nJoshua Daniel Corley ___________ Greer, SC Thomas Lawrence Gilbert _______ Anderson, SC \r\nRobert Wade Finklea Pamplico, SC \r\nTextile Management \r\nRana Ghufran Rasheed _______ Karachi, Pakistan Corey Taylor Reedy ___________ Lugoff, SC \r\nTextile Science \r\nShazad Iqbal ___________ Karachi, Pakistan Usman Shafi ___________ Karachi, Pakistan \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nHAROLD ERNEST CHEATHAM, DEAN \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\nElizabeth Bartlce Akers ________ Columbia, SC +•••Amy Elizabeth Pounds-------- Easley, SC \r\nKrista Marie Ayres Aiken, SC Laura Beth Rush Mauldin, SC \r\n*Brandi Diane Collins Piedmont, SC Karen Beth Sfeir Greenville, SC \r\nNatalie Louise Cordray Charleston, SC **Angela Ruth Shelley Florence, SC \r\nJulie Lynn Cumbee Orangeburg, SC **Kimberly Beth Silkworth Vero Beach, FL \r\nAmy Wright Davies Greenville, SC Allison Ruth Swords Williamston, SC \r\nKirsty Louise Dobbs Sumter, SC Anastasia Marie Trueman Germantown, MD \r\nKelly Eileen Durell Anderson, SC Wenonah Galatea Wells Laurens, SC \r\nBrenna Kaye Johnson Greer, SC Jennifer Gwyn Wethington Greenville, SC \r\nMichelle Lynne Johnson Easley, SC +•••Brooke Danielle Young Lexington, SC \r\nElizabeth Cole Maxwell Jonesboro, GA Jennifer Renee Zappa Allison Park, PA \r\nJennifer Dawn Morgan Greer, SC \r\nElementary Education \r\nAshley Edith Alward _________ Greenville, SC Kimberly Nicole Gibbs _______ Wescminscer, SC \r\nKatie La Pierre Anderson Seneca, SC *Jennifer Allison Hooks Anderson, SC \r\nRyan Douglas Bauer Doylestown, PA Alyson Kristine Humphreys Randolph, NJ \r\n*Margaret Kathryn Black Greenville, SC Rita Michelle Isom Rock Hill, SC \r\n•••Kristie Michele Brennan Ballst0n Lake, NY Laura PotutO Kaufmann East Hanover, NJ \r\nSusanah Elizabeth Chetwood Winston-Salem, NC *Kathleen Ann Mang Charlescon, SC \r\n**Christina Marie Cody Greenville, SC Laura Lynn Norwood Travelecs Resc, SC \r\n+*Dayna Marie Cooper Allendale, NJ Amy Grace Roberts Charlescon, SC \r\nNicole Ann Cooper Kennett Square, PA *Wendy Christina Roberts Greenville, SC \r\nStacey Ann Crandall Columbia, SC *Leah Frances Sauls Hampton, SC \r\nRashuna Elsaria Cunningham Gaffney, SC Sarah Rebecca Sicherman Columbia, SC \r\nCheri Leigh Dapprich Columbia, SC Heather Leigh Spivey Anderson, SC \r\nJanet Elizabeth Davis Aiken, SC Jennifer Lee Stewart Rocky Hill, CT \r\nKeri Dyar Davis Anderson, SC Teri Elizabeth Stokes Greer, SC \r\nAmy Danielle Dickson Seneca, SC Nancy Loraine Swanson Toccoa, GA \r\n*Jes.>;ica Louise Earley Greenville, SC Stephanie Christina Tyner Honea Path, SC \r\nAlyson Christina Edwards Taylors, SC Ja'Nese Shovon Wright Beaufort, SC \r\nUrsula Jane Feurrado Qumcy, MA "
    },
    {
        "page_number": "50",
        "text": "Secondary Education \r\nCatherine Thackston Adams _____ Simpsonville, SC Jennifer Michelle Johnson _________ Greer, SC \r\nElizabeth Finley Cate Columbia, SC Megan Price Jones Greer, SC \r\nSummer Hope Dale Summerton, SC Felicia Gabralee McCommon Walhalla, SC \r\nLindsay Kaye Donald Westminster, SC Carrie Amanda Nixon Abbeville, SC \r\nBrian Keith Feltman Westminster, SC Katherine Danielle Paschal North Augusta, SC \r\nJimmy Marvin Griffin, Jr. Belton, SC Jason Paul Winstead Boiling Springs. SC \r\n*Danny Paul Hamm Boiling Springs. SC April Elizabeth Witherspoon Seneca, SC \r\nDana Catherine Hawkins Belton, SC \r\nSpecial Education \r\nKirsten Marie Odom --------- Columbia, SC Jenny Rene Swizdaryk _________ Anderson, SC \r\nSecondary Education and Spanish \r\nJenny Rebecca Austen Charlotte, NC \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\n*Kelly Jo Andres ----------- Beaufort, SC Jenny Leigh Lawson _________ Spartanburg, SC \r\nStacey Jane Brennan Grayslake, IL Nancy Theresa McGinty Oak Lawn, IL \r\nKristen Dyan Brown Greenville, SC Eric Marcin Ramsey Virginia Beach, VA \r\nAmie Kaye Derrick Seneca, SC Louanne Elizabeth Rotola Anderson, SC \r\nTanya Johnston Dillard Clemson, SC Melissa Ann Sox Lexington, SC \r\nBrian John Everhart Fanwood, NJ \r\nIndustrial Education \r\n*Romona Y. Armstead -------- Metuchen, NJ ••john Wendell Gillespie _________ Seneca, SC \r\nChristopher Kevin Crenshaw Moore, SC \r\nMathematics Teaching \r\nJesse Edward Breneman _____ Palm Beach Gardens. FL Melvin Anthony Robinson, Jr. ______ Columbia, SC \r\nCourtney Myers McCallion Long Island, NY Bryan Douglas Smith Angelus. SC \r\nRyan Lee Player Lancaster, SC \r\nNursing \r\nApril Joy Abercrombie--------- Pickens, SC **Alma~Katherine Rast Hunter _____ Grecnville, SC \r\n••Carol Layt0n Adkins Taylors, SC Karin Lynn Hyatt Simpsonville, SC \r\nAngela Nicole Beam Lugoff, SC *Tara Elizabeth Johnson Columbia, SC \r\nMary Elizabeth Burnett Belton, SC Kimberly Teresa Kamp Seneca, SC \r\nRhiannon Nicole Capps Goose Creek, SC Rebecca Elizabeth Koch Ninety Six, SC \r\n*Cynthia S. Chasteen Taylors, SC Kimberly Michelle Landree Sterling Heights, Ml \r\nLeslie Elizabeth Cribb Camden, SC *Stacey Kratzer Link Lugoff, SC \r\n*Lynn Allyson Curry Fountain Inn, SC Anna Dell Marchant Charleston, SC \r\n**Angela June Davis Easley, SC Michelle Ann Owens Moncks Corner, SC \r\n*Kimberly Michelle DeWitt Columbia, SC *Jennifer Lee Peterson Simpsonville, SC \r\nGina Marie Domis Columbia, SC Iris L. Stovall Greenville, SC \r\n**Nancy Rankin Ewing Anderson, SC *Todd Joseph Cameron Tedesco Greenville, SC \r\n*Jason Cointemente Hadley Columbia, SC ***Marguerite Kathrine Teer Sumter, SC \r\nKellie Katherine Ham Florence, SC Allison Amanda Watts Florence, SC \r\nApril Millicent Hardwick Mullins, SC Ann Mary Wielgus Scotch Plains, NJ \r\nDonna Smith Hemphill Central, SC Debra Kai Wilfong Greenville, SC \r\nRodney Shane Horne Lake View, SC Jennifer Elizabeth Lynn Will Marlboro, NJ \r\n***Ellen Elizabeth Hotz Cincinnati, OH \r\nParks, Recreation, and Tourism Management \r\nBarrie Roberts Alewine ________ Greenville, SC Christine Marie Goepfert-------- Chatham, NJ \r\nChadwick Mitchell Bishop Greenville, SC Elly James Jones Marion, SC \r\nLeslie Jean Bloking Long Valley, NJ William Dee Kirby, Jr. Greenville, SC \r\nJustin Tyson Boggs Central, SC Nancy Hunter Lowder Sumter, SC \r\nPaula Jane Brewer Manning, SC Jay Marshall McAda1ns Greenwood, SC \r\nRoy Edward Broughman Ill Cayce, SC Allison Courtney McNeill Columbia, SC \r\nJoshua Gene Burgess Seneca, SC *Meridith Kathleen Melton Clemson, SC \r\nJames Riley Cathcart Ill Chapin, SC Mark Barrera Molinar Van Horn, TX \r\nJustin Wade Catto Moore, SC Anne Beaumont Nichols Miami, FL \r\nDavid Furman Cave Charleston, SC Mcleana Luika Pierce Charleston, SC \r\nK. Brooke Comer Rock Hill, SC Anna Lorraine Rich Wellford, SC \r\nJason Edward Crawford Central, SC Eileen Benton Skeoch Frederiksted, St Croix \r\nLisa Michelle Dantzler Lexington, SC Erin Elizabeth Weir Sevema Park, MD \r\nAllison Healy Deland Edison, NJ Wendy Leigh Willingham Columbia, SC \r\nJamie Lea Gibson Pickens, SC Andrew Henry Woolum Chapin, SC \r\nScience Teaching \r\nLeverett Marlin Bruner--------- Clemson, SC *Stacy Melton Powell __________ Liberty, SC \r\nAngela Marie Clark Simpsonville, SC Michael Eugene Wald Westminster, SC \r\nNathan Paul Crawford Lancaster, SC "
    },
    {
        "page_number": "51",
        "text": "*Cum laude, A grade point ratio of 3.40 to 3.69 \r\n**Magna cum laude: A grade point ratio of 3.70 to 3.89 \r\n***Summa cum laude: A grade poinc ratio of 3.90 to 4.00 \r\n+Departmencal Honors: The graduates so designated have completed an enriched program of scudy designed by their \r\ndepartments with the approval of the Calhoun College Honors Program. To earn Departmental Honors students must \r\ncomplete an honors thesis and/or other upper division honors courses, while maintaining an overall grade-point ratio of 3.40 or \r\nhigher. Departmental Honors graduates appear in the line of march wearing the Calhoun College Honors Medallion on an \r\norange and purple ribbon. This medallion is made possible by an endowment established by Mrs. Katherine Inabinet Vickery of \r\nColumbia, South Carolina, to honor the memory of her husband and Clemson graduate, the late B. C. Inabinet. \r\nStudents wearing the white stoles over their gowns are members of honorary societies that require a minimum 3.00 grade point \r\nratio for membership. The stoles have the University seal embroidered on one side, and on the other side are the emblem(s) of \r\nhonorary societies in which the student is a member. "
    },
    {
        "page_number": "52",
        "text": "Awards \r\nTHE CLASS OF '39 A WARD FOR EXCELLENCE \r\nIn 1989 on the occasion of the 50'h Anniversary of its graduation from C lemson \r\nUniversity (then the C lemson Agricultural College of South Carolina), the C lass of \r\n1939 established the Award fo r Excellence. It is presented annua lly to a facu lty \r\nmember whose contributions over the immediately preceding five-year period are \r\njudged by the facu lty member's peers to represent the highest achievement of se rvice \r\nto the University and the Student Body. \r\nRECIPIENT OF THE CLASS OF '39 AWARD FOR EXCELLENCE \r\nJUDITH MARY MELTON \r\nProfessor of German and Women's Studies \r\nFACULTY SCHOLARSHIP AWARD \r\nEstablishe<l at Clemson University in 1959, this is presented by the faculty of \r\nC lemson University to the member of the grad uating class who has the highest \r\nscholastic achievement. All graduates who have completed the requirements for the \r\nbachelor's degree since the last commencement exerc ise and who have completed a t \r\nClemson at least 75 percent of the work required for graduation shall be eligible for \r\nconsideration. \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AWARD \r\nSANDRA KAY POWERS \r\nPost, NY \r\nMARGUERITE KA TH RINE TEER \r\nSumter, SC "
    },
    {
        "page_number": "53",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present at any convocation where the University, \r\nthrough its delegated members, is acting officially. At any official convocation \r\nsuch as commencement, the University Marshal, carrying the mace, precedes \r\nthe President into the assembly. The mace rests before the President's chair or \r\nspeaker's stand throughout the ceremony, and its removal from the assembly at \r\nthe close of a convocation is symbolic of the official withdrawal of the \r\nUniversity and, thus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic \r\nclublike shape, however, is much more ancient, probably going back to man's \r\nprehistory. It is made of walnut wood and silver, with the seal of the University \r\nin gold and the University colors represented by insets of carnelian (orange) \r\nand amethyst (purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the \r\noffice of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the whole \r\nbody of the institution. Clemson's chain and seal are made of silver and gold, \r\nand carnelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most \r\nacclaimed goldsmiths of our era. The enamel plaques for the batons were \r\nexecuted by the late Professor Marshall C. Bell, and the lapidary work was \r\nexecuted by the late Mr. C. C. Wilson of Clemson University. "
    },
    {
        "page_number": "54",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green C lemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the \r\nRoyal School of Mines in Paris (1828-1832). His early profession was that of a \r\nmining engineer; however, circumstances diverted his interests into politics \r\nand the life of a southern planter, and he soon became an enthusiastic advocate \r\nof sc ientific agriculture. He had a career as a diplomat (charge d'affaires to \r\nBelgium, 1844-1852) and served as the first Superintendent of Agricultural \r\nAffairs in Washington (1860). As a scientist he published numerous articles in \r\nthe fields of mining, chemistry and agriculture. His varied activities included \r\nhis assistance in the founding of the Maryland Agricultural College, his support \r\nof the Morrill Act, his leadership in South Carolina after the Civil War, and \r\nhis part in founding Clemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two four-year \r\ncurricula, supplemented by two two-year preparatory courses. Today the \r\nUniversity has six major academic units. These are the College of Agriculture, \r\nForestry and Life Sciences, the College of Architecture, Arts and Humanities, \r\nthe College of Business and Public Affairs, the College of Engineering and \r\nScience, the College of Health, Education and Human Development, and the \r\nGraduate School. \r\nThe institution is an accredited member of the Southern Association of \r\nColleges and Schools; various curricula are accredited by the Accreditation \r\nBoard for Engineering and Technology, American Assembly of Collegiate \r\nSchools of Business, American Council for Construction Education, American \r\nSociety of Landscape Architects, Computing Science Accreditation Board, \r\nHuman Factors and Ergonomics Society, International Association for \r\nManagement Education, National Architectural Accrediting Board, National \r\nAssociation of Industrial Technology, National Association of State Directors \r\nof Teacher Education and Certification, National Council for Accreditation of \r\nTeacher Education, National League for Nursing, Planning Accrediting Board, \r\nand Society of American Foresters. \r\nClemson is a land-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is \r\nalso heavily committed to a varied program of public service, including the \r\nwork of agricultura l extension which has professional personnel located in each \r\nof the State's counties. "
    },
    {
        "page_number": "55",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    }
]