[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n5-1-2000\r\nClemson Commencement Program, May 2000\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, May 2000\" (2000). Clemson Commencement Programs. 217.\r\nhttps://tigerprints.clemson.edu/comm_programs/217"
    },
    {
        "page_number": "2",
        "text": "One Hundred Fourth Commencement \r\nMay 12, 2000 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "Congratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for individual \r\ngraduates. Such expressions frequently detract from the recognition due the \r\nnext graduate in line. Your cooperation is respectfully requested. "
    },
    {
        "page_number": "4",
        "text": "9:30 a.m. \r\nGraduation \r\nFriday, May 12, 2000 \r\nLittlejohn Coliseum \r\nORDER OF CEREMONIES \r\n2:30 p.m. \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation.) \r\nInvocation \r\nStephanie Querida Hoyes, Student Representative \r\nParker Lewis Smith, Student Representative \r\nIntroduction of Trustees \r\nPresident James F. Barker \r\nConferring of Honorary Degree \r\nPresident James F. Barker \r\nAddress to Graduating Class \r\nJerod Dequaine Frazier, Student Representative \r\nAshley Lynn Torrence, Student Representative \r\nRecognition of the Deans of the Colleges \r\nVice President for Academic Affairs and Provost \r\nSteffen H. Rogers \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident James F. Barker \r\nRecognition and Presentation of Awards \r\nNorris Medal \r\nAlgernon Sydney Sullivan Award \r\nAlumni Master Teacher Award \r\nFaculty Scholarship Award \r\nAurora Brass Quintet \r\nFrank W. Breazeale, Organist \r\nKevin Davidson, Soloist \r\nDr. Bruce Yandle, University Marshal "
    },
    {
        "page_number": "5",
        "text": "BOARD OF TRUSTEES \r\nLawrence M. Gressette, Jr., Chairman _________ Columbia \r\nWilliam C. Smith, Jr., Vice Chairman Columbia \r\nBill L. Amick Batesburg-Leesville \r\nJ. J. Britton Sumter \r\nLeon J. Hendrix, Jr. Chagrin Falls, OH \r\nHarold D. Kingsmore Aiken \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee Greenwood \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick III Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nAllen P. Wood Florence \r\nTrustees Emeriti \r\nLouis P. Batson, Jr. ________________ Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW. G. DesChamps, Jr. Bishopville \r\nPaul W. McAlister Laurens \r\nPaul Quattlebaum, Jr. Charleston \r\nD. Leslie Tindal Pinewood \r\nJames M. Waddell, Jr. Columbia \r\nExecutive Secretary to the Board of Trustees \r\nJ. Thornton Kirby \r\nADMINISTRATIVE OFFICERS \r\nJames F. Barker _________________ President \r\nSteffen H. Rogers Vice President for \r\nAcademic Affairs and Provost \r\nJohn Kelly ________________ Vice President for \r\nPublic Service and Agriculture \r\nNeill Cameron Vice President for Advancement \r\nAlmeda Jacks Vice President for Student Affairs \r\nScott Ludlow Chief Financial Officer \r\nDavid Stalnaker Executive Director of the Commission \r\non the Future of Clemson and Assistant to the President "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nARTHUR MARTIN SPIRO \r\nDOCTOR OF LAWS \r\nFor over 50 years, Arthur Martin Spiro has tirelessly devoted his time and dedication to \r\nClemson University. As a student in the early 1940s, he was a member of the Executive \r\nSergeants Club and the Calhoun Forensic Society and served as sports editor of The Tiger. \r\nSince then, he has been a contributor to University campaigns and causes, a member of \r\nClemson academic and athletic clubs and programs, and is the founder of the Spiro Center \r\nfor Entrepreneurial Leadership. Mr. Spiro possesses an energy and devotion to Clemson that \r\nis unparalleled. \r\nMr. Spiro received his bachelor of science degree from Clemson University in the mail \r\nin 1945 while serving as a naval officer in the Asiatic Pacific Theatre in WWII. He left \r\nClemson after completing the equiva lent of more than two years' credits in 16 consecutive \r\nmonths and enlisted in the U.S. Navy, which sent him to the V-12 program at Cornell \r\nUniversity. Clemson tracked his education at Cornell and awarded him a degree in \r\nchemical engineering. In 1947, he received a master's degree from the Massachusetts \r\nInstitute of Technology. \r\nHaving been referred to as \"the embodiment of imagination, energy and business \r\nsavvy,\" Mr. Spiro spent 50 years in corporate and entrepreneurial positions in the textile \r\nindustry where most recently he was owner and chief executive of Carleton Woolen Mills \r\nInc., a company he sold in 1994. He currently serves as president of AMS-TEX Enterprises \r\nInc., a management consulting and investing firm; president of TexTech Holdings Inc.; \r\nand chairman of TexTech Industries Ireland Ltd., a manufacturer of industrial fabrics and \r\ntennis ball covering felts. \r\nDuring his illustrious career, Mr. Spiro developed two successful patents for textile \r\nprocessing and became a member of Sigma Xi Honorary Engineering Society at M.l.T., \r\nBeta Gamma Sigma honoree at Clemson and recipient of the Textile Veteran's \r\nAchievement Award. He is a past president of the American Association for Textile \r\nTechnology Inc.; past president of the Textile Distributors Association; honorary trustee of \r\nTemple Beth El of Great Neck, N.Y.; trustee and chairman of the Research Institute of the \r\nNorth Shore/Long Island Jewish Hospital and Health System, the third largest not-for. \r\nprofit health system in the United States; and director of the Cold Spring Harbor Research \r\nLaboratory. \r\nIn his service to Clemson, Mr. Spiro has been chairman of the College of Business and \r\nPublic Affairs Subcommittee of the Commission for the Future of Clemson. He is presently \r\nan adjunct professor in the College of Business and Public Affairs, director of the C lemson \r\nUniversity Foundation since 1992, contributor to the Clemson University Foundation for \r\n53 consecutive years, member of the Presidential Advisory Counci l since 1991, life \r\nmember of the Walker Course, !PTA Y member for 54 consecutive years and founding \r\nmember/director of the Clemson Corps (R.O.T.C.). \r\nMr. Spiro's greatest contribution to Clemson, however, may be the Arthur M. Spiro \r\nCenter for Entrepreneurial Leadership, located in the College of Business and Public \r\nAffairs on the Clemson campus. Mr. Spiro and his wife, Joan, donated $2 million to \r\nestablish a center that combines teaching, research and participation of le ading \r\nentrepreneurs from across the country to give students the opportunity ro learn how to be \r\nsuccessful entrepreneurs and to assume leadership roles in establishing and operating \r\nbusinesses. \r\nBecause of his relentless zeal and enthusiasm for Clemson, his service and support, and \r\nhis participation in developing young minds, it is with great honor and pleasure that we \r\nrecognize Arthur Martin Spiro by presenting him the honorary Doctor of Laws degree. "
    },
    {
        "page_number": "7",
        "text": "JEROD DEQUAINE FRAZIER \r\nA graduating senior from Charleston, South Carolina, Jerad Dequaine Frazier is a \r\nPolitical Science major. During his years at C lemson, he has been a member of the Gospel \r\nChoir, the Black Student Association, and the South Carolina Student Legislature. He \r\ndistinguished himself by earning the Best Attorney Award in a mock supreme court case in \r\nthe South Carolina Student Legislature. \r\nASHLEY LYNN TORRENCE \r\nAshley Lynn Torrence comes to Clemson from Charleston, South Carolina. She is a \r\nsophomore majoring in Speech and Communication Studies and Political Science. In \r\naddition to being a member of several clubs on campus, Ashley has been honored as a \r\nrecipient of the 1999-2000 Tiger Cup and the John C. Calhoun Forensic Scholarship as \r\nwell as the winner of the 97'\" Annual Trustees' Medal for Oratorical Excellence. "
    },
    {
        "page_number": "8",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, \r\na senior faculty member, with the college baton, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the \r\nAmerican Counc il on Education, are as fo llows: \r\nCollege \r\nAgriculture, Forestry and Life \r\nSc iences \r\nArchitecture, Arts and \r\nHumanities \r\nBusiness and Public Affairs \r\nEngineering and Sc ience \r\nHealth, Education and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and O range \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitect ure \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSoc ial Sciences \r\nLibra ry \r\nAcademic Support \r\nInstruc tion \r\nCollegiate faculty fo llow their marshal in order of academ ic rank wearing aca demic \r\ncostumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United States wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions a re \r\nspecified by a uniform code maintained by the American Council on Education. Caps are \r\nblack and are usua lly mortar boards with tasse ls. Doctors of Philosophy wear gold tasse ls \r\nusua lly of metallic thread; other degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is to replace black ve lvet \r\nwith velvet in the discipline color. A second variation is a colored gown usua lly of the \r\nuniversity's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awa rding \r\ninstitution. First, degree leve l is sign ified by the size of the hood with bachelors' sma llest, \r\nmasters' larger, and doctors' quite large and of a different shape. C lemson does not awa rd \r\nhoods to bachelors. The width of the velvet trim also conveys the degree. Secondly, the \r\ndegree is indicated by the color of the trim edging the hood to form the throat over the gown. \r\nThe most frequently seen is dark blue, which designates the doctor of philosophy (Ph.D.) \r\ndegree. Finally, the color of the hood's lining specifies the awarding institution. The colors \r\nare displayed in combinations that are drawn from hera ldry. Notice that the C lemson \r\nUniversity hood is lined with purple through which is an orange chevron (a \"V\"). Although \r\nmany combinations are duplicated by dozens of institutions, Clemson is presently the only \r\ninstitution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastica l, or military \r\nregalia as set forth by their professions. They are preceded by the University Marshal. C lad \r\nin a gown of office in gold and purple, the marshal wears no hood and bears the University \r\nmace. At the ceremony's close, the faculty do not exit as a part of the recessional but a re \r\ndismissed, along with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "9",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present at any convocation where the University, \r\nthrough its delegated members, is acting officially. At any official convocation \r\nsuch as commencement, the University Marshal, carrying the mace, precedes \r\nthe President into the assembly. The mace rests before the President's chair or \r\nspeaker's stand throughout the ceremony, and its removal from the assembly at \r\nthe close of a convocation is symbolic of the official withdrawal of the \r\nUniversity and, thus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic \r\nclublike shape, however, is much more ancient, probably going back to man's \r\nprehistory. It is made of walnut wood and silver, with the seal of the University \r\nin gold and the University colors represented by insets of carnelian (orange) \r\nand amethyst (purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the \r\noffice of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the whole \r\nbody of the institution. Clemson's chain and seal are made of silver and gold, \r\nand carnelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most \r\nacclaimed goldsmiths of our era. The enamel plaques for the batons were \r\nexecuted by the late Professor Marshall C. Bell, and the lapidary work was \r\nexecuted by the late Mr. C. C. Wilson of Clemson University. "
    },
    {
        "page_number": "10",
        "text": "CANDIDATES FOR THE DOCTOR'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nApplied Economics \r\nThomson Fontaine Grand Fond, Dominica \r\nB.S., Un iversity of the West Indies; M.A., Clemson University \r\nDissertation: Currency Crises in Developed and Emerging Market Economies-A Comparative Empirical Treatment \r\nAdvisor: Dr. M. S. Wallace \r\nLouis Raymond Lanier Lugoff, SC \r\nB.S., C lemson University \r\nDissertation: Multi-length Scale Analysis of Chemical Vapor Deposition (CVD) of Diamond and Titanium Nitrate Films \r\nAdvisor: Dr. M. Grujicic \r\nPeter Christopher Melvin _____________________________ Winter Springs, FL \r\nB.S., Florida Seate University; M.A., Clemson University \r\nDissertation: Golf Course Market Analysis: Structural Hedonic Demand and Supply Estimates \r\nAdvisor: Dr. R. E. McCormick \r\nRodney Joseph Paul _________________________________ Ash land, PA \r\nB.S., Lebanon Valley University; M.A., Clemson University \r\nDissertation: The Savings Rate and its Determinants: A Time Series Approach \r\nAdvisor: Dr. W. R. Dougan \r\nMinsup Shim Oncario, Canada \r\nB.S., M.S., Korea University; M.S., Kansas State University; M.S., Un iversity of Florida \r\nDissertation: An Economic A nalysis of Socioeconomic and Demographic Determ inants of the Consumption of Cereal and Cereal \r\nProducts in the Un iced States \r\nAdvisor: Dr. M. D. Hammig \r\nEnvironmental Toxicology \r\nCynth ia Sills Ropesville, TX \r\nB.A., Case Western Reserve University; B.S., University of Idaho; M.S., Idaho Seate University \r\nOissercacion: Effects of S ix Endocrine Oisrupcors and Their Binary Mixtures on American A lligacors (Alligator mississippiensis), \r\nNorthern Bobwhites (Cul inus v irginianus), and Deer Mice (Peromyscus manicilacus) \r\nAdvisor: Dr. R. L. Dickerson \r\nFood Technology \r\nAnjum Basher Anderson, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Color Improvement and Shelf#Life Extension of Fresh Red Meats Packaged with Chicosan Coated Films \r\nAdvisor: Dr. R. L. Thomas \r\nAnju Rao Hyderabad, India \r\nB.S., M.S., Andhra Pradesh Agricultural University \r\nDissertation: Optimi za tion and Characterization of Membrane Processed Soy Protein Concentrate \r\nAdvisor: Dr. R. L. Thomas \r\nJack Leroy Wiles, Jr. Anderson, SC \r\nB.S., M.Ag.Ed., Clemson University \r\nDissertation: The Effect of Re lative Humidity on the Steady State Water Vapor Permeability of Ch icosan Fi lms \r\nAdvisor: Dr. P. J. Vergano \r\nForest Resources \r\nWilliam Mckelvey Baughman'---------------------------- Summerv ille, SC \r\nB.S., Un ive rsity of Georgia; M.S. Clemson University \r\nOissercacion: The Effect of Corridors o n Herpecofauna Assemblages in Intensively Managed Forests \r\nAdvisor: Dr. D. C. G uynn \r\nWilliam Thomas Zawacki _______________________________ Roanoke, VA \r\nB.S., Virginia Polytechnic lnscicuce & Scace University; M.S., C lemson University \r\nDissertation: Methodological Advancements of Trave l Cose Models \r\nAdvisor: Dr. A. P. Marsinko \r\nGenetics \r\nSook Jung Pusan, Korea \r\nB.S., Pusan National University; M.S., Clemson University \r\nOissercation: Molecular Analysis of High O leate Trait and Molecular Evolution of Low#Copy Genes in an Allotecraploid Peanut \r\n[Arach is Hypogaea L.] \r\nAdvisor: Dr. A.G. Abbott "
    },
    {
        "page_number": "11",
        "text": "Genetics (concinued) \r\nNaoma Suzanne Nelsen El Dorado Springs, MO \r\nB.S., Souchwest Mis.souri Stace University; M.S., Texas A&M University \r\nDissertacion: The Role of Wheat Em Gene Non-coding Sequences in Pose-transcriptional Regulation of Gene Expression \r\nAdvisor: Dr. W. R. Marcotte, Jr. \r\nYeisoo Yu ~~--,.--,-,-----------------------------Seoul, South Korea B.S., M.S., Kyung Kee University \r\nDissertation: Development and Appli cation of Research Tools for Plane Genomics \r\nAdvisor: Dr. R. A. Wing \r\nMicrobiology \r\nWilliam Madison Harley Ill Clemson, SC \r\nB.S., M.S., University of Georgia \r\nDissertation: Growth of Lacwbacillus Plamarum BFOOI and Production of plancaricin F, An Antimicrobial Substance, in Batch and \r\nContinuous Cu ltures \r\nAdvisor: Dr. M. J.B. Paynter \r\nFerda Soyer ____________________________________ lzmir, Turkey \r\nB.S., Hacettepe University; M.S., C lemson University \r\nDissertation: Investigations on the Mechanisms of the Regulation of Carbon Dioxide Fixation in che Thiobacilli \r\nAdvisor: Dr. S. F. Barefoot \r\nSandra Paige Story Easley, SC \r\nB.S., Un iversity of Massachussetts-Amherst Campus; M.S., Nevada Las Vegas University \r\nDissertation: Auxotrophic Analysis co Determine the Catabolic Pathways for the Utilization of Polycyclic Aromatic \r\nHydrocarbons by Sphingomonas poucimobilis EPA505 \r\nAdvisor: Dr. E. L. Kline \r\nPlant Pathology \r\nSupramana ,.-,---,--,.----~~----,.-~------------------ Boger, Indonesia \r\nB.S., Gadjah Mada University; M.S., Boger Agricultural University \r\nDissercation: Basic Biology and Cu lturing of Honlolaimus columbus (Nemata: Tylenchoidea) \r\nAdvisor: Dr. S. A. Lewis \r\nPlant Physiology \r\nPhilip Gregg Gibson -------,------~--------------------Commerce, GA B.S., Ok lahoma State University; M.S., University of Georgia \r\nDissertation: Grafc-T ransmissible Effects of 'Ta Tao 5' Peach \r\nAdvisor: Dr. G. L. Reighard \r\nZoology \r\nMichele Lyn Barry Acton, MA \r\nB.S., Framingham State College \r\nDissertation: Plane Growth and Development Along a Nutrient Gradient in a Constructed Wetland for Waste Water Treatment \r\nAdvisor: Dr. J.E. Schindler \r\nKemal Celik ----,-,---,--,--,...,.-.,-,.--...,.-,----------------------·Adiyaman, Turkey \r\nB.S.C., University of Istanbul; M.S., Lamar University \r\nDissertation: Plankton Ecology of Lake James \r\nAdvisor: Dr. J.E. Sch indler \r\nJoAn Strine Hudson Pendleton, SC \r\nB.A., Southern Wesleyan University; M.Ag., C lemson University \r\nDissertation: The Evaluation and Classification of Lesions Attending Abnormal Surface Encounters Within the Fetal Habitat \r\nAdvisor: Dr. J.P. Wourms \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nDOCTOR OF PHILOSOPHY \r\nIndustrial Management \r\nAmy B. Woszczynski --~~----------------------------Marietta, GA B.E., Georgia Institute of Technology; M.B.A., Kennesaw College \r\nDissertation: Exploring the Theoretical Foundations of Playfulness in Computer Interactions \r\nAdvisor: Dr. P. L. Roth \r\nlndustriaVOrganizational Psychology \r\nThomas Lloyd Killen Easley, SC \r\nB.S., Wofford College, M.S., Clemson University \r\nDissertation: Effects of Incentives and Instructions co Take in Five-Factor Personality Dimensions: Impression Management as a \r\nModerator \r\nAdvisor: Dr. M.A. Taylor "
    },
    {
        "page_number": "12",
        "text": "Management Science \r\nArthur Matthew Field Easley, SC \r\nB.A., J.D., Rutgers University \r\nDissertation: Applying Monte Carlo S imulation Techniques to Amusement Park Queueing Protocols to Reduce Waiting Time \r\nand Enhance Cuscomer Satisfaction \r\nAdvisor: Dr. P. C. Kiessler \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nBioengineering \r\nJoel Thomas Corbett_~------------------------------- Camden, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Study of the Controlled Release of Bioactive Agents from Absorbable Ge l Formers \r\nAdvisor: Dr. R. L. Dooley \r\nChaodi Li-=---=-...,.-----,..,-------------------------------Hainan, China \r\nB.E., M.E., Tsinghua University \r\nDissertation: Progressive Failure Analysis of a Laminated Composite Femoral Component for Total Hip Arthroplasty \r\nAdvisor: Dr. R. A. Latour \r\nBiosystems Engineering \r\nRobert King Pollock ~-~-~-----~~----,...~---::----------------Columbia, SC \r\nB.S., University of South Carolina; B.A., Hiram College; M.S., Clemson University \r\nDissertation: Heat Transfer Model for a Micro-Hydroponic Green House Chamber \r\nAdvisor: Dr. W. H. Allen \r\nChemistry Terri Ellen Gibeau ________________________________ Ann Arbor, Ml \r\nB.S., University of Michigan \r\nDissertation: Development of Glow Discharge Ion Sources for Diverse Applications in Mass Spectrometry \r\nAdvisor: Dr. R. K. Marcus \r\nTina Rose Harville Danville, VA \r\nB.S., Mary Washington College \r\nDissertation: Analytical Applications and Evaluation of a Radio-Frequency Glow Discharge Source for Atomic Emission \r\nSpectrometry \r\nAdvisor: Dr. R. K. Marcus \r\nScott Craig Savett Lafayette Hill, PA \r\nB.S., Ursinus College \r\nDissertation: The Characterization of New Fluorinated lonomers for Use in Polymer Electrolyte Membrane (PEM) Fuel Cells \r\nAdvisor: Dr. S. E. Creage r \r\nJustin Matthew Wright ______________________________ Winchester, VA \r\nB.S., Shenandoah University \r\nDissertation: Chemical and Biological Properties of Designed Enediynes \r\nAdvisor: Dr. G. B. Jones \r\nComputer Engineering \r\nNicolae Peter Costescu ...,--..,----,...c-=----=.,-----::-.,--------------------Arlington, VA B.S., Virginia Polytechnic Institute; M.S., Clemson University \r\nDissertation: Real-Time Software for Control and Robotic Applications \r\nAdvisor: Dr. D. M. Dawson \r\nFeng Xie -,-:::-::---,---,-:-------------------------------FuJian, China B.E., M.S., Southeast University \r\nDissertation: Modeling and Performance Analysis of a Split-TCP Scheme for Mobile Internet Access \r\nAdvisor: Dr. D. L. Noneaker \r\nElectrical Engineering AmrG. Bahbah ___________________________________ Giza, Egypt \r\nB.S., M.S., Cairo University \r\nDissertation: Power System Transient Stability Assessment for Real-Time Applications \r\nAdvisor: Dr. A. A. Girgis \r\nEngineering Mechanics \r\nWilliam Lee Herron Cincinnati, OH \r\nB.S., Valparaiso University; M.S., University of Cincinnati \r\nDissertation: High Cycle Fatigue Life Prediction Model Including the Effects of Prior Cold Work and Residual Stress \r\nAdvisor: Dr. J.M. Kennedy \r\nKaushal Kumar Verma Korba, India \r\nB.S., Banaras Hindu University \r\nDissertation: Development of Far Infrared Fizeau lncerferomecry for Warpage Measurement of Rough Dieleccric Surfaces \r\nAdvisor: Dr. B. Han "
    },
    {
        "page_number": "13",
        "text": "Industrial Engineering \r\nHector Daniel Him Sanciago, Panama \r\nB.S., Technological University of Panama; M.S., University of Florida \r\nDissertation: Use of Asynchronous Learning Network co Supporc Classroom Instruction: Methodology and Findings \r\nAdviso\" Dr. D. L. Kimbler, Jr. \r\nMaterials Science and Engineering \r\nShugang Lai Gansu Province, China \r\nB.S., M.E., Tsinghua University \r\nDissertation' Multi-length Scale Analysis of Chemical Vapor Deposition (CVD) of Diamond and Titanium Nitride Films \r\nAdvisor: Dr. M. Grujicic \r\nSancosh Sivasankaran Menon Bombay, India \r\nB.T., Indian Institute of Technology-Bombay; M.S., Clemson University \r\nDissenation: An lncegrated Numerical·Experimencal Approach to the Synthesis of High Modulus Tic Reinforced Ti Mecal \r\nMatrix Composites \r\nAdviso\" Dr. H. ). Rack \r\nJianping Zhang,_~--------------------------------- Clemson, SC \r\nB.S., M.S., Wuhan Institute of Technology \r\nDissercacion: Preparatius Process and Characterizations of BaTi0 1 Dielectric Thin{rhick Films \r\nAdviso\" Dr. B. I. Lee \r\nMathematical Sciences \r\nSteven Paul Clark ~--------------------------------Valdosta, GA \r\nB.A., Valdosta State University; M.A., University of Georgia \r\nDissertation: Stochastic Control of a Research and Development Project \r\nAdviso\" Dr. P. C. Kiessler \r\nPaul Triantafilos Hadavas Clemson, SC \r\nB.S., Carnegie·Mellon University; M.S., Clemson University \r\nDissertation: Exploiting Network Substructures and Persistency in Solving 0· l and General Nonconvex Opcimization Problems \r\nAdviso<' Dr. W. P. Adams \r\nLinda Graynel Lawson ________________________________ Cuthbert, GA \r\nB.S., M.S., University of Georgia \r\nDissertation: Multigrid Dynamic Programming \r\nAdviso\" Dr. J. K. Peterson \r\nMechanical Engineering Yugang Li ___________________________________ Shenyang, China \r\nB.E., M.Engr., Tianjin University \r\nDis.sertation: Study on Distributed System Vibration Isolation \r\nAdviso<' Dr. C. D. Rahn \r\nYonghong Yan ___________________________________ Hubei, China \r\nB.E., M.E., Tsinghua University \r\nDissertation: Numerical Study of Capillary Pumped Two· Phase Systems \r\nAdviso<' Dr. J.M. Ochterbeck \r\nPhysics \r\nJoel Dean Burcham ---------------------------------Houston, TX B.S., Wofford College; M.S., Clemson University \r\nDissertation: Analysis of Equatorial Spread Fusing a Coherent Scatter Radar \r\nAdviso<' Dr. D. L. Hysell \r\nNing Luo ---~-------------------------------Shenyang, China \r\nB.S., Lianoning University; M.S., Clemson University \r\nDissertation: Ga lactic Abundance Evolution of Isotopes and Applications to Cosmochemical Samples \r\nAdviso<' Dr. B. S. Meyer \r\nMark William Savage --~-----------------------------Muscatine, IA B.S., University of Iowa; M.S., Clemson University \r\nDissertation: Neutron and Proton Single Event Upsecs as a Function of Bias \r\nAdviso\" Dr. P. J. McNulty \r\nJulie Lorraine Talbot ~--------------------------------Monaca, PA B.S., Allegheny College; M.S., Clemson University \r\nDissertation: A Calcu lation of the Magnetic Moment of a Charged Vector Meson Using Proper Normalization \r\nAdviso<' Dr. P. B. Burt \r\nGeorge Grant Williams Boonville, NY \r\nB.S., University of Buffalo·State University of New York; M.S., C lemson University \r\nDissertation: Early· Time Observations of Gamma· Ray Burst Error Boxes With the Livermore Optical Transient Imaging System \r\nAdvisor: Dr. D. H. Hartmann "
    },
    {
        "page_number": "14",
        "text": "Textiles, Fiber, and Polymer Science \r\nStephen Scott Hardaker-------------------------------- Dalton, GA \r\nB.Ch.E., M.S., Georgia Institute of Technology \r\nDissertation: Po lyaniline Structure: The Key to Processing and Properties \r\nAdvisor: Dr. R. V. Gregory \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF EDUCATION \r\nVocational and Technical Education \r\nSarah Schaible Cramer Pendleton, SC \r\nB.A., Furman University; M.ln.Ed., Clemson University \r\nDissertation: Attitudes, Perceptions and the Effectiveness of Computer-Med iated Distance Training for C ustomer Service \r\nRepresentatives in the Printing Industry \r\nAdvisor: Dr. J.M. Leininger \r\nGerald W. Pumphrey Raleigh, NC \r\nB.A., Florida Scace Un iversity; M.A., Appalach ian Scace University \r\nDissertation: The Relationship of Cooperative Education to Academic and Employment Outcomes for Graduates of Community \r\nCollege Technical Curricula \r\nAdv isor: Dr. G. G. Lovedahl \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction \r\nBarbara Owens Goggans ,..,.----.,-..,.,,-,.-,-,------,...,-,--,------------------Pawleys Island, SC \r\nB.A., M.A., Clemson University; M.Ed., University of Alaska \r\nDissertation: Crossing Boundaries: The English Teacher's Role in Curriculum Integration \r\nAdvisor: Dr. B. E. Naff \r\nEducational Leadership \r\nMelinda Ray Castleberry _______________________________ Cumming, GA \r\nB.S., M.Ed., Brenau College; Ed.S., University of Georgia \r\nDissertation: Georgia Lottery for Education House Bill 1541: Garbage Can Decision Making \r\nAdvisor: Dr. R. A. Marion \r\nBeverly Rice McAdams Anderson, SC \r\nB.A., Erskine College; M.Ed., Clemson University \r\nDissertation: Transfer Community College Students: A Compar ison of Student Characteristics, Program of Study and Retention ac a \r\nSouch Carolina Institution \r\nAdvisor: Dr. R. L. Blackboum \r\nCharlotte Cynth ia McLeod Darlington, SC \r\nB.S., M.Ed., Clemson University \r\nDissertation: The Principal's Impact on Student Achievement Through Culture-Enhanced Leadership Behaviors \r\nAdvisor: Dr. R. A. Marion \r\nRory James McTigue Seneca, SC \r\nB.S., Frostburg State University; M.Ed., Salisbury Scace University \r\nDissertation: Evaluation Criteria for School Principals and Those Used by the Seate of South Carolina and Districts Prior co the \r\n1999-2000 School Year Based on Perceptions ofK-8 Public School Principals \r\nAdvisor: Dr. J. L. Flannigan \r\nJan W. Otter Demorest, GA \r\nB.S., M.Ed., North Georgia College and State Un iversity; Ed.S., University of Georgia \r\nDissertation: Garbage Can Decision Making and The Georgia Teenage and Adult Driver Responsibility Act (House Bill 681) \r\nAdvisor: Dr. R. A. Marion \r\nParks, Recreation, and Tourism Management \r\nRobert Wilson Dye Brevard, NC \r\nB.S., Western Carolina University \r\nDissertation: Differentiating Between Private and Commerc ial Recreational Boaters on the Chaccooga Wild and Sce nic River: A \r\nDiscriminant Analysis \r\nAdvisor: Dr. G. W. Burnett \r\nJennifer Lyn Hinton ________________________________ Streetsboro, OH \r\nB.S., Kent State University; M.S., Indiana University \r\nDissertation: Perceptions of Recreational Therapy as Viewed by Other Allied Health Professionals \r\nAdvisor: Dr. F. A. McGuire "
    },
    {
        "page_number": "15",
        "text": "CANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nMark Andrew Shirley _______ Commerce, GA \r\nMASTER OF FOREST RESOURCES \r\nDarrel Lloyd Smith North Augusta, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nYu Bai ______________ Beijing, China Kwame Owusu,Edusei _________ Accra, Ghana \r\nAnimal and Food Industries \r\nJames Richard Breland ________ Holly Hill, SC Melissa Anne Finkle-------- Spartanburg, SC \r\nAnimal Physiology \r\nJennifer Eileen Graves Middletown, NJ \r\nAquaculture, Fisheries, and Wildlife Biology \r\nWilliam Scott Poore ________ West Un ion, SC Winthrop Ely Taylor _________ Charleston, SC \r\nBiochemistry \r\nDiana Marie Rugh _______ Falls Church, VA \r\nBotany \r\nAlan Felder Cunningham _______ Atlanta, GA \r\nCrop and Soil Environmental Science \r\nTeddy Luc Lalande Saint·Nazaire, France \r\nEntomology \r\nKevin Todd Hathome __________ ,Sumter, SC Pegues Houston Joost __________ Dallas, TX \r\nEnvironmental Toxicology \r\nGretchen Kristine Bielmyer ____ Ponce Vedra Beach, FL Adrienne Dannette Jenkins _______ Columbia, SC \r\nJana Ellis Burton Donalds, SC Stacy Louise Muller Hampton, VA \r\nForest Resources \r\nJonathan Spencer McCall ____ ___ Greenville, SC Gregory Paul Smith _________ Canonsburg, PA \r\nGenetics \r\nManjiri Rajesh Paradkar -------- Bombay, India Francisco Romero· Pastrana _______ Puebla, Mexico \r\nHorticulture \r\nBrian Todd Bunnell ________ Lexington, KY \r\nMicrobiology \r\nJarrod Christopher Wallin ______ Livingston, TN \r\nNutrition \r\nRobert Leon Moody, Jr, _______ Simpsonville, SC Jason Michael Vaughan ________ Awendaw, SC \r\nPackaging Science \r\nSara Elizabeth Markovich _______ Paw Paw, MI \r\nPlant Pathology \r\nJianfeng Li ---------- Qingdas, China \r\nZoology \r\nFelic ia Joan Sanders __________ Tucker, GA Stacey Owen West ________ Newcon Grove, NC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nMASTER OF ARCHITECTURE \r\nJoshua Charles Allison _______ Binghamton, NY Timothy Michael Dotson ________ Medina, OH \r\nKevin Joseph Aimers Florence, SC Matthew Macauley Harris T ulluhoma, TN \r\nKatheryn S. Blake Athens, GA Stacy Lynn Iliff Franklin, TN \r\nDennis Lloyd Blaschke, Jr, Charleston, SC \r\nPernille Hoy Christensen Alpharetta, GA \r\nKeith Alan Jacobs II Spartanburg, SC \r\nAaron Michael Jeffers West Columbia, SC \r\nBrian Jeffery Couch Fruit Cove, FL N icholas Panagiotis Katsibas Seneca, SC \r\nJennifer Leigh Crook North Augusta, SC Kimberly Ann Kraft Rochester, NY "
    },
    {
        "page_number": "16",
        "text": "MASTER OF ARCHITECTURE (continued) \r\nRobert Martin Moehring ________ Andeiron, SC Noah Michael Tolson ________ Oc.ean View, NJ \r\nSarah Allison Randle Greenville, SC William Kenyatta Turner Winston-Salem, NC \r\nThomas John Reidy Bayville, NJ Patrick Scott Ulrich New York, NY \r\nJuergen Michael Schmidt West Palm Beach, FL Maxie Lee Welsh Darlington, SC \r\nThomas Cullen Sweeney Chicago, IL Clifford William Whittingstall Killeen, TX \r\nJohnny Tat-Fai Tam Spartanburg, SC Bradford Kevin Wright Sumter, SC \r\nSoichiro Toba Hyogo, Japan Chenyue Yuan Beijing, China \r\nMASTER OF CITY AND REGIONAL PLANNING \r\nDennis Lloyd Blaschke, Jr. -------Charleston, SC Monty Hugh Lowe __________ Poplarville, MS \r\nAlison Leigh Cheesman Haddonfield, NJ Frederick Charles McLeod Beaufort, SC \r\nPernille Hoy Christensen Alpharetta, GA Andrea Nicole Pietras Millersville, MD \r\nJoshua Glenn Cook Paradise Valley, AZ Suzanne Michelle Sears Covingcon, KY \r\nMichael Cullen Quebec, Canada Emily Jo Terrell Fort Myers, FL \r\nJames Kevin Griffin St Matthews, SC Jennifer Marie Turner Lyman, SC \r\nNicole L. Hill Fishers, IN Julie Marie Williams Canton, MO \r\nHeather Janene Kump Hanover, PA Tracy Murray Youngblood Houston, TX \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nMehmet Kemal Bakircioglu, _______ lstanbul, Turkey Sutee Limpanachaipornkul -----Bangkok, Thailand \r\nMolly Irene Donaldson Greenville, SC Steven Pereira Denham Springs, LA \r\nRyan Dale Galyean Clemson, SC Walter Edgerton Riggan Ill Camden, SC \r\nMASTER OF FINE ARTS \r\nZachary Martin Howard Boozer _______ Greer, SC Jean~Paul Roy Tousignant _______ Ontario, Canada \r\nMASTER OF ARTS \r\nEnglish \r\nHeather Marie de Maynadier ------- Houston, TX Donnie Lee McMahand _______ Simpsonville, SC \r\nArthur Burtis Lawrence Old Forge, NY \r\nHistory \r\nZachery Rayshern Williams. _____ Greenwood, SC \r\nProfessional Communication \r\nSharif Mourad Ewees _________ Richmond, VA Christopher Lee Lohr -------- Wheeling, WV \r\nJoseph Duane Hooper Greenville, SC William Scott Speights Clemson, SC \r\nRyan James Keith Huntsville, AL Laura Louise Stanton Clover, SC \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nMASTER OF BUSINESS ADMINISTRATION \r\nDavid Edward Ashley -------- Spartanburg, SC Michael R. Langer _________ Klamath Falls, OR \r\nChris Alexander Barnes Isle Of Palms, SC David Curtis Leete Oak Ridge, TN \r\nPaul Douglas Bell Easley, SC Kristen G. Magee Simpsonville, SC \r\nTammy Michelle Burton Springfield, VA Sherry Rasnake Monk Richlands, VA \r\nIan Michael Cappitelli Herndon, VA Pau l Michael Mosley Cincinnati, OH \r\nBrenton Hayes Clark Dalton, GA Katherine Jo Norton Easley, SC \r\nTracie Denise Cummings Lake View, SC Kevin Michael Peterson Marietta, GA \r\nPhillip Eugene Davis Greenville, SC Harry G. Plagianis Athens, Greece \r\nMarco Anconio OeMaria Greenville, SC David Keith Propes Cary, NC \r\nCourtney Ann Fahey Taylors, SC Moreno Roncaco Treviso, lcaly \r\nMarvin Stanford Greer Greenville, SC Gale S. Samborne Lavale, MD \r\nKami Michelle Herin Greenwood, SC Timothy George Sparrow Pittsburgh, PA \r\nShannon Michele Hicks Myrtle Beach, SC Paul Thomas Travis Simpsonville, SC \r\nWilliam Dent Johnson Greenville, SC Andrea Leigh Waltz Easley, SC \r\nWilliam Alexander Jones Ill Greer, SC Travis Duane Waters Ninety Six, SC \r\nMichael Scott Jordan Charlotte, NC John McBee Zimmerman Greenville, SC \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nRonald Richard Gontarchick _______ Pottsville, PA Crystal Brooke Slaton _________ Townville, SC \r\nElizabeth Carol Haney Clemson, SC John Allen Spitz Waldorf, MD \r\nHilary Lynn Hunt Bellefonte, PA Christopher Shane Walker Simsbury, CT \r\nJeffrey Timothy Hutto Mt Pleasant, SC Samuel Andrew Welchel Greenville, SC \r\nMASTER OF PUBLIC ADMINISTRATION \r\n(Master of Public Administration is jointly administered by \r\nClemson University and the University of South Carolina.) \r\nTerry Allen Alscon __________ Greenville, SC Elizabeth Hope Holmes ________ Greenville, SC \r\nNatalie Denise Cole Cheraw, SC John Matthew Reid Easley, SC "
    },
    {
        "page_number": "17",
        "text": "MASTER OF ARTS \r\nEconomics \r\nPei Huang ____________ Yangzhou, China Orient Queen Vo~-------- Saigon, Vietnam \r\nFaria Iraqi Karachi, Pakistan Michael Brent Watkins Atlanta, GA \r\nMaria de la Esperanza Juri Mendoza, Argencina \r\nMASTER OF SCIENCE \r\nApplied Psychology \r\nMichael Joseph Garrity _________ Madison, NC Marianne Liptak ________ Garfield Heights, OH \r\nJenifer King Greene Fair Play, SC Rebecca Marie Morley Miamisburg, OH \r\nRichard P. Gruczmacher Ill Philadelphia, PA Julie Marie Workman Tallahassee, FL \r\nApplied Sociology \r\nBradley Keith Campbell --------- Aiken, SC Steve Sungchu Lee _________ Springfield, VA \r\nWendy Lynne Crisp Anderson, SC Charles Don Shuttles Pojoaque, NM \r\nBenjamin Thomas Custer Middletown, MD \r\nGraphic Communications \r\nPatti Anne Blessing ___________ Easley, SC Brooke Erin Spooner _________ Dahlonega, GA \r\nRebekah Christian Kizis Worcester, MA \r\nIndustrial Management \r\nAditya Vasant Bhelande -------___,Nagpur, India Zongchen Wan,._ _________ Jinan City, China \r\nSomabali Sinha Calcutta, India Ruoheng Zhang Shanghai, China \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF SCIENCE \r\nBioengineering \r\nDina Marie Basalyga ---------Pittsburgh, PA Marjorie Joan Piskorski ------- Port Jefferson, NY \r\nRoger Allan Eaton Simpsonville, SC Rahul Sanjeeva Rao Bombay, India \r\nGriet Annemarie Gerdes Easley, SC Christopher James Rini Jamescown, NC \r\nDavid Clayton Holloway Jacksonville, FL Frank Richard Schiretz, Jr. Burlington, NC \r\nTrent Aaron Kirk Massillon, OH Glenn Anthony Stiegman Greenville, SC \r\nBrian Michael May Fairview, PA Shalanda Rene Webb Clemson, SC \r\nMichael Jacob Merves Fairfield, OH \r\nCeramic Engineering \r\nKyle Scott Brinkman ___________ Kailua, HI Honggu Jiang ___________ Shanghai, China \r\nPeter James Fernstrom North Augusta, SC Hezeng Li Baoding Hebei, China \r\nMichael Lee Greene Greenville, SC Jason Peter Street Six Mile, SC \r\nChemical Engineering \r\nLinwood Blanton Muire Ill Richmond, VA \r\nChemistry \r\nLiyana Pathirannahalage D.N.K. Abayasinghe ----- John Charles Maloney ________ Simpsonville, SC \r\n_.,,---,----,-------------.,,.-.clemson, SC Wandee Luesaiwong -------Bangkok, Thailand \r\nAnu Sharma Emeryville, CA \r\nCharles Ernest Taylor IV Orangeburg, SC \r\nCivil Engineering \r\nJoshua Brian Bamhill __________ Gaffney, SC Rob Andrew Matthews Ill ____ Hilton Head Island, SC \r\nTroy Anthony Began Rock Hill, SC Brian Kriscofer Pietras Roehling, NJ \r\nJeremy Randall Blair Greenville, SC David Benjamin Poss Augusta, GA \r\nBenjamin Thomas Cathey Candler, NC Melissa Dawn Sherman Myrtle Beach, SC \r\nTimothy Gee Clinkscales Flat Rock, NC Albert Christian Stong Indianapolis, IN \r\nLisa Marie Comprini Greer, SC Angela Rae Weber Valley City, ND \r\nYin· You Li Anhui, China Daniel Forresc Whittington Florence, SC \r\nComputer Engineering \r\nAjit Anand Bhate __________ Clemson, SC David James Nickles __________ Belton, SC \r\nComputer Science \r\nTao Ding _____________ Jiangsu, China Daniel George Mulfinger ________ Greenville, SC \r\nQuan Li HuBei, China Manoj Bhaskaran Nair Durham, NC \r\nVinay C. Mamidi Clemson, SC Krishnan Sridhar Madras, India \r\nVinOO M. Mamcani Clemson, SC Sriram Thirumalai Srinivasan Tamilnadu, India \r\nVishal Manan Clemson, SC Husein Mustan Tambawala Mumbai, India \r\nZhentao Mao Qidong, China Vikram Vamshi Clemson, SC \r\nElectrical Engineering \r\nArchana Ananta ___________ Clemson, SC HyungJoon Kim ___________ Seoul, Korea \r\nTripti D. Bhanti Mumbai, India Venugopal Reddy Nimma Clemson, SC \r\nChandrasekhar Cha llapalli Clemson, SC Leibiao Shi Shanghai, China \r\nJohn Paul Hartranft Anderson, SC AbhijitJ. Singh Clemson, SC \r\nNathan Dallas Jerpe Stevensville, MD Kuldeep Singh Clemson, SC "
    },
    {
        "page_number": "18",
        "text": "Electrical Engineering (continued) \r\nVenkatadri P. Sreenivasan _______ Clemson, SC Haibo Wang ____________ Beijing, China \r\nMatthew Allen Steel Greenville, SC Yingzi Wu Jiangxi, China \r\nPrem Aanand Venkatesan Coimbatore, India John Calvin Young Guntersville, AL \r\nEngineering Mechanics \r\nChristopher Wade Ackerman _______ Andrews, SC Maria-Magdalena Capitaneanu _______ Seneca, SC \r\nEnvironmental Engineering and Science \r\nRaymond Michael Danker ________ Aiken, SC Delphine Micolet ___________ Seneca, SC \r\nJamelle H. Ellis Mauldin, SC Jacob Lloyd Porter Spartanburg, SC \r\nC laudia Kneller Gunsch Easley, SC Jennifer Ann Steele Powdersville, SC \r\nWilliam Whitfield King, Jr. Charleston, SC Tam M. Tran North Augusta, SC \r\nPhilip Lee McGinnis Millersville, MD \r\nHydrogeology \r\nChristopher Krambis, Jr.------ Lanoka Harbor, NJ Heather Paige Schwen inger _______ Pittsburgh, PA \r\nCrystal Ann Mattox Fort Mill, SC Carrie L. Williams C lemson, SC \r\nIndustrial Engineering \r\nTillman Jesse Abell Ill _________ Cordova, SC Kuldeep Prakash Kelkar _________ Clemson, SC \r\nArindam Bhowmick C lemson, SC Ashish M. Khot Bombay, India \r\nJamie Leigh Bingham Tega Cay, SC Vinayak S. Singh Bombay, India \r\nMichelle Elaine Holliday Easley, SC Abhinandan Som Hyderabad, India \r\nMaterials Science and Engineering \r\nDale Maxwell Hobson ______ Melbourne, Australia Harshawardhan Vinayak Pol ________ Pune, India \r\nKrishna Kumar Kharia Jamshedpur, India Alexandre J. Roussel Nancy, France \r\nMathematical Sciences \r\nDonald Ornedo Adongo _______ Orangeburg, SC Andrea Laura McMakin Greenville, SC \r\nSteven Patrick Dooley Hurst, TX Teneal Glee Messer Asheville, NC \r\nJonathan David Edds Stoughton, WI Kristin Lynn Miller Huntingtown, MD \r\nMauna Ree Hopkins Leesburg, FL Ryan Charles Nagel McKees Rocks, PA \r\nCassandra Ann Kirby Akron, OH Dustin Michael Reed Fredericksburg, OH \r\nJennifer Marie LaVare Roccerdam, NY Hongwen Sun Guandong, China \r\nJason Keith Martin Georgetown, SC Christopher Crevensten Woodard ____ Spartanburg, SC \r\nMiranda I. Massoud Annandale, VA \r\nMechanical Engineering \r\nBri an Christopher Burton Clover, SC Xin Liu ____________ Shen Yang, China \r\nThomas Herman Dodd West Union, SC Dragos Marinescu C lemson, SC \r\nJason John Fuller Greenv ille, SC Cary Ray Robinson Greer, SC \r\nChristopher Errington Grange r __ Hilton Head Island, SC Matthew Benjamin Rollins Greenville, SC \r\nPoomathresan Krishnakumar Madras, India Sushi I Kumar Singh Jamshedpur, India \r\nKristi Lynne Lewis Seneca, SC Avijit Sinha Noida, India \r\nPhysics Macthew Allen Bartlett. ________ Fort Dodge, IA David Alan Weston, __________ Taylors, SC \r\nTextiles, Fiber, and Polymer Science \r\nKanitta Asvahem _________ Bangkok, Thailand Gregory Robert Wood, _________ Clemson, SC \r\nAndrew Douglas Langston Greenville, SC \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nCharles Mason Gary --------- Be lton, SC \r\nMASTER OF HEAL TH ADMINISTRATION \r\n(Master of Health Administration is jointly administered by \r\nClemson University and the Medica l University of South Carolina.) \r\nKandi Rae Calvert ___________ Laurens, SC Winifred Evette Smith --------- Summic ~ NJ \r\nSusie Belle Cornelius Walhalla, SC Catherine Merritt Va land Greenv ille, SC \r\nShannon Slate Owen Greenville, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nCara Cooper Baker --------- Memphis, TN Robin Dorothea Jackson-------- Anderson, SC \r\nKathy Lynn Biggs Townville, SC Robert Arnold Jeter Greenville, SC \r\nMolly Helen Brenlove Pittsburgh, PA Juanita Temeka Jones Greenville, SC \r\nRandy Lamont C larida Clarkton, NC Patricia Ann Latham Albany, GA \r\nMary Carol Coble Simpsonville, SC Kimberely Simone McFadden Greenville, SC \r\nThomas David DuPree Clemson, SC Michael Minutoli West Hempstead, NY \r\nSarah Elizabeth Engel Marietta, GA Carla Reeves Rathbone Seneca, SC \r\nLa Toya CaSandra Greene Myrtle Beach, SC Nichole Shonta Robinson Chester, SC \r\nSherry Herring Fort Mye rs, FL Jonette Harper Stan ley Charlotte, NC \r\nErin Leigh Hiller Greenville, SC Katie Elizabeth Webb Pend leton, SC "
    },
    {
        "page_number": "19",
        "text": "MASTER OF INDUSTRIAL EDUCATION \r\nMadhura Nataraj ---------Clemson, SC \r\nMASTER OF PARKS, RECREATION, AND TOURISM MANAGEMENT \r\nHeather Suzanne Layton Anderson, SC \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nApril Maria Bailey __________ Newberry, SC Mary Bailey Resa ---------- Anderson, SC \r\nKelly Sue Jenkins Newberry, SC Joel Chester Rogers, Jr. C leveland, GA \r\nDale Alan Johns Gainesville, GA Rod L. Storm Simpsonville, SC \r\nCounseling and Guidance Services \r\nKimberly Ann Anderson _________ Cayce, SC Kevin Lee Jacques _________ Chesterfield, Ml \r\nHollie Yvette Applegarth Mauldin, SC Andrew L. Loftis Taylors, SC \r\nTanika LaShunn Bowens Greenville, SC Joanne Louise McClellan Seneca, SC \r\nAngela Sue Brames St Petersburg, FL Ashley Claire McDonald Columbia, SC \r\nJennifer Marie Carson Westminster, SC Dianne H. McMahan Greenville, SC \r\nPatti P. Caner Cornelia, GA Kristie Patterson Mullinax Anderson, SC \r\nC laudia Searcy Cason McCormick, SC Troy Dean Nunamaker Middletown, OH \r\nTimothy Nathaniel Chaffin Aclanta, GA Susan Delores Reavis Laurens, SC \r\nValerie Mae Chier Binghamton, NY Lauren Lynn Rodefeld Cranbury, NJ \r\nAnn Elizabeth Clinton Marietta, GA Lisa Long Shiflet Clinton, SC \r\nAshley Elisabeth Douglas Greenville, SC Jeffery Yates Sullivan Fountain Inn, SC \r\nAmanda Brooke Duvall Cleveland, GA Kellie Patterson Vaughan Anderson, SC \r\nAdrian Charles Gage Tahlequah, OK Ryan Douglas Visser Clemson, SC \r\nShauna Nicole Galloway-Williams Easley, SC Shenita Lovanka Wilson Macon, GA \r\nBrenda Chambers Giles Anderson, SC Kerry Ann Winseck Jamestown, NY \r\nDina Marie Hair Joanna, SC Eric Armando Wood Wilmington, DE \r\nLa Toya Monique Hill Powder Springs, GA \r\nElementary Education \r\nKimberly Jo Phillis Westminster, SC \r\nReading \r\nT onna Lange Marroni --------- Anderson, SC Adair Clary Pederson __________ Gaffney, SC \r\nSonya Amy McElreath Walhalla, SC Lynn McCoy Thrift Seneca, SC \r\nSecondary Education \r\nSenfronia LaChanda Smith McCormick, SC \r\nSpecial Education \r\nOlivia Marie Acton ___________ Easley, SC Desma Elizabeth Manigault _____ Moncks Comer, SC \r\nKaren Andrea Baker Powdersville, SC Misty Barry McCullough West Columbia, SC \r\nMichelle Denise Bodie Miami, FL Whitney Wyatt Merck Greenville, SC \r\nKristi Nicole Campbell Greenville, SC JoAnne Metts Clemson, SC \r\nBethany Elaine Cole Spartanburg, SC Annemarie Picciola Suffern, NY \r\nTina Mellissa Davidson Easley, SC Rebekah Joy Pixomatis Rogers, MN \r\nJohnna Lauren Duncan Columbia, SC Carolyn Jean Ruggles Seneca, SC \r\nJohn Kippy Edwards Barnwell, SC Mary Amanda Schubert Dillon, SC \r\nJennifer Susan Ellenburg Easley, SC Summer Dee Skidmore Wildwood, FL \r\nHeather Matrice Fucile Randolph, MA Natasha Allen Staples Aynor, SC \r\nConstance Regenia Goodwine Beaufort, SC Kevin Bruce Van Romer Central, SC \r\nJill Lindsey Harper Seneca, SC Audrey Grace Wilkinson Macon, GA \r\nPamela P. King Clemson, SC Angela Lynn Wright Powdersville, SC \r\nJulie Elizabeth Long Johnston, SC \r\nMASTER OF SCIENCE \r\nNursing \r\nHelen Jan S. Allison _________ Asheville, NC James D. McLeod, Jr.--------- Crossett, AR \r\nAngela Boggs Bell Easley, SC Deborah Dobson Moore Greer, SC \r\nLaura Anne Green Greenville, SC Leslie Watkins Norris Franklin, NC \r\nStacy Lynne Hofman Greenville, SC Linda Bridwell Rettew Clemson, SC \r\nCarolyn Jean Kerns Greenville, SC Kelly Jordan Smith Anderson, SC \r\nDouglas Patrick McCormick Greenville, SC \r\nParks, Recreation, and Tourism Management \r\nMark Christopher Jewell _______ Lynchburg, VA Melissa Ann Kaminiecki _________ Howell, Ml "
    },
    {
        "page_number": "20",
        "text": "CANDIDATES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCE \r\nWILLIAM BUSSE WEHRENBERG, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\nBradley Craig Christy _________ Greenville, SC **Mark Grantham Fletcher ------ Campobello, SC \r\n*Megan Jilene Curran Hebron, OH *Charles Todd Lincoln Marion, VA \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nKathryn Wendy Brune-,-________ Jobstown, NJ *John Vincent Pace ________ Bri[[on's Neck, SC \r\nWilliam Haynsworth Bull, Jr. Cameron, SC John Tazwell Patton Woodruff, SC \r\nChristopher Grady Cothran Walhalla, SC Richard Odell Pitts Britton's Neck, SC \r\nBrian John Ellis Columbia, SC Elizabeth Rae Shaw Rockport, TX \r\nGabriel Allen Erwin Sumcer, SC Ervin Harwood Weatherly, Jr. Sumter, SC \r\nJames Mark Gibson Richmond, VA \r\nAgricultural Education \r\nJillian Elizabeth Shupenis Bethlehem, CT \r\nAgricultural Mechanization and Business \r\nWilliam Norris C hapman------- Hartsville, SC Gary Scott Herndon ~-------~- Ruffin, SC \r\nMa[[hew Thomas Clark Florence, SC Corey Scephen McAlhany Branchville, SC \r\nChristopher Michael Heintze Clemson, SC Harry Thaddeus Wimberly Branchville, SC \r\nAnimal and Veterinary Sciences \r\n+***Michele Marie Ba lotti_,-------,,-- Florence, SC Jamey Lee Hunt ___________ Townville, SC \r\n+***Jane[[e Lynn Blackwood Douglasville, GA Daniel Joseph Lusk Beaufort, SC \r\nJessica Catherine Blake Aiken, SC Ma[[hew Lambert Morgan Charleston, SC \r\nScacy Elizabeth Bostian Batesburg, SC Kathy Lynn Murphy Columbia, SC \r\n*Nicole Lee Carmichael Charleston, SC Julian Everts Nixon Sumter, SC \r\n+*Cynthia Nicole Constantine Walterboro, SC *David Michael Owsley Tega Cay, SC \r\nJoseph Vernon Coster Greenville, SC lwa Miranda Pierce Charleston, SC \r\n*Suzanne McArden Cox Summerville, SC Telatha Cornelia Powell Johnsonville, SC \r\nKimberly Susan Dixon Ketshaw, SC ***John Leland Raymond Sandy Run, SC \r\n***Elizabeth Lynn Do=h Catonsville, MD ***Desiree Nicole Seibt Lake Wylie, SC \r\n*Amanda Elaine DuBose Ridge Spring, SC *Mary Ruth Steer Ninety Six, SC \r\nNe iii Ann Forrester Moore, SC Charles Richard Tidd V Simpsonville, SC \r\n*Monica Erin Hatcher Pikeville, KY Harriet Carlin Young Thomson, GA \r\nLesley Jean Hughes Orangeburg, SC Dan iel Paul Yount Sumter, SC \r\nAquaculture, Fisheries, and Wildlife Biology \r\nDavid Matthew Bonam _______ North Augusta, SC Brian Keith Low __________ Worcester, MA \r\nJason William Boswell Clearwater, FL Jonachan Eric McCall Seneca, SC \r\nWilliam Davidson Carlisle Columbia, SC Jeremy Wayne Nichols Whitmire, SC \r\nMichael Wayne Eudy Pelzer, SC Brent Andrew Rockow Hamlin, NY \r\nJason Dwight Goins Columbia, SC David William Rudisail Newry, SC \r\nBrian Wayne Hardin Union, SC Ronald William Smith, Jr. Conway, SC \r\nAlbert Adams Hinson, Jr. Thomaston, GA **Jennie Michelle Temple Batesburg, SC \r\nJody Lafon Hodge Alcolu, SC Kathleen Lang Washburn Paducah, KY \r\nChrissy Ann Jager Lilburn, GA \r\nBiochemistry \r\nNeil Manoj Batavia __________ Columbia, SC +***Gregory Allen Johnson ______ Summerville, SC \r\nAnn Catherine Bruner Chester, VA Laura Suzanne Pascal Simpsonville, SC \r\n+*Shelley Marie Elvington Myrtle Beach, SC ***Heather Elizabeth Phillips Merri[[ Island, FL \r\n***Lori Anne Goodwin Bradenton, FL Jerodney Ramondo Spicer Walterboro, SC \r\n+*Daniel Joseph Halasz Myrtle Beach, SC *Jeffrey Nolasco Valdez Goose Creek, SC \r\n+***Amy Callahan Harrison Simpsonville, SC \r\nBiological Sciences \r\nCassie Jane Adams ___________ Clinton, SC Michelle Lee Ducworth _______ Williamston, SC \r\n*Leigh Allison Belflower Lake City, SC *April Michelle Dunlap Simpsonville, SC \r\nHunter Lee Bowie Edgefield, SC **Reid Evan Dyer Pittsburgh, PA \r\nDavid Jonathan Brooks Spartanburg, SC *Lars-Egil Fallan Oslo, Norway \r\n+***Erika Maria Church Hilton Head Island, SC ***Cara Seay Ferguson Gastonia, NC \r\nRobert Ray Clark Walhalla, SC Jodie Marie Fotia Kihei, HI \r\n**Brian Jackson Cooper Rock Hill, SC John Ralph Gentry JV Moncks Corner, SC \r\nE. Owen Cox, Jr. Mt Pleasant, SC **Chandler Kathleen Gore Columbia, SC \r\nGeorge Robert Dawson IV Florence, SC *William Jason Haigler Cameron, SC \r\nMa[[hew Shane Dixon Prosperity, SC +**Crystal Hope Hammond Woodscock, GA \r\nRegina Maria Dorsel Florence, SC Mary Hayden Harbin Hartsville, SC "
    },
    {
        "page_number": "21",
        "text": "Biological Sciences (continued) \r\n+**Neal Jay Isaacs _________ Birmingham, AL Matthew Michael Nelson _______ Mt Pleasant, SC \r\n**Mason William King Kingsburg, SC *Nicholas Hershey Noblet Clemson, SC \r\nStephanie Marian Lewis Reevesville, SC *Jason Benjamin O'Dell Florence, SC \r\nTanya Renee Loftis Anderson, SC Elizabeth Anne Pirkle Aiken, SC \r\nAndrew Edward Logan Greenwood, SC *Andrew Robert Smith Wexford, PA \r\n***Philip Kenneth Lowe Spartanburg, SC Chad Morgan Smith North Charleston, SC \r\nJennifer Marie Martin Port St John, FL Kayce Scott Strickland Columbia, SC \r\n••Charles Elliott Maxwell Johnsonville, SC Jessica Mary Sykes Isle Of Palms, SC \r\nBrandon Kenneth McAlister Anderson, SC ***Kevin Robert Thomas Dillon, SC \r\n•••Mary Elizabeth McGowan Spartanburg, SC Lowell Cooper Tyler Ridgeland, SC \r\nCrop and Soil Environmental Science \r\nWalter Curtis McBride _______ North Augusta, SC Katina Reaves ____________ Mullins, SC \r\nFood Science \r\n*Phoebe Carol Alexander ______ West Chester, OH *Christopher Andrew llcheson ______ ~Akron, OH \r\nEmily Anne Bagwell Fort Mill, SC ***Alison Paige Millard Baldwin, MD \r\nBenjamin Leldon Bradshaw Saluda, SC +*Brooke Lee Monroe Columbia, SC \r\nArny Noel Christensen West Chester, PA Tenise Nicole Stackhouse Nichols, SC \r\nAllison Rae Gambrell Honea Path, SC **Brittonni Wongrey Thome Sumter, SC \r\nJill Amanda Gambrell Anderson, SC \r\nForest Resource Management \r\nJoseph Brandon Ard __________ Cheraw, SC Michael B. Mills. ___________ Newberry, SC \r\nJason Christopher Banks Columbia, SC Frederick McCoy Myers, Jr. Rembert, SC \r\nWalter Barrett Baxter Ridgeland, SC Leilani Jessica Nicholaou Ridgeville, SC \r\nRussell Brian Brazell Lugoff, SC Barry Keith Page Greenville, SC \r\nChristopher Patrick Brockenfelt Summerville, SC Marie Diane Pfeiffer Mobile, AL \r\nRoy Matthew Clinton McConnells, SC Jeremy William Pike Sterling, VA \r\nJames Key Collins Sullivan's Island, SC Elisa Ann Pou Lexington, SC \r\nScotty Shane Corner Hickory Grove, SC Kenneth Daniel Pritchard Piedmont, SC \r\nDerrick Oneal Cooper Perry, SC **Hughes Schoolfield Simpson Mullins, SC \r\nJohn Miley Davis John's Island, SC Richard Ian Smith Swansea, SC \r\n*Robert Britt Derrick Lexington, SC Catherine Allison Smoak Aiken, SC \r\nWilliam Shields Emerson Easley, SC Herbert Daniel Sosbee Ill Hopkins, SC \r\nJames Rone Felts IV Myrtle Beach, SC Brian Jay Sprouse Greenwood, SC \r\nDaniel Ryan Flood Appling, GA Eric Bronson Summers North Myrtle Beach, SC \r\nTerence Efrem Freeman North Charleston, SC Ronald James Towery York, SC \r\nThomas English Furse Manning, SC Mark Williams Ullman, Jr. Columbia, SC \r\nValentijn Hoff Long Creek, SC William Brian Urquhart Florence, SC \r\nJames Saye Hollis, Jr. Chester, SC Joshua Lockwood Utsey Beaufort, SC \r\nAlan Hampton Hubbard Darlington, SC Christopher Franklin Wilkes Greenville, SC \r\nBenjamin Neal Kroeger Enfield, ME Blair Neal Williams Hollywood, SC \r\nDarren J. Liane Seneca, SC Ryan Curtis Wood Myrtle Beach, SC \r\nMichael Sean McBride Summerville, SC Leslie Marie Zorn Blackville, SC \r\nJames Micheal McLain Conway, SC \r\nHorticulture \r\nJason Douglas Bailey _________ Greenville, SC Kristian William Granger--------- Afton, NY \r\nGeorge William Bell Ill Clinton, SC Stefan Robert Gustafson Sand Lake, NY \r\nRickey W. Clark Liberty, SC Patrick Allen Hardin Anderson, SC \r\n*Betsy Howard Corn Anderson, SC **Veronda Beth Holcombe Salem, SC \r\nErin Glenn Courtney Summerville, SC Joshua Daniel Murdock Honea Path, SC \r\nRobert Anthony Daniel 111 Charleston, SC Brian Matthew Smith Inman, SC \r\nAlan Gaines Estes Ware Shoals, SC Christina Gayle Smith Sumter, SC \r\nBenjamin Lieber Fischer Clemson, SC Sara Elizabeth Stuerke Columbia, SC \r\nEdward Scott Gibson Walhalla, SC \r\nMicrobiology \r\n+*Eugene Yujin Ahn ________ Westminster, SC +*Melissa Amber Johns ------- Hinesville, GA \r\n*Cheryl Lynn Boyd Aiken, SC Sean Richard Lyons Acworth, GA \r\nApril Camille Braddy Miami, FL +***Jeffrey Daniel Poole Gaffney, SC \r\nJennifer Joyce Currie Swansea, SC +***Robert Glen Quattlebaum Stroudsburg, PA \r\nKevin Tobias Dillard Central, SC Ethylene Fabre Quebral Stockton, CA \r\nMelissa Eileen Draley Kensington, MD Rupalika Singh Clemson, SC \r\nJodie Marie Fotia Kihei, HI Roberta Lee Taylor Belton, SC \r\n*Anna Lisa Goodman Greenville, SC Shawnna Marcrish Thompson Latta, SC \r\nRobert Christopher Holder Simpsonville, SC +*Charlotte Rachel Toole Greenville, SC \r\nJon Rodriguez lnquimboy Goose Creek, SC ***Virginia Abigail Young Pelzer, SC \r\nPackaging Science \r\nSean Michael Connolly ________ Rock Hill, SC Jared Douglas March __________ Seneca, SC \r\nNathan Bigger Franklin Clover, SC Jeffrey J. McNeice Greenville, SC \r\nDarrin Christopher Lucas Bishopville, SC James William Sloan 11 Edgefield, SC \r\nMatthew Daniel Mahon Voorhees, NJ "
    },
    {
        "page_number": "22",
        "text": "Pre .. professional Studies \r\nJoni Celeste Kinsey ___________ Fairfax, SC Julie Anne Siman ----------Columbia, SC \r\n**Sara Elizabeth Martin Greenville, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nRONALD WESSON MORAN, Interim Dean \r\nBACHELOR OF FINE ARTS \r\nAnn Elizabeth Buckwalter ________ Ringoes, NJ Jennifer Michelle Stemen _________ Greer, SC \r\nVirginia Kyle Hendrix Spartanburg, SC **Kevin Micah Vassey Spartanburg, SC \r\nBriana Denise McCammond Greenville, SC Boisha Lynn Washington Spartanburg, SC \r\n*Deanna Maree Sink Charleston, SC \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\n*Thomas Horace Bennect _______ Greenwood, SC Natasha Bridges Larson Easley, SC \r\n**Elliot Wingard Buff Lexington, SC *Albert Barnwell Lynn, Jr. Darlington, SC \r\n*Joel Raymond DelliCarpini Mohrsville, PA Charlotte Christina Andraus Reeves ____ Greenville, SC \r\nKelly Ann Dralle Beaufort, SC **Bryan Ray Shumpert Anderson, SC \r\nShane Patrick Finn Fort Mill, SC +**Jamie Chambers Sittig Hamilton, VA \r\nMark Carl Griffin Travelers Rest, SC \r\nBACHELOR OF ARTS \r\nDesign \r\nKristine Rene Bishop ________ Woodbridge, VA *Brie Kathryn Peters _________ Lenoir City, TN \r\n**Todd Gentry Howard Greenville, SC Jessica Lockwood Wall West Hartford, CT \r\nBradley Adam Paul Aiken, SC \r\nEnglish \r\n*Elizabeth Anne Ahem _________ Toledo, OH John Neumann Kamrath _______ Annapolis, MD \r\nNatalia Loraine Barker Walhalla, SC Meghan Elizabeth Limbrick Amherst, VA \r\nMark Steven Champion Tampa, FL *Brandon Dale Loper Ruffin, SC \r\nAngela Nishawna Davis Branchville, SC Mary Margaret Luchini Fairfax, VA \r\n+***Shawn Boyd Deery Goose Creek, SC *Shannon Marie Magee Corning, NY \r\n+*Andrea Marie DeGaetani Richmond, VA Melissa Ann Myers Mt Pleasant, SC \r\nAmanda Hope Elliott Camden, SC Christopher Brandon Nixon Dansville, NY \r\n**Jeremiah Christian Ellison Greenville, SC Jeremy Cole Patton Simpsonville, SC \r\nVictoria Michelle Foster Greer, SC Morgan Mills Phillipps Charleston, SC \r\nCarey Elizabeth Fraser Lawrenceville, GA Helen Barkley Ravenel Charleston, SC \r\nKristy Renea Gibbs Townville, SC +**Jill Elizabeth Rhodes Columbia, SC \r\n***Allison Marie Gore Anderson, SC David James Rouse Columbia, SC \r\nHeidi L. Graney Quincy, MA Karen Annette Spain Greenville, SC \r\nlzla Felita Heam Hollywood, SC Mary Frances Stenhouse Greenville, SC \r\n+*Mary Kate Hudson Salem, VA Amanda Lou-Ann Stewart Orlando, FL \r\nWilliam Ashby Hudson IV Midlothian, VA Brooklyn Amanda Walker Hodges, SC \r\nKatrina Antionette Jackson Charleston, SC Patrick Earl Watson II Irmo, SC \r\nCharles Andrew Jones Knoxville, TN \r\nHistory \r\nAshley Greason Andrews _______ Pendleton, SC Mark Whitney Labouchere ____ Hilton Head Island, SC \r\nSarah Anne Badgley Charleston, SC Laquetta Shive Pearson Greenville, SC \r\nSamuel Ready Bradford III Charleston, SC Stephen Timothy Persia Rochester, NY \r\n*Leroy Wilson Brasington Ill Greenville, SC LaShaun Yvette Roberson Charleston, SC \r\nAlison Jane Burpee Boise, ID +**Katherine Marie Roenker Cincinnati, OH \r\nMeredith Eileen Busching Lawrenceville, GA **Matthew David Thomas Jonesville, SC \r\nSean William Coleman Winston-Salem, NC *James Ashley Twombley Dillon, SC \r\nEdwin Dudley Corning III Sumter, SC *Melissa Anne Vaughan Buffalo, SC \r\n+***Miranda Leigh Gatlin Greenville, SC \r\nLanguage and International Trade \r\nCarole Michelle Bourbeau, _______ Greenwood, SC Edith Krukowska _________ West Caldwell, NJ \r\n*Christine Marie Buchinski Branchburg, NJ Kevin Anthony McCarthy Portsmouth, RI \r\n**Michael Robert Cashin Naugatuck, CT Phillip Thomas Mincheff Hartsville, SC \r\nEmma Lacy Chameuff Roswell, GA *Rina Ramesh Patel Atlanta, GA \r\nAlyson Marie Dumont Alpharetta, GA Alex Javier Ramos Spartanburg, SC \r\nJennifer Louise Elderman Lewisburg, PA +**Melissa Anne Register Cincinnati, OH \r\n*Robyn Elizabeth Floyd Woodbine, MD Gretchen Aynsley Rogers Elmira, NY \r\n+*Rachael Ann Gum Delmar, DE Carolyn Amanda Schultz Columbia, MD \r\nThomas Edward Hart, Jr. Boston, MA Andrew Michael Soller Sterling Heights, Ml \r\nCecilia Maria Hincapie Clemson, SC **Kateri Rebecca Stein Ann Arbor, MI \r\n*Bernell Leazan King Greenville, SC Meghann Delahunty Wheeler Aiken, SC \r\nModern Languages \r\nAnthony Shaun Catone ________ Lancaster, SC Jeffrey Feliciano Terry __________ Tampa, FL \r\nPhilosophy \r\nGrayson Lee Cash --------- Campobello, SC Andrew Henry Woolum _________ Chapin, SC "
    },
    {
        "page_number": "23",
        "text": "Speech and Communication Studies \r\nJonathan Marion Beaufort ______ North Augusta, SC Anna Lacy Littlejohn ~-------~--Iva, SC \r\n*Amy Cathryn Bohling Munster, IN Marta Michele McGough Greenville, SC \r\nDana Elaine Bradley Bishopville, SC **Sara Domenica Martinelli Trumbull, CT \r\nDatishella Donecita Byrd Hickory, NC Alyson A. Moore Medford Lakes, NJ \r\nAngela Louise Clark Seneca, SC Matthew Vaughn Peterson Old Saybrook, CT \r\nErin Page Cochran Greenville, SC Sean Michael Reardon Greer, SC \r\nltoro Asuguo Umoh Coleman Hephzibah, GA William Brian Russ Lexington, SC \r\n*Justin John Copertino New Hyde Park, NY Mary Megan Rutter - Franklin, TN \r\nAngela Renee Cossey Bradford, AR Erin Maureen Ryal Mt Pleasant, SC \r\nJenny Mc Vay Dameron Florence, SC Jennifer Lyn Skinner Columbia, SC \r\nErin Jean Deanhardt Greenwood, SC Elizabeth Jordan Slate High Point, NC \r\nSusan Anne Defrancis Upper Nyack, NY *Christopher Kent Smith Moon Township, PA \r\nMichael S. Fuller Greenville, SC Alexander J. Starkman Seneca, SC \r\nAmanda McChord Gaither Summerville, SC Aly Lynn Susterka Midland, Ml \r\nMeredith Marie Garris Orangeburg, SC *Karlyn Michelle Thompson Leesburg, FL \r\nDarren Simon Gray Abbeville, SC Kelly LeAnne Tillirson Anderson, SC \r\n•Kristen Marie Grefenscette Aiken, SC ••Sarah Elizabech Troup Winchescer, VA \r\nBrian Donald Grooms Simpsonville, SC Linda Denise Wall Naperville, IL \r\nLeila Michelle Horton Kingstree, SC Janet Elizabeth Ward Mclean, VA \r\n*Kelly Jo Jarrett Myrtle Beach, SC Shekera Shenise Weston Fort Campbell, KY \r\nCatherine Deitrick Johnston Spartanburg, SC \r\nDOUBLE MAJOR \r\nEnglish and Philosophy \r\n**Erin Lindsay Pumam _______ Florence, SC \r\nEnglish and Speech and Communication Studies \r\nKatherine Scott Crawford Greenville, SC \r\nHistory and Political Science \r\nElizabeth Ann Keller Hilton Head Island, SC \r\nSpanish and Speech and Communication Studies \r\nTiffany Louise Mozingo Bishopville, SC \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nAmy Lorraine Ariko __________ Orlando, FL Brian Scott Johnson __________ Fort Mill, SC \r\nRalph David Broome, Jr. Kershaw, SC Ronald William Kennedy, Jr. Pequannock, NJ \r\nChristopher Douglas Carroll Norway, SC Patrick Alan Kirk Columbia, SC \r\n*Kevin Rodney Chalk Greer, SC **Susan Nell McCreary Smiths, AL \r\nJason Randal Childs Laurens, SC Nima Moghadam Charleston, SC \r\nTimothy Borders Clark Fort Mill, SC *Andrew Taylor Pelland Faccia Falls, SC \r\nRichard Curtis Frasier Piedmont, SC Michael Joseph Schamel, Jr. Hector, NY \r\nRyan Joseph Gleaves Greenville, SC Jonathan David Silkworth Ann Arbor, Ml \r\nJared Thomas Gray North Myrtle Beach, SC Robert Shawn Siman Columbia, SC \r\nJason William Hardee Aynor, SC *Jeremy Wayne Watson Liberty, SC \r\nTucker Erskine Harding Seneca, SC James Walker Wolf Buford, GA \r\nRoslyn Devina Henderson Myrtle Beach, SC \r\nDesign \r\nAndrea Lynn Taylor Abend _______ Greenville, SC Jonathan Bradley Hyman ______ Timmonsville, SC \r\n*Christopher Derrell Altman Florence, SC Eric Thomas Jones East Hartford, CT \r\nSara Elizabeth Ashworth Rock Hill, SC Losse Furman Knight 111 Summerville, SC \r\n*Brooke Walters Barr Mt Pleasant, SC Amy Katherine Laffey Unionville, PA \r\nWilliam Glenn Beckham Charleston, SC Brandon Leske Ann Arbor, Ml \r\n***Kimberly Dawn Blalock Durham, NC Carrie Francis Montgomery Newington, CT \r\nJohn Allen Boland IV Atlanta, GA *Shaun Patrick Murphy Burnsville, MN \r\nDerwin Broughton St Stephen, SC Benjamin Andrew Pearce Statesville, NC \r\nKeith Blair Cannon, Jr. Columbia, SC Kelly Melissa Pittman Charlotte, NC \r\nBrigitte Elizabeth Cook Phoenix, MD **Alicia Lorraine Reed Greer, SC \r\nStacy Lynn Cormier Irmo, SC Meridith Ellen Sanford Chardon, OH \r\nJames Henderson DeMint Greenville, SC Fred Henry Shute 11 Lancaster, SC \r\n*Amanda Michele Durant Ravenel, SC *Mary Catherine Smith Conway, SC \r\nMelanie Beth Easter Marietta, GA **Thomas Jackson Smith IV Irmo, SC \r\nCharlene Runiette Edwards Lynchburg, SC Michael Richard Stover Phoenix, MD \r\n*Jennifer Lynn Ehrich Lilburn, GA Grayson Bennett Thompson Laurens, SC \r\n***Laura Ashley Fisher Charleston, SC Jerry Lee Traino Hershey, PA \r\n••Jaime Christopher Henderson Spartanburg, SC Philip Edward Watkins Seffner, FL "
    },
    {
        "page_number": "24",
        "text": "COLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nPeter J. Donnelly-------- Spring Lake, NJ \r\nPolitical Science \r\n*Nada Abdelaal_...,..., ________ Los Angeles, CA Lisa Marie Grzeika ________ ---.,,'King George, VA \r\nChristopher Aaron Aleman Abbeville, SC Valencia Yvonne Jett Timmonsville, SC \r\nAdam C harles Berlew Annapolis, MD Justus Jeremiah Jones Myrtle Beach, SC \r\nBrandy Danielle Berry Florence, SC Jason William Koye Long Valley, NJ \r\nPhilip Anthony Borrelli Goose Creek, SC Michael Earle Lokey Belleair, FL \r\nJessica Lyn Byars Lyman, SC Jennifer Pari Parandian Ellicott City, MD \r\nAnthony Shaun Catone Lancaster, SC *Elizabeth Ruth Phillips Greenwood, SC \r\nMark Stephen Cothran Greenville, SC Melissa Anne Proctor Sevema Park, MD \r\nJohn Andrew Demos Seneca, SC Martha Thaddeus Self Bishopville, SC \r\nJonathan Michael Drury Wilmington, NC Rebecca Ann Sibilia Marco Island, FL \r\nThomas Eugene DuRant Sumter, SC **Lindsay Elizabeth Tapp Greer, SC \r\nPierre G. Elliott Surfside Beach, SC +***William Ryan Teague Mountville, SC \r\nJerod Dequaine Frazier Charleston, SC Jason Hoyt Warson Mauldin, SC \r\nMichael Anthony Gay Florence, SC Nancy Lane Williams Charleston, SC \r\nPsychology \r\nBrett Chadwick Barker -------Murrells Inlet, SC Michael Joseph Hatten Farmington, CT \r\n***Kelly Broadwater T yrone, GA Sara Joann Helms Berlin, MD \r\nBenjamin Karl Brunnschweiler Sheffield, MA Tanya Marie Jelinek Scarborough, ME \r\n***Robert Mason Burdine, Jr. Greenville, SC Chelsea Lynn Jones Mechanicsville, VA \r\nKristin Lynn Carter Irmo, SC Kristen Elizabeth Kanakos Lake Grove, NY \r\nSarah Elliott Collins Columbia, SC Patricia Anne Kvarta Skillman, NJ \r\nEliza Anne Cone Charleston, SC *Michelle Lee Marsinko Seneca, SC \r\nCarin Diane Connelley Orangeburg, SC **Sonia Rashmi Mehta Greer, SC \r\nShannon L. Cordes Bethpage, NY ***Loren Nicole Melfi Whippany, NJ \r\nJennifer Lynn Crenshaw Heath Springs, SC Melissa Ann Moore Westminster, SC \r\n*April Elizabeth Davison Gainesville, FL *Jennifer Ann Mountz Hilton Head Island, SC \r\n**Elizabeth Hope Ellison Charleston, SC Laura Leigh Ouzts Florence, SC \r\n**Angela Rae Engesser McClellanville, SC **Katherine Berry Polk Lexington, KY \r\nJennifer Ann Evans Syracuse, NY Celena Coleece Posey Columbia, SC \r\nAnsley Catherine Foster Jonesboro, GA Kevin Albert Riek Frederick, MD \r\n**Sara Reagan Fowler Mullins, SC **Tara Michelle Sadler Clemson, SC \r\nBritta Allen Garris Dillon, SC **Kathy Lee Metts Sanders Anderson, SC \r\nStephanie Lynn Goar Lakeland, FL +**Katherine Marcella Sanvidge ___ Peachcree City, GA \r\n*Jamie Goverman Framingham, MA Spencer James Space Taylors, SC \r\nMelis Amber Gumustas North Potomac, MD Amy Elizabeth Thompson Greenv ille, SC \r\n*Mahala Robertann Haddock Long Creek, SC ***Ashley Dionne Whitford Greer, SC \r\nKelly Christine Hagen Jacksonville, FL **Carrie Ellen Williams Aiken, SC \r\nJill Bernice Hammer Dover, DE **Kristin Alicia Williams Lyman, SC \r\n**Kimberly Stuart Harmon Anderson, SC \r\nSociology \r\nLa Whan Lakeisha Dawkins ________ Union, SC **Jeremiah Jonathan Jacobs ______ ..,.Pendleton, SC \r\n*Sarah Rebecca Dawson High Wycombe, England *Jacquelynne Ella Kellogg Lenoir City, TN \r\nJulie DeLuccy East Windsor, NJ Elizabeth Ann Kowalchik Glastonbury, CT \r\nLeigh Arrnscrong Erisman Wilmington, DE *Shelley Rene Lovell Mauldin, SC \r\nKristen Elizabeth Faber Sykesville, MD *Lori Celeste Merrill West Columbia, SC \r\nMichael David Freeman Fairfax, VA *Lori Ann Thompson Marion, SC \r\n**Mary Kathleen Goodwin Brevard, NC ***Meg Childress West Easley, SC \r\n**Caroline Elizabeth Irick Woodbridge, VA \r\nDOUBLE MAJOR \r\nEconomics and Political Science \r\nTodd Bradley Ratliff Ormond Beach, FL \r\nEconomics and Psychology \r\n+***Richard Brandon Mancill ______ Lamar, SC \r\nEnglish and Political Science \r\nJames Andrew Tyrell Glen Gardner, NJ \r\nHistory and Political Science \r\n*Herbert Edward Mercer lll Denmark, SC \r\nPolitical Science and Psychology \r\nLaRonda Rhodes Saluda, SC \r\nPoHtical Science and Speech and Communication Studies \r\n*Jeffrey McClain Davis Greensboro, NC "
    },
    {
        "page_number": "25",
        "text": "BACHELOR OF SCIENCE \r\nAccounting \r\n*Amanda Gayle Alewine -------__..,.,...Belton, SC +•••Shana Niko! Ellison ________ Anderson, SC \r\n••Lauren Ashley Allen Columbia, SC +•Frederick William Faircloth IV Rock Hill, SC \r\nKristina Lynn Anderson Columbia, SC Amanda Suzanne Godfrey Norm Augusta, SC \r\nNatasha Renee Anderson Spartanburg, SC Dawn Michelle Gosnell Travelers Rest, SC \r\nJennifer Leigh Babb Orangeburg, SC +•Keith Allen Gray Anderson, SC \r\nKelly Moore Black Columbia, SC Latasha Renae Johnson Trenton, SC \r\nAmy Catherine Bonnette Loris, SC Angela Dana League Piedmont, SC \r\nTamara Michelle Braden Nokesville, VA •Marty Mederos Gaithersburg, MD \r\nGlenn David Budd in, Jr. Anderson, SC Marcie Danyel Moore Bensalem, PA \r\nShearon Vonetta Burgess Lake City, SC Alyson Elaine Roberts Laurens, SC \r\nLee Ann Campbell Fountain Inn, SC *Kara Susan Sexton Gray Court, SC \r\n•Samuel Lear Campbell Columbia, SC Jason Andrew Shulick Richmond, VA \r\nAmy Elizabeth Carson Union, SC *Jennifer Erin Smith Summerville, SC \r\n•Julie Margaret Chesebro Greenville, SC Andrea L. Snarr Montclair, VA \r\nCrescent Camille Dodson Six Mile, SC Michael Joseph Stephens Greenville, SC \r\nJaime Manson Easley Dalton, GA David Jackson Williams Asheboro, NC \r\nEconomics \r\nBrian Alan Barker __________ Greenville, SC ]uscin Aaron Neubauer ________ Centreville, VA \r\nDavid R. Crincoli Union, NJ ***Alicia Eugenia Rigler Kennett Square, PA \r\nTodd Eric Heitman Lexington, KY Charles Christian Schmidt 11 Orlando, FL \r\nRobert Hamilton Holcombe Columbia, SC Wesley Jackson Shull Aiken, SC \r\nDavid Hyman Acton, MA Christopher Leon Sielicki Columbia, SC \r\nAdrienne Christina Kerchner Herndon, VA Anne Victoria Stowell Charlotte, NC \r\n+••Mark Robert Kurt Cascade, IA Brian Patrick Stride Oakland, NJ \r\nMichael Richard Mercier, Jr. Greenwood, SC \r\nFinancial Management \r\n*Mary Elizabeth Avant-------- Anderson, SC Ari Sandor Mutchnik ----- North Miami Beach, FL \r\nRoland Lafayette Boyd 11 Greer, SC *Donna Marie Myers Lancaster, SC \r\n•Tamara Marie Brightwell Avon Lake, OH Jason C. Newman Denville, NJ \r\nJames Atkinson Bruorton IV Simpsonville, SC ••Lauren Lynn Ostrowski Valrico, FL \r\n+•••Heather Diane Burkett Warrenville, SC Chad David Parker Greenville, SC \r\nJessica McCall Cobb Walhalla, SC Casey Alan Peters Pt Pleasant, NJ \r\nMary Katherine Coleman Lake City, SC Joshua Lee Queen Gaffney, SC \r\nBrian Thomas Cooper Berkeley Heights, NJ Jack William Ramos North Augusta, SC \r\nChristine Lynn Daigle Silver Spring, MD Eric M. Reilly Verona, NJ \r\nSeth Michael Diamond West Columbia, SC Herbert Thomas Rhode Paramus, NJ \r\nTimothy William Diberardino Wellsville, NY •Claire Irene Richardson Marietta, GA \r\nAnne Rhodes Dixon Staunton, VA Cameron Leigh Rogers North Augusta, SC \r\nTamika Lawanda Duncan Estill, SC Kathryn Virginia Rukat West Union, SC \r\nJoel Aaron Friedman Gaffney, SC Sarah Frances Rummel Columbia, SC \r\nPhilip Eric Fuller Irmo, SC Jason Scott Sasser North Augusta, SC \r\nSara Elizabeth Grein Longwood, FL Jason C laude Satterwhite Newberry, SC \r\nRobert Hiram Guy Myrtle Beach, SC ***Charles Wallace Seigler, Jr. Rock Hill, SC \r\nJames Melvin Hand Laytonsville, MD Amy Colleen Smith Charleston, SC \r\nBetty Leanne Holcombe Williamston, SC +•••Craig David Story Fallston, MD \r\nHeather Joyce Holland Wellford, SC Kevin James Sugrue Clifton, VA \r\n•••Travis Patrick Howard Mt Pleasant, SC David Mitchell Swanson, Jr. Clemson, SC \r\nAndrew Daniel Hurst Hingham, MA Jeremy S. Taylor Easley, SC \r\n+•Matthew Wayne Hussey Dallas, TX Kristi VeRelle Thompson Greenwood, SC \r\n+**Christopher Donald Kastler San Antonio, TX John Mimnaugh Tobias 111 Columbia, SC \r\nSean J. Keegan Falls Church, VA Amy Welmaker Vaught Pendleton, SC \r\n+*Kimberly Lynn Keelen Columbia, SC David James Watson Greenville, SC \r\nJeffrey Mark Kellett Williamston, SC *Heather McCue West Easley, SC \r\nMeredith Christine Lemin Princeton, NJ •Kerri Beth Williams Anderson, SC \r\nMatthew John Marcheschi Radnor, PA **James Ramage Wyche Greenville, SC \r\nChrista Eleanor Martin McCormick, SC Andrew Jonathan Zabierek Chelmsford, MA \r\nGary Edward McCall Franklin, NC Michele Diane Ziella Flushing, NY \r\nAnthony Maurice Montgomery Lyman, SC **Mark Allen Zirkle Columbia, MD \r\nStephen Edward Murphy Sherborn, MA \r\nGraphic Communications \r\nRyan Conrad Adams ________ Fayetteville, GA Jeffery Scott Marciniak _________ Ringwood, IL \r\nTina Michelle Anderson Marietta, GA **Erin Marie McRedmond Columbia, SC \r\nBruce Eric Brown Inman, SC Mary Caroline Medlin Bamberg, SC \r\nMary Alyson Burroughs Conway, SC Latarsha Marie Nelson Ladson, SC \r\nJason Storey Caughman Columbia, SC *Juliana Thies Pereira Sao Paulo, Brazil \r\n•••Shawn D. Claypool Williamston, SC Henry Pauling Roberts IV Columbia, SC \r\nAshley Sue Cowden Fair Play, SC Jamie Leigh Straughn Charleston, SC \r\nEmi ly Ryan Dillard Greenv ille, SC Howard William Testerman ill Columbia, SC \r\nMarisha Lavene Elmore Bowman, SC Elsa Kristine von Harcen Marlboro, NJ \r\nJessica Carolyn Harkins Pawleys Island, SC +•Kelly Lynn Wetherington Mableton, GA \r\nMelissa Dawn Kelley Greenwood, SC Melissa Wilson Greenville, SC "
    },
    {
        "page_number": "26",
        "text": "Industrial Management \r\nAndrew Pickens Collins II --------Chapin, SC Christopher Ryland Garrison------~ Easley, SC \r\nCornelius Jere! Cunningham Laurens, SC Arthur Ryan Nichols Laurens, SC \r\nMichael Charles Eggers Buffalo, NY Jeanie Diana Prince Loris, SC \r\nArthur William Gambill North Charleston, SC Cheryl Nicole Robertson Cheshire, CT \r\nManagement \r\nIan Paolo Arellano._~ ________ Rochescer, NY Patrick Scocc Johns _________ Jacksonville, FL \r\nHeacher Michelle Bailey Waldorf, MD **Robert Cuccino Jones Sumcer, SC \r\nJohn Patrick Bengier Apopka, FL *Brian Douglas Knox Simpsonville, SC \r\nMichael Linwood Blanding, Jr. Sumcer, SC Valencia Licclejohn Simpsonville, SC \r\nTomasz Boniecki Paramus, NJ Brian Patrick McCall Kingsporc, TN \r\nAriail Gayle Burnside Hopkins, SC James Ryan McGann Irmo, SC \r\nKennech Nelson Burcon, Jr. Silver Spring, MD Michael John Money Fleccher, NC \r\nJoseph James Byrne Ill Belmar, NJ Corey Leslie Morrell Clemson, SC \r\nChristopher Will Cheek Wescminscer, SC James Curtis Neidert Easton, MD \r\nJames Bryan Cooke Charleston, SC Lauren Elizabech Oglecree Cayce, SC \r\nChristopher Michael Coughlan Marblehead, MA Chalyn David Perez Braichwaice, LA \r\nJohn Green Creech, Jr. Greenville, SC Elisa Anne Petit Treasure Island, FL \r\nJohn D. Crunkleton Toccoa, GA Joseph Scewarc Rhodes 111 Central, SC \r\nGregory Carlton Dantzler Harleyville, SC Ian David Robinson Columbia, SC \r\nEric Park Eibel, Jr. Marietta, GA Cory Andrew Rodgers Waynesboro, VA \r\nKennech LaMane Franklin Sumcer, SC Andrew William Salapka Aclanca, GA \r\nLuis Fernando Garcia Mexico City, Mexico Michael Brandon Scalise Murrells Inlet, SC \r\nGeorge Louis Garmendia, Jr. Mc Pleasant, SC Sabrina Kaye Schaller Chapel Hill, NC \r\nShelley Alaine Gaskins Kershaw, SC Melissa Suzanne Shumway Charleston, SC \r\nGary Sceven Grant Seneca, SC Curtis Rush Sponseller Columbia, SC \r\nJames Rollin Harley, Jr. Sumcer, SC Tabicha Lee Thompson Hartsville, SC \r\n**Roy Guy Haupfear Ill Clinton, SC Jeffrey Joseph Tofauce Charleston, SC \r\nJulie Nan Heccinger Greenville, SC Emily Sarah Waddell Greer, SC \r\nCarla Lynn Holzer Anderson, SC Nelson Harrison Woods 11 Barnwell, SC \r\nAmy Louise Jenkins Newberry, SC Scephanie Lynn Young Walhalla, SC \r\nMarketing \r\nMegan Elizabech Alexander _______ Arnold, MD Scephen Lawrence Gritzuk North Babylon, NY \r\nElizabech Ashley Barnard Deland, FL Kriscen Ashley Haigler Greenwood, SC \r\nJason Andrew Bear Williamston, SC Laura Lee Hall Anderson, SC \r\n**Macie Elizabech Bearden Greenville, SC **Roberc Whalen Hall Fairport, NY \r\nScacey Michelle Benson Frederick, MD James Marion Holloway 111 Columbia, SC \r\nAnn-Whicney Berry Mechanicsville, VA Michael J. Holoman Camden, SC \r\n*Kelly Joyce Bishop Travelers Rest, SC Thomas Geoffrey Houser Palacine, IL \r\nHeather Michelle Breedlove Conway, SC Jack Delbert Howle Ill Sumcer, SC \r\nCristin Anne Brooks Alpharetta, GA Britcany Lanell Jones Saugus, CA \r\nMarianne Spencer Bruner Columbia, SC Chad Michael Jordan Simpsonville, SC \r\nMeri Ellen Buckalew Conway, SC Karen Louise Kopp Anderson, SC \r\nDaniel Benjamin Bufkin Litcle Mountain, SC **Magdalena Agnieszka Kupiec __ Kedzierzyn-Kozle, Poland \r\nVirginia Alyson Burk Sparcanburg, SC Linda Farah Leaman Columbia, SC \r\nJason Caravaci Burke Richmond, VA Jessica Michelle Lehr Cincinnati, OH \r\n*Amy Elizabeth Butschkau Cincinnati, OH Amber Carmen Lewis Winnsboro, SC \r\nZackary Ray Callaham Belcon, SC Heather Amanda Lingle Florence, SC \r\nRobert S. Cavanagh, Jr. Wakefield, RI Amberina Rae Litcle Columbia, SC \r\nKathryn Jean Christian Columbia, SC Tiffany Jill Logue Aclanta, GA \r\nHenry Summers Clarke Florence, SC Erin Marie Long Greenville, SC \r\n*Alison Paige Coday Springfield, MO Samantha Jennifer Marcantonio ___ Berkeley Heights, NJ \r\nDavid Paul Dellinger Charlotce, NC Corinne Alisa Marcin Fairfield, CT \r\n*Michael Patrick Dixon Westfield, NJ **Sara Domenica Martinelli Trumbull, CT \r\nPeter Blair Donald Hilton Head Island, SC Michael David Mastin Columbia, SC \r\n*Elisabeth Brooke Downs Sparcanburg, SC Lauren Eris McClure Anderson, SC \r\nKelly Denise Dumic Greenville, SC Melissa Marie McDowell Conway, SC \r\nMacchew Oyenson Greenville, SC Stanley J. McElveen, Jr. Timmonsville, SC \r\nWilliam Scocc Elgin Anderson, SC Teri Lee McGuire Summerville, SC \r\nBrooke Wasson Ellenberger Rock Hill, SC *Cassandra Marie Moody Darlington, SC \r\nMatchew Todd Elliotc Tallahassee, FL Troy Eugene Moore II Greenville, SC \r\nJennifer Mary Farching Summerville, SC Clifcon Lamar Muckenfuss Ill Hartsville, SC \r\n*Kylie Rebecca Ferguson Boca Racon, FL Sam P. Nikopoulos Anderson, SC \r\nDouglas Brian Finken Union, NJ Daniel Shane Norris Anderson, SC \r\nScacey Jean Finner Macon, GA Kathleen Ann O'Brien Fayetceville, NC \r\nShawn Patrick Flahercy Sumter, SC **Kendall Marie Odom Fort Mill, SC \r\n*Rhonda Ruth Fleming Greenville, SC Crystal Lynn Owens Walhalla, SC \r\nKacherine Elizabeth Fowler Spartanburg, SC *Ashleigh Michelle Padgetc Walterboro, SC \r\nClayton Tyler French Dresher, PA *Brian Thomas Pearce Charlotce, NC \r\nThomas Brande Gilbert Greenville, SC George Kevin Picts Newberry, SC \r\nChristopher Thomas Gillespie Mauldin, SC **Karen Marie Puglia Bowie, MD \r\nMelissa Leigh Gimbel Columbia, SC *Nachan Mott Rawlins Lichonia, GA \r\nJames Webb Goins IV Pamplico, SC Richard A. Rembis, Jr. Clifton, NJ \r\nHerberc Hugh Gould, Jr. Bennectsville, SC Kevin Michael Rouby Greenville, SC \r\nAimee Regiscer Gray Anderson, SC *Amy Elizabech Ruschkofski Columbia, SC \r\nBryan Reed Griffich Charlotte, NC Kelly Elizabech Sanborn Annandale, VA "
    },
    {
        "page_number": "27",
        "text": "Marketing (continued) \r\n*April Lorraine Sawyer..,,,,,---------::- Marion, SC Woodrow Ervin Swink ________ Effingham, SC \r\nJames Crawford Sawyers Ill Spartanburg, SC *Mary Ann Taylor Rock Hill, SC \r\nJoel Michael Sellers II Gaffney, SC Lauren Michelle Torr Seneca, SC \r\n+•Brad Donald Smith Altavista, VA **Silvia Leonora Travis Travelers Rest, SC \r\n*Benjamin Leonard Smoot Fairfax, VA Whitney Elizabeth Tremoulis Knoxville, TN \r\nJared Nathan Sobe Ison Atlanta, GA Gregory Martin Tum er Granger, IN \r\nBrian Patrick Sofield La Plata, MD Robert John Uva, Jr. Charlotte, NC \r\nDonavon Maurice Springs Camden, SC Christopher Lyn Ward Mauldin, SC \r\nJill Galyn Stecher Camp Hill, PA Brad Evan Weathers Woodruff, SC \r\nCatherine Bennett Stipe Fairfax, VA Hunter Draper Willis Milford, DE \r\nStacey Lynn Stoiber Seneca, SC La Shonda Renee Wilson Columbia, SC \r\nRobert Paul Strelick Rochester, NY Pamela Dawn Wilson Manning, SC \r\nAnna Marie Strizki Hopewell, NJ Brian O'Neal Wofford Spartanburg, SC \r\nKathryn Teresa Sweeney Arnold, MD Matthew Tinker Zielke Summerville, SC \r\nRyan William Swindells Glastonbury, CT \r\nPsychology \r\n*Greshan Renee Alexander _______ Tamassee, SC Margaret Ann McRae-------- Charleston, SC \r\n**Jill Anne Black Middletown, OH Robert Douglas Miller Columbus, OH \r\n*Catherine Carnes Branen Lilburn, GA Scott Kenneth Mills Easley, SC \r\nLaura Michelle Bratton Gainesville, GA ••Jennifer Lynne Neal Damascus, MD \r\nLeslie Erin Clennan Basking Ridge, NJ Michael David Nix Pickens, SC \r\nPenny Renee Ford Georgemwn, SC **Karen Rebecca North Lexington, SC \r\n*William Thomas Gay, Jr. Atlanta, GA *Stephanie Anne Northington Aiken, SC \r\n*Monica Denys Gray Spartanburg, SC Frances Rodgers Parker Lancaster, SC \r\n**Jason Lee Gunnarson Myrtle Beach, SC **Theodora Sophia Passinos North Palm Beach, FL \r\nNathan Stephen Holleman Chapin, SC *Elizabeth Anna Peace Florence, SC \r\nAmanda Grace Hudson Clinton, SC Sara Miller Stone Mclean, VA \r\n••Matthew Craig Jobson Lexington, SC +••Matthew Charles Waesche Baltimore, MD \r\n*Ashli Gwinn Kimbrell Union, SC Carrie Hataway Walden Orangeburg, SC \r\n*Kristy Jane Laird Greenville, MS Jennifer Fay Whetstone St Matthews, SC \r\n*Jessica Marie Lee Lugoff, SC *Christin Marie Whitaker Dayton, MD \r\nWilliam Steven Love Rock Hill, SC Eric Gerard Wietharn Pittsburgh, PA \r\nAlexis Leigh McCanless Rock Hill, SC **Barbara Judith Wilson Wayne, PA \r\nSociology \r\nElizabeth Smith Chasteen _______ Yorktown, VA Jeremy Chad King _________ Williamston, SC \r\n*Thomas Hamilton Davis IV Sumter, SC *Steckley Louise Lee Plant City, FL \r\nCorissa Anne Dent Anderson, SC Rita Polius Macon Belton, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF ARTS \r\nChemistry \r\nShane Valentin _________ Greenville, SC \r\nComputer Science \r\nWesley Matthew Hix _________ Columbia, SC Irene Shaw ____________ Ringwood, NJ \r\nMathematical Sciences \r\n+**Nina Holliman Webb ________ Beaufort, SC +•••Kristen Ann Young _________ Lilburn, GA \r\nDOUBLE MAJOR \r\nMathematical Sciences and Political Science \r\n*Andrew Stephen Pennock ___ Hendersonville, NC \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering \r\nDena Joann Graves--------- Spartanburg, SC Roscoe Elliott Oswald III ________ Wagener, SC \r\n*Jessie Michelle Muir Conway, SC Ryan Margaret Wedderien Dalzell, SC \r\nCeramic Engineering \r\nJames Jason Abercrombie --------Clemson, SC Corey Andrew Kalbaugh _________ Aiken, SC \r\nKatherine Anne Aude Gaylord, MI Wesley Paul Lee Fair Play, SC \r\nJacob Russell Cunningham Lexington, NC James Jason MacNeal Mt Pleasant, SC \r\n•••Duncan Clive English Anderson, SC Kevin Michael McClure Columbia, SC \r\nMichael Jamahl Glaze Beaufort, SC Dolly Elizabeth Player Darlington, SC \r\nBrian Heath Hughes West Union, SC Amanda Kaye Poole Clemson, SC \r\n*Robyn Lindsay Johnson Marietta, GA **Zachary Justin Reitmeier Mt Pleasant, SC "
    },
    {
        "page_number": "28",
        "text": "Chemical Engineering \r\nJeffrey Paul Allara -,------------olrmo, SC **Jennifer Leigh Johnson _________ Seneca, SC \r\n**Kara Rene Andrighetti Greer, SC William Manning Malloy Ill Cheraw, SC \r\n*Joseph john Benich Ill Mr Pleasant, SC john Patrick McKibbin North Augusta, SC \r\nMichael Thomas Bernat Baton Rouge, LA Juli Ann Mclaurin Dillon, SC \r\n*Tracy Darlene Blanchard Roebuck, SC +**Christopher William Norfolk Cedar Rapids, IA \r\nJames Rutledge Bumgardner Ill Lancaster, SC Scott Henry O loff Spartanburg, SC \r\n**Russell William Chapin Aiken, SC Kriscina Dawn Peterson Kings Mouncain, NC \r\nBrian Lee Cranford Fort Mi ll, SC Christopher Joseph Salvador Greenville, SC \r\nFowler Bernard Del Porto Charleston, SC Michael David Schubert II Cincinnati, OH \r\nWilliam Frank Edwards, Jr. Taylors, SC *Kelsey Ranier Shaw Mayesville, SC \r\n+*Robert William Fleming Pisgah Forest, NC Shina Amander Sowell Cheraw, SC \r\nDenise Kathryn Guthrie Greenville, SC Sean Lamar Sudduth Greer, SC \r\nMichael Thaddeus Honea Westminster, SC Tanika Lanell Wallace Barnwell, SC \r\nJennifer Lynn Hood Aiken, SC Stephen Herman Weathers, Jr. Bowman, SC \r\nWilliam Troy Huey Lakeland, FL Kenneth Gaines Wilson Anderson, SC \r\nSean Patrick Israel Ashevi lle, NC Wirianto Wong Jakarta, Indonesia \r\nChemistry \r\n**Lewis Warren C layton Ill ______ Spartanburg, SC +**Lea Wallis Knighr _________ Clemson, SC \r\nBradley M. Dickson Powdersville, SC Melissa Ballard Paul Seneca, SC \r\nStephen Jason Johnson Goose Creek, SC Jennifer Lee Wright Gaffney, SC \r\nCivil Engineering \r\nFrank Jason Bamwell _________ Orangeburg, SC Mary Margaret Lane ___________ Kingstree, SC \r\nRonald Wayne Bullman, Jr. Spartanburg, SC Shana Young Love Greenville, SC \r\n**Cynthia Idelle Chapman Ware Shoals, SC Christopher Grant Murray Olean, NY \r\nErin El izabeth Cumbie Centra l, SC Thomas Robert Myers Mt Holly, NJ \r\nMichael Joseph DePalma Lake Wylie, SC Cameron Garland Nations Pickens, SC \r\nBrendan Thomas Dolan Nesconset, NY Hesha LaRane Nesbitt Hollywood, SC \r\nChad Richard Elledge Lexington, SC **Amanda j. Pfaller Knoxville, TN \r\n**Carl Spencer Frizzell Sylva, NC ***Ryan L. Pope Summerville, SC \r\nJason Jermaine Gamble Georgetown, SC Kevin Joseph Reardon Greer, SC \r\nTammy Lynn Gross McClellanville, SC Wesley C lement Ryans Trenton, SC \r\nBrenda Grover Greenville, SC *Brandon Frederick Score Florence, SC \r\nChad David Hendrix Saluda, SC James Franklin Snelling Lexington, SC \r\nMichele Corrin Heyward Denmark, SC Jason Andrew Stull Columbia, SC \r\n**Sara Elizabeth Hobbs Columbia, SC *Kristina Lea Tate Greenville, SC \r\nChad Mitchell Humphrey Avery's Creek, NC Robert William Twilley Chevy Chase View, MD \r\n***David Franklin Impson Fountain Inn, SC Scott Tillman Warren Columbia, SC \r\nEric Glenn Jones Gaffney, SC Travis William Wheeler LaGrange, GA \r\njohn Amos Kaner Clemson, SC Matthew Paul Wimer Six Mile, SC \r\nMichelle Ann Kelly Moncks Corner, SC \r\nComputer Engineering \r\nYeboah Yaw Adjei __________ Beaufort, SC David Windsor Johnson ________ Duxbury, MA \r\nTanveer Ahmed Columbia, SC Robert Neal Kingsbury Ill Vilseck, Germany \r\n*Cacherine Victoria Bosch Summerville, SC +***Care l Anne Lewis Springfield, VA \r\nBrian Daniel Bull Holly Hill, SC Larry Mazyck Summerville,SC \r\nRussell Howard Buzhardt Williamston, SC Dexter LaMar Powell Columbia , SC \r\nTimothy Edward Dickson Williamston, SC Jason Travis Pundc Summerville, SC \r\nRichard Parker Fortson Atlanta, GA **Cameron Elizabeth Quinn Wilson1 NC \r\n*Scott Michael Galbraith Fayetteville, AR Kina Tyese Simmons North Charleston, SC \r\nAnn Marie Goings Loris, SC \r\nComputer Information Systems \r\nNeil Anthony Gooden .,--------- Columbia, SC Jason Colin Riddle.,-_________ Anderson, SC \r\nJames Lucious Johnson, Jr. Lynchburg, SC **Adam Ryan Scarboro Ashev ille, NC \r\nBrian James Kelleher Villa Hills, KY Anthony O'Neil Smith Ridgeland, SC \r\nChama Niche le McCoy Bethune, SC Reiko Takakuwa Spartanburg, SC \r\nMichael John Mucciarone Fort Mill, SC Christopher Patrick Whalen Charlotte, NC \r\nFranklin Comeilius Norris IV Florence, SC \r\nComputer Science \r\n+**David Lawrence Chandler -----=--Pickens, SC ***Amber Paige Jones. _________ Cliffside, NC \r\nWilliam Marshall Davis Simpsonville, SC Michael Leo King Liberty, SC \r\njohn Andrew Demos Seneca, SC Eric Wade Medlin Rock Hill, SC \r\n*Nicholas Adam Fraser Fayerreville, NC Kenneth Scott Sandefur Greenv ille, SC \r\nNicholas Matthew G lover Aiken, SC +*Jeffrey Nolasco Valdez Goose Creek, SC \r\nPeter W. Ho Marion, SC \r\nElectrical Engineering \r\nJeffrey Anrhony Abbate ________ Wanaque, NJ *Joshua Wayne Cody ________ Spartanburg, SC \r\n+***Jason Proctor Anderson Fork, SC William Timorhy Dodson Rosman, NC \r\n*Brian Anthony Bendt Charleston, SC Desiree Fairhe Floyd Sumter, SC \r\nBilly Ray Bost II Greenville, SC Curtis Anrhony Granr, Jr. Hopkins, SC \r\n*Benjamin Hitchcock Bradley Delray Beach, FL Duane Philip Henson Landrum, SC \r\nOmar Hasan Buheis Clemson, SC Shawn Moody Higbe Andrews, SC \r\nJeremy Kyle Bueler Clinton, SC Vernon jasper Holder, Jr. Marion, SC "
    },
    {
        "page_number": "29",
        "text": "Electrical Engineering (continued) \r\nThomas Leo Hutchins, Jr. _______ Summerville, SC Jeffrey Phillip Pickett ___________ Greer, SC \r\n*James Scott Jackson Boiling Springs, SC *Jon Carter Renck Hartsville, SC \r\n+•••David Karl Karig Isle Of Palms, SC James Hampton Smith Palm Beach Gardens, FL \r\n+•Japheth James Light Midlothian, VA Terry Allen Snell, Jr. Hinesville, GA \r\n+***Michael David Lockard Columbia, SC +**Christopher Michael Tompkins Lakeland, FL \r\nKevin Jerod Manigault Bamberg, SC Christopher Morgan Wagner Summerville, SC \r\nAgere Yilma Mekuria Georgetown, SC Don Charles Walker Charleston, SC \r\nJerry Anrhony Muoio Ladson, SC Robert George Wetherell, Jr. Piedmont, SC \r\nDaniel Paul Newlin Springfield, VA \r\nGeology \r\nTrevor Jackson Benron _______ Columbia, SC \r\nIndustrial Engineering \r\nMario Alberto Alvarez Quito, Ecuador David Reid Garrison --------- Anderson, SC \r\nSamuel Petty Banks Ill Pickens, SC *Vishnu Keesara Hyderabad, India \r\n*Jason Douglas Barger Pickens, SC +•Matthew Richard Lawrence Montgomery, AL \r\n**Kelley Grace Beltram Spartanburg, SC ***Alison J. Miller Bishopville, SC \r\n•••Spencer Nolan Bernstein ___ Hilton Head Island, SC +••Carissa Marie Miller Moncks Corner, SC \r\nAdonis Demetrius Briscow Florence, SC Ibrahim Yasin Sabur Detroit, MI \r\nRyan Coleman Burnett North Augusta, SC *Apurva Dipak Shah Spartanburg, SC \r\n•••Christopher John Buzzell Westbrook, ME John Christopher Sieverdes Clemson, SC \r\n**Wesley Thomas Curtis Clarksville, MD Jameka Aletha Sims Timmonsville, SC \r\nJerome Gregory Deveix Greenville, SC Chrystal L. Smalls Florence, SC \r\nAndrew Davidson Drake Rockville, MD Margaret Anne Ellison Stamp Bright, IN \r\nRobert Paul Edwards Elloree, SC Jennifer Lee Wienecke Ellicott City, MD \r\n+**Michelle Myra Fink Greenville, SC \r\nMathematical Sciences \r\n*Angelita Marie Cox __________ .Akron, OH Mia LaShandra Richardson _______ Ridgeway, SC \r\n+***Amy Denise Lauger Cenrral, SC Bradley Keith Scott Lexington, SC \r\n+•••George William Meister Lawndale, CA Jeffrey Lynn Wilterding Barnwell, SC \r\n+••Kelly Jean Pennington Cincinnati, OH +*•Heather Marie Zuleba Columbia, SC \r\nMechanical Engineering \r\nEddie Christopher Allison ________ Gaffney, SC Timothy Brian Littleton _________ Clinton, SC \r\nTravis Wade Altman Lake City, SC Lawrence Paul Livingston Florence, SC \r\nPaul Timothy Binetti Finksburg, MD Melody Nicole Lusk Seneca, SC \r\nErno Joseph Bowe Nassau, Bahamas Patrick Timothy Magee Rockland, NY \r\nMichael Jeffery Bradford Chattanooga, TN +•Joseph Logan Marshall Gran iteville, SC \r\n**Damon Scott Bungard Rock Hill, SC Richard Kevin McCurry Anderson, SC \r\nBrian Richard Bunnell Jacksonville, FL +*Val Demar Mills C lemson, SC \r\nTracey Dawn Butler Wilmington, NC Nancy Jennings Moore Cary, NC \r\nAshley G. Ca ldwell Spartanburg, SC +••Joseph Alexander Mozingo Edgemoor, SC \r\nKevin James Carey Milton, DE *Robert Warren Nichols II Fountain Inn, SC \r\nAsh win Prakash Chand Greer, SC Christopher Neal Nunn Charleston, SC \r\nChanre Jenene Cohen Cross, SC Robi DaVem Owens Nesmith, SC \r\nJames P. Conroy Walhalla, SC David Jenkins Patrick Greenwood, SC \r\nAndrew David Cunningham Arlington, VA Duncan McCrary Plemin Columbia, SC \r\nJon Robert Delong Wando, SC Matthieu Jean-Charles Pretot Greenville, SC \r\nManuel del Valle Greenville, SC Steven Joseph Raines Landrum, SC \r\nJay Workman Edwards Lexington, SC Victor Brett Robinson Florence, SC \r\n*Gregory Michael Feldman Charleston, SC Mathew Curtis Roling Simpsonville, SC \r\nPaul Anthony Flaherty, Jr. Sullivan's Island, SC Mark Alan Rosenfeld Bloomington, IL \r\nMatthew Justin Frady Brevard, NC Jason John Schoenmaker Fore Mill, SC \r\nMichael Anrhony Gagliardi Gaffney, SC Thomas Michael Seigler Greenville, SC \r\nThomas Howard Goodwin Fort Mill, SC Corey Terrill Short Wallace, SC \r\n••John Paul Guerranr Greenville, SC David Allen Singletary Summerville, SC \r\nMatthew Todd Heath Florence, SC Rodrick Lonard Smalls Vance, SC \r\nMcCall Gregg Hemingway Ill Summerton, SC James Campbell Spears Rock Hill, SC \r\nBrian Harvey Holstad Cameron, SC Neil Albert Scruby, Jr. Macon, GA \r\nWilliam Thaddeus Hudson Lamar, SC +**Christopher John Szymendera Newtown, PA \r\nRyan Meredith Jackson Fore Mill, SC Eric David Thome Aiken, SC \r\n+*Cheryl Lynn Jones West Orange, NJ Mark Hampton Thornton II Moore, SC \r\nThomas Blake Joy Piedmonr, SC John Madison Tramel, Jr. Spartanburg, SC \r\nMatthew S. King Clemson, SC Jason Christopher Turner Easley, SC \r\nDavid Wilson Knowles IV Cheraw, SC Kyle Stephen Watkins Greenville, SC \r\nMichael John Lard Greenville, SC Kevin Brem Weeks Atlanta, GA \r\nTommi Rochelle LaRoche Bennington, VT Louise Gregg Wheeler Myrtle Beach, SC \r\nMelinda Kathleen Leeson Florence, SC David Ernest Whitehead Greenville, SC \r\nPhysics \r\n+••Ted Brian Bunton.~ _________ Pelzer, SC +**Jason Robert Jeffries-------- Florence, SC \r\n+•••Brian Wesley Eaddy Florence, SC +*Chad Michael Schuster Bernard, IA \r\n+*Eric William Gregory Oak Ridge, TN "
    },
    {
        "page_number": "30",
        "text": "Textile Chemistry \r\n•Amanda Claire Lattam -------- Rock Hill, SC +•••Elizabeth Dianne Richardson _____ Lexington, SC \r\nMegan Patricia Powell Summerville, SC +••Walter Philip Watson Taylors, SC \r\nTextile Management \r\nRebecca McFarland Bogg•-------,-,..-. Sumter, SC Shane Michael Teague---------- Easley, SC \r\n•Hayden Elizabeth Carr Myrtle Beach, SC •Austin Fletcher Watts Greenville, SC \r\nSpencer Kelvin Smith West Columbia, SC James Murray Wilson II Columbia, SC \r\nTextile Science \r\nGabriel Vance Brown ________ Sumter, SC \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nHAROLD ERNEST CHEATHAM, DEAN \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\n•Kelly Meredith Barber _______ Murrells Inlet, SC •Lori Beth Holcomb ________ Glastonbury, CT \r\nRoneka Daevette Blassingame Seneca, SC Stephanie Anita Jenkins Whitmire, SC \r\n*Jennifer Ann Bowers Lancaster, SC Crystal Lynne Kasubinski Fort Lawn, SC \r\nLa Toya Wavette Boyd Bishopville, SC Julie Adrianne Mankin Greenville, SC \r\nRebecca Ann Bozard Orangeburg, SC ***Robin Elizabeth Mitchell York, SC \r\nCarrie Lynn Breed Hilton Head Island, SC *Susan Michele Parker Roswell, GA \r\nLara Katherine Clark Greer, SC •Shauna Ann Riehl New Fairfield, CT \r\nThomas Potter Corbin Bethesda, MD Amanda Leigh Ritchie Eutawville, SC \r\nKimberly Ford Crane Seneca, SC **Melissa Beth Sides Lexington, SC \r\n•Catherine Louise Davis West Union, SC Judith Elaine Strickland North, SC \r\n•••Sharon Elizabeth Davis Gaffney, SC Valerie Jill Summerville Sharon, SC \r\nValeri Lynne Dyches Easley, SC Carrnon Ellen Valentine Ruffin, SC \r\nCourtney Anne Edwards Orangeburg, SC Trina Nicole Vaughan Union, SC \r\n•Kristin Sue Fulkerson Gaffney, SC Malinda Gamble Ward Chapin, SC \r\nErin Elizabeth Green Rock Hill, SC **Rebekah Lynn Wardlaw Central, SC \r\nAnsley Michelle Greene Clemson, SC Stephanie Meek Watkins Greenville, SC \r\n*Jennifer Hope Hamilton Easley, SC \r\nElementary Education \r\n+**Henri Holmes Adair ________ Anderson, SC *Ashley Brooke Hunnicutt _______ Whitmire, SC \r\nBrent Alan Adcox Easley, SC Lannie Marian Johnson Manning, SC \r\n••Jodie Gelsthorpe Allmon Asheboro, NC Frances Elizabeth Kidd Athens, GA \r\nKelly Marie Anselmo North Charleston, SC Amy Nicole King Ande..on, SC \r\nCaryn Victoria Antos Summerville, SC •Sarah Elizabeth Lynch Greer, SC \r\n+•••Karen Christine Babb North Augusta, SC •Elinor Rahn McCrady White Rock, SC \r\nErin Marie Benko Charlotte, NC Lisa Marie McFarlane Greenville, SC \r\n•Angela Michelle Berry Fork Shoals, SC Joni Diana Murrell Edgefield, SC \r\nPenelope George Bikas Anderson, SC ••Sara Beth Nelson Simpsonville, SC \r\n•Stephanie Leigh Bowen Anderson, SC Marlayna Lynn Neste Hilton Head Island, SC \r\n*Christi DeAnn Carson Travelers Rest, SC Dawn McGwin Phillips Honea Path, SC \r\nChristopher Ryan Cooke Charleston, SC Melissa Jennifer Plummer Greer, SC \r\nAndrea Dawn Craig Greenville, SC **Jennifer Ashley Preacher Bamberg, SC \r\n•••Lisa Carol Curry Seneca, SC Laura Beth Pulley Slater, SC \r\n•Kimberly Joy Davenport Chantilly, VA Lacey Ann Rhymer Greenville, SC \r\n•Rochelle Elisabeth Davidson Columbia, SC Caleigh Roxane Robinette Spartanburg, SC \r\nArny Deanhardt Anderson, SC +••Jennifer Elizabeth Satkowski Barnwell, SC \r\nJaimee Ann DeFrancesco Sparta, NJ Wanda Adele Saylor Newberry, SC \r\nCarl Patrick During Greenville, SC Eva Jeanette Schutt Charleston, SC \r\nJecoliah Arneice Eason Spartanburg, SC Melissa Harris Skinner Anderson, SC \r\n•Susan Elizabeth Eaves Rock Hill, C **Jennifer Caron Smith Mauldin, SC \r\n*Sally Ann Ferguson Kershaw, SC Lindsay Allen Smith Mauldin, SC \r\n•••Josie Kate Tardiff Floyd Clinton, SC +**Elliott Michael Southard Anderson, SC \r\nAllison Marie Freund Marietta, GA Lara Elizabeth Swayngharn Pickens, SC \r\nEric Andrew Gould Bethel, CT *Jennifer Marie Thackston Mauldin, SC \r\nKristine Elizabeth Guardino Syosset, NY Jennifer Renee Vaughn Greer, SC \r\nStacey Dawn Helms Fort Mill, SC Christine Marie Veith Silver Spring, MD \r\n*Sarah Lea Hogue Columbia, SC Megan Marie Webb Charleston, SC \r\n••Lori Elizabeth Holden Smyrna, GA Marsha Bethea White Seneca, SC \r\n•••Kathleen Howard Holladay New Orleans, LA Kenya Dernorris Wilkinson Greenville, SC \r\n*Kerry Gwen Holtzendorff Laurens, SC •Tara Sha Wilson Rock Hill, SC \r\n*Robyn Lynn Hooker Seneca, SC \r\nSecondary Education \r\n**Millicent Dawn Abercrombie _____ -,,...,.Pelzer, SC Theresa Kathleen Boyce ________ Greenville, SC \r\nRose Helen Alston Columbia, SC Kelly Janette Boyle Pittsburgh, PA \r\nKeri Lea Appleton Easley, SC ••Kacie Lauree Bramlett Greenville, SC \r\nKevin MacArthur Barnes Rock Hill, SC Matthew Edward Brantley Chesterfield, SC \r\nBrent David Bernier Greenville, SC Carrie Lynn Brockman Reidville, SC "
    },
    {
        "page_number": "31",
        "text": "Secondary Education (continued) \r\n••Aaron Jason Bueler _________ Conway, SC Treva Cleveland Lee ________ Westminster, SC \r\nMatthew Lee Callenback Anderson, SC *Joan Allison Marlow Ramseur, NC \r\nAmanda Marie Davidson Easley, SC Margaret Ann McKinney Dalton, GA \r\nKristin Denise Doege Brielle, NJ *Carrie Ann Monge Glastonbury, CT \r\nSusan Rector Duckworth Anderson, SC Jared Ramon Ortega Hanahan, SC \r\nTracy Diane Fuller Greenville, SC **Kinsley McHael Roper Anderson, SC \r\nLori Anise Guinn Six Mile, SC Lawrence B. Sullivan Clemson, SC \r\nJonathan Ammon Hammett~ Bregger Clemson, SC Patrick Arthur Summerour New Orleans, LA \r\n**Jennifer Leigh Hogan Clemson, SC Jennifer Marie Viti Sparta, NJ \r\n**Martha Joanne Huffman Fremont, O H Stanley Dean Yarborough, Jr. Marion, SC \r\nKathryn Allison Johnson Charleston, SC *Joshua Alan Young Honea Path, SC \r\n*Christine Camlin Lee Moncks Comer, SC \r\nSpecial Education \r\n*Sherri Lynn Beauvais ________ Narragansett, RI Courtney Michelle McBride _______ Greenville, SC \r\n*Brandon Cayce Becker Greenville, SC Melissa Ann Muller Charleston, SC \r\nJane Deutsch Cherry Anderson, SC Meredith Jo Myers Tucbeville, SC \r\n*Robyn Leah Childers Wagener, SC Aubree D. Newman Gwynedd Valley, PA \r\nMary Katherine C lark Summerville, SC *Kevin Scott Ritchie Gray Court, SC \r\nRyan Patrick Corbett Alpharetta, GA Kristin Michelle Salmon ackson, NJ \r\nAlison Danielle Durfos West Milford, NJ Elizabeth Anne Scott Brookeville, MD \r\nAllyson Marie Eld Corry, PA *Shawna Marie Standley Greenvi lle, SC \r\n••Amanda Clare Hardee Mt Pleasant, SC *Stephanie Joy Stevens Lapeer, Ml \r\nDeitre Owens Helvy Anderson, SC Elizabeth Hope Trussell Hanahan, SC \r\nAllison Marie Hood Easley, SC Erin Michelle Wilson Camden, SC \r\nKaitlyn Marie Landi Hanover, MA Dorsey Diane Wyatt Greenville, SC \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\nReagan Michelle Alexander _______ Greenville, SC •••Nancy Lucille Hancock Mooresville, NC \r\nSandon Thomas Barth Charleston, SC Maquina Sayidi Adjo Harris ___ Hilton Head Island, SC \r\nSteven Christopher Bendetto Holbrook, NY Patricia Elise Land Falls Church, VA \r\nKelly Ann Claybourne Greenville, SC ••Margaret Lindsay Murdoch Greer, SC \r\nJacqueline Marie Cleary Wyckoff, NJ Rose Marie Payne Pendleton, SC \r\nKate Dowling Coker Gilbert, SC Kelly Lee Pettit Greenville, SC \r\n•Meagan Matthews Davis Cooperstown, NY Sarah Anita Louise Phillips Ann Arbor, Ml \r\n**Joseph Allen Delancy Orangeburg, SC Kimberly Carol Russ Greenville, SC \r\nBrett La Verne Duke Manning, SC Jamie LeAnn Tallant Cleveland, GA \r\nChrista Marie Eberhardt Peachtree City, GA Erika Lynn vanReenen Norcross, GA \r\nLaura Emma Eckel Greenville, SC Hope Elizabeth Wiegand Seekonk, MA \r\n*Erin Elizabeth Gaskins Society Hill, SC Ashley Michaelle Wilson Belton, SC \r\nEmily Catherine Gorla St Peters, MO Jennifer Rachel Winburn McBee, SC \r\nLindsay Ann Gosnell Spartanburg, SC Ryan Douglas Woodruff Pawley's Island, SC \r\nElizabeth Reagan Green Turbeville, SC Jessica Dawn Zarnoff Englewood, FL \r\nMeghan Elizabeth Green C lemson, SC \r\nIndustrial Education \r\n•••Dale Lane Butts ___________ Seneca, SC John Lawrence McDermott IV _____ Woodstock, GA \r\nJonas Seth Crooks Westminster, SC Timothy Lee Nix Central, SC \r\nLeslie Rene Fann Greenville, SC Matthew Edmund Pearce Columbia, SC \r\nWendy Jeannette Farnum Seneca, SC ••Steven Nathaniel Puckett Pelzer, SC \r\n*Andrew Philip Jacobs Pendleton, SC James Franklin Tobias Ill Sumter, SC \r\nMathematics Teaching \r\nSteven Luther Alexander-------- Pickens, SC Jeffrey R. Miller ___________ Fairport, NY \r\n**Jason Edward Faulkner Los Alamos, NM Amber Leigh Sweigart Clemson, SC \r\nMichael Brian McGowan Bellport, NY Larry Boyd Tarlton 111 Cheraw, SC \r\nNursing \r\n*Kristi Cooke Abercrombie ______ Simpsonville, SC Jennifer Leigh Geter --------- Columbia, SC \r\nGuendalina Barron Seneca, SC Ann Tennille Goodman Furman, SC \r\n*Mackenzie Leigh Belcher Duncan, SC •••Taryn Britney Hall Simpsonville, SC \r\n+***Alison Page Blount Augusta, GA *Martha Weathersbee Heyward Columbia, SC \r\nJessica Lynne Boulware Charleston, SC Laura Marie Holloway Columbia, SC \r\nAmanda Gale Brooks Walterboro, SC Ami Maureen Iseman Columbia, SC \r\nNicole Marie Eble Burdette The Woodlands, TX *Lisa Michelle Jacobson Columbia, SC \r\nBriana Rae Bure lie Aiken, SC +••Marcy Ryan Kaufmann Bear, DE \r\nShana Melissa Collins Walhalla, SC Sarah Louise Kennedy Summerville, SC \r\nCarolyn Elaine Cosgriff Aiken, SC *Shaye Renee Lathrop Chapin, SC \r\n*Dawn Justine Crowe Seneca, SC *Keisha Janelle Lewis Hartsville, SC \r\nAmy Elizabeth Doyle Sc Matthews, SC *Leigh Ann Lewis Anderson, SC \r\nWendy Leigh Drake Anderson, SC Gary Alan Lillis, Jr. Southold, NY \r\n+*Alyssa Christine Elgin Anderson, SC Yolanda English Livingston West Columbia, SC \r\nCrystal Lee Frady Satellite Beach, FL •Sonja Michelle Mauldin Union, SC \r\nJulia Anne France Huntsville, AL *Kerri Paxton McAlister Greenville, SC \r\n*Michelle Anne Frye Gilbert, SC Stephanie Dawn McGill Inman, SC "
    },
    {
        "page_number": "32",
        "text": "Nursing (continued) \r\nAlicia Dawn McKea.,_ ________ Yorktown, VA Stephanie Dawn Raleigh ________ ~Seneca, SC \r\nJennifer Anne Miller Rock Hill, SC Caci Lynn Riddle Piedmont, SC \r\nSheree Lynn Oostman Toccoa, GA *Erin Elizabeth Schatz Thousand Oaks, CA \r\nAngela Michelle Osborne Fort Mill, SC Allison Leigh Smith Grayson, GA \r\nMelissa Lee Paschal Pawleys Island, SC +••Joanna Kay Stafford Charleston, SC \r\nTalisha Nicole Peay Columbia, SC **Cherice Monique Wade Rembert, SC \r\nThewanda Anise Peterson Charleston, SC +*Sarah Livingston Westfall Summerville, SC \r\nAmy Renee Phillips Honea Path, SC Amanda Claire Whitehead Lexington, SC \r\nParks, Recreation, and Tourism Management \r\nJessica Louise Balling _________ Columbia, SC Jean Catherine Kyzer _________ Blue Ridge, SC \r\nLisa Michelle Barbery Taylors, SC Hugh David Maddox Columbia, SC \r\n***Kelli Ann Bass Slidell, LA *Aimee Kathleen Mastin Atlanta, GA \r\n+**Kimberly Boyle Bedford, NH Jeffery Wayne Metz Boiling Springs, SC \r\nJeffery Stuarc Britt Lexington, SC *Ryan Elizabeth Mitchell Columbia, SC \r\nKeith Alan Comiso Springfield, VA Thomas Austin Nelson Florence, SC \r\nCourtney Brooke Cramblet Fayetteville, GA Anne Beaumont Nichols Miami, FL \r\nJacqueline Aldebaran Pettigrew Crocker Starr, SC Michael Jozef Opalski Easton, MD \r\nMichael Kirby Dukes Walkersville, MD Michael Ryan Parkey Clemson, SC \r\nChristopher Edward Frattarola Teaneck, NJ Lee McDowell Parrish Columbia, SC \r\nJennifer Morgan Gilbert Anderson, SC Jennifer R. Passailaigue Charleston, SC \r\nRebecca Lynne Grace Ocean View, NJ Kathleen Casey Ryan Flagler Beach, FL \r\nGena Jo Graddy Lilburn, GA Bradley Gist Setzler Greenwood, SC \r\nJohn Jacob Grant Saluda, SC **Joni Allison Shenefield Lilburn, GA \r\n*Amber Joi Harrison Woodruff, SC Robert O'Neil Smith Columbia, SC \r\nLara Carlye Hill Horsham, PA Jason William Stockunas Clemson, SC \r\nAndrius Jurkunas Kaunas, Lithuania Sally Elizabeth Veltidi Suffern, NY \r\nShannon Christine Kavanaugh Belmont, NC Alysen Melissa Wood Easley, SC \r\nKristin Lee Keeter Richmond, VA \r\nPre#professional Studies \r\n*Erin Joy Allsep---=--~------Mountain Rest, SC *Stephanie Cecile James ________ Greenville, SC \r\n**Danielle Hsieh Doolin Charleston, SC ***Hillary Stacia Lowe Clover, SC \r\n**Sally Elizabeth Fulmer Goose Creek, SC \r\nScience Teaching \r\n**Barbara Francis Bullard _______ Plant City, FL Glenda Jean Lofink---------- Pickens, SC \r\nAngel Dawn Cavender Asheboro, NC David Earl McVicker Lexington, SC \r\nAimee Maria Chapman Fountain Inn, SC Jennifer Catherine Siedschla West Columbia, SC \r\nHoward Tucker Hamrick Shelby, NC Bridget Marie Sitterle Clemson, SC \r\n**Jennifer Anne Head Simpsonville, SC \r\n*Cum laude: A grade point ratio of 3.40 to 3.69 \r\n**Magna cum laude: A grade point ratio of 3. 70 to 3.89 \r\n***Summa cum laude: A grade point ratio of 3.90 co 4.00 \r\n+Departmental Honors: The graduates so designated have completed an enriched program of study designed by their departments \r\nwith the approval of the Calhoun College Honors Program. To earn Departmental Honors students must complete an honors \r\nthesis and/or other upper division honors courses, while maintaining an overall grade#point ratio of 3.40 or higher. Departmental \r\nHonors graduates appear in the line of march wearing the Calhoun College Honors Medallion on an orange and purple ribbon. \r\nThis medallion is made possible by an endowment established by Mrs. Katherine Inabinet Vickery of Columbia, South Carolina, \r\nto honor the memory of her husband and Clemson graduate, the lace B. C. Inabinet. \r\nStudents wearing the white stoles over their gowns are members of honorary societies that require a minimum 3.00 grade point \r\nratio for membership. The stoles have the University seal embroidered on one side, and on the ocher side are the emblem(s) of \r\nhonorary societies in which the student is a member. "
    },
    {
        "page_number": "33",
        "text": "Awards \r\nNORRIS MEDAL \r\nFirst awarded at C lemson University in 1908, the Norris Medal was established under the terms \r\nof che will of che Honorable 0. K. Norris, a life trustee of this institution. The medal is given each \r\nyear to the graduating scudent who, on the basis of exceptional scholastic achievement and leadership \r\nability, is judged by the University Scholarships and Awards Committee tO be the best all-around \r\nstudent. \r\nAll recipients of the Norris Medal have their names affixed m a bronze plaque mounted at the \r\nfront entrance of Sikes Hall. \r\nRECIPIENT OF THE NORRIS MEDAL \r\nCRAIG DAVID STORY \r\nFallston, MD \r\nALGERNON SYDNEY SULLIVAN AWARD \r\nThe Sullivan Award is given annually ro individuals who possess the characteristics of heart, \r\nmind, and conduct as evince a spirit of love fo r and helpfulness to other men and women . These \r\nhumanitarian qualities are exhibited in the following recipients. \r\nRECIPIENT OF THE ALGERNON SYDNEY SULLIVAN CITIZEN AWARD \r\nANN FUHR \r\nSeneca, SC \r\nRECIPIENTS OF THE ALGERNON SYDNEY SULLIVAN STUDENT AWARD \r\nJEFFREY MCCLAIN DA VIS \r\nGreensboro, NC \r\nAMY CALLAHAN HARRISON \r\nSimpsonville, SC \r\nALUMNI MASTER TEACHER AW ARD \r\nThis awa rd is presented by the C lemson Alumni Association for distinguished achievements in \r\nclassroom teaching. The faculty recipient is selected by the Scudent Alumni Council fro m \r\nnominations submitted by scudents. A bronze plaque is presented permanently to the recipient and \r\nthe award carries with it a stipend of fifteen hundred dollars. \r\nRECIPIENT OF THE ALUMNI MASTER TEACHER AWARD \r\nDR. WILLIAM FRANK STEIRER, JR. \r\nFACULTY SCHOLARSHIP AWARD \r\nEstablished at Clemson Un iversity in 1959, this award is made annually by the faculty of \r\nC lemson University ro the member of the grad uating class who has the highest scholastic \r\nachievement. All graduates who have completed the requ irements for the bachelor's degree since the \r\nlast commencement exercise and who have completed at C lemson at least 75 percent of the work \r\nrequired for graduation shall be eligible for considera tion. \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AWARD \r\nSHAWN D. CLAYPOOL \r\nWill iamston, SC \r\nJOSIE KATE TARDIFF FLOYD \r\nC lincon, SC \r\nALLISON MARIE GORE \r\nAnderson, SC \r\nAMY CALLAHAN HARRISON \r\nSimpsonville, SC \r\nAMBER PAIGE JONES Cliffside, NC \r\nDAVID KARL KARIG \r\nIsle of Palms, SC \r\nRICHARD BRANDON MANCILL \r\nLamar, SC \r\nMARY ELIZABETH MCGOWAN \r\nSpartanburg, SC \r\nGEORGE WILLI AM MEISTER \r\nLawndale, CA \r\nJEFFREY DANIEL POOLE \r\nGaffney, SC \r\nELIZABETH DIANNE RICHARDSON \r\nLexcington, SC \r\nCHARLES WALLACE SEIGLER, JR. \r\nRock Hill, SC \r\nKEVIN ROBERT THOMAS \r\nDillon, SC \r\nASHLEY DIONNE WHITFORD \r\nG ree r, SC \r\nKRISTEN ANN YOUNG Lilburn, GA \r\nVIRG INI A ABIGAIL YOUNG \r\nPelz«, SC "
    },
    {
        "page_number": "34",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green Clemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the \r\nRoyal School of Mines in Paris (1828-1832). His early profession was that of a \r\nmining engineer; however, circumstances diverted his interests into politics \r\nand the life of a southern planter, and he soon became an enthusiastic advocate \r\nof scientific agriculture. He had a career as a diplomat (charge d'affaires to \r\nBelgium, 1844-1852) and served as the first Superintendent of Agricultural \r\nAffairs in Washington (1860). As a scientist he published numerous articles in \r\nthe fields of mining, chemistry and agriculture. His varied activities included \r\nhis assistance in the founding of the Maryland Agricultural College, his support \r\nof the Morrill Act, his leadership in South Carolina after the Civil War, and \r\nhis part in founding Clemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two four-year \r\ncurricula, supplemented by two two-year preparatory courses. Today the \r\nUniversity has six major academic units. These are the College of Agriculture, \r\nForestry and Life Sciences, the College of Architecture, Arts and Humanities, \r\nthe College of Business and Public Affairs, the College of Engineering and \r\nScience, the College of Health, Education and Human Development, and the \r\nGraduate School. \r\nThe institution is an accredited member of the Southern Association of \r\nColleges and Schools; various curricula are accredited by the Accreditation \r\nBoard for Engineering and Technology, American Assembly of Collegiate \r\nSchools of Business, American Council for Construction Education, American \r\nSociety of Landscape Architects, Computing Science Accreditation Board, \r\nHuman Factors and Ergonomics Society, International Association for \r\nManagement Education, National Architectural Accrediting Board, National \r\nAssociation of Industrial Technology, National Association of State Directors \r\nof Teacher Education and Certification, National Council for Accreditation of \r\nTeacher Education, National League for Nursing, Planning Accrediting Board, \r\nand Society of American Foresters. \r\nClemson is a land-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is \r\nalso heavily committed to a varied program of public service, including the \r\nwork of agricultural extension which has professional personnel located in each \r\nof the State's counties. "
    },
    {
        "page_number": "35",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "36",
        "text": "Note : Candidates appearing in this program are not certified graduates. Likewise, \r\nacademic honors designations are based upon performance prior to final grades. Both \r\ncertification of graduation and honors designations must come from the Registrar of \r\nthe University. \r\n********** \r\nFirst Aid A First Aid Station is located at Portal 0. \r\nEvacuation System Littlejohn Coliseum is equipped with a fire alarm evacuation \r\nsystem. In the event of activation, as noted by sustained horns and strobe lights, \r\nplease proceed to the closest available exit. Remain outside the building until fire \r\nofficials deem the building safe to re-enter. \r\nNo Smoking Smoking is prohibited in the seating area of Littlejohn Coliseum. \r\nCigarette receptacles are provided around the outer concourse. "
    }
]