[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n5-1-2001\r\nClemson Commencement Program, May 2001\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, May 2001\" (2001). Clemson Commencement Programs. 218.\r\nhttps://tigerprints.clemson.edu/comm_programs/218"
    },
    {
        "page_number": "2",
        "text": "One Hundred Fifth Commencement \r\nMay 11, 2001 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "Congratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for individual \r\ngraduates. Such expressions frequently detract from the recognition due the \r\nnext graduate in line. Your cooperation is respectfully requested. "
    },
    {
        "page_number": "4",
        "text": "9:30 a.m. \r\nGraduation \r\nFriday, May 11, 2001 \r\nLittlejohn Coliseum \r\nORDER OF CEREMONIES \r\n2:30 p.m. \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation.) \r\nInvocation \r\nVerdale Nathaniel Benson, Student · Representative \r\nJoshua Bryant Byrd, Student Representative \r\nIntroduction of Trustees \r\nPresident James F. Barker \r\nConferring of Honorary Degree \r\nPresident James F. Barker \r\nRecognition of the Deans of the Colleges \r\nInterim Vice President for Academic Affairs and Provost \r\nDoris R. Helms \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident James F. Barker \r\nRecognition and Presentation of Awards \r\nNorris Medal \r\nAlgernon Sydney Sullivan Award \r\nAlumni Master Teacher Award \r\nFaculty Scholarship Award \r\nAurora Brass Quintet \r\nJane Dill, Organist \r\nKevin Davidson, Soloist \r\nDr. Renu C. Laskar, University Marshal \r\n• "
    },
    {
        "page_number": "5",
        "text": "BOARD OF TRUSTEES \r\nLawrence M. Gressette, Jr., Chairman _________ Columbia \r\nWilliam C. Smith, Jr., Vice Chairman Columbia \r\nBill L. Amick Batesburg ... Leesville \r\nJ. J. Britton Sumter \r\nLeon J. Hendrix, Jr. Kiawah Island · \r\nHarold D. Kingsmore Aiken \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee Greenwood \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick III · Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nAllen P. Wood Florence \r\nTrustees Emeriti \r\nL6~is P. Batson, Jr. ---------------~Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW. G. DesChamps, Jr. Bishopville \r\nPaul W. McAlister Laurens \r\nPaul Quattlebaum, Jr. Charleston \r\nD. Leslie Tindal Pinewood \r\nJames M. Waddell, Jr. Columbia \r\nExecutive Secretary to the Board of Trustees \r\nand Executive Assistant to the President \r\nJ. Thornton Kirby \r\nADMINISTRATIVE OFFICERS \r\nJames F. Barker~ ________________ President \r\nDoris R. Helms Interim Vice President for \r\nAcademic Affairs and Provost \r\nBenjamin W. Anderson ___________ General Counsel \r\nNeill Cameron Vice President for Advancement \r\nAlmeda Jacks Vice President for Student Affairs \r\nJohn Kelly Vice President for \r\nPublic Service and Agriculture \r\nScott Ludlow Chief Financial Officer ------------ Robert W. Robinson Director of Athletics "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nJERRY EDWARD DEMPSEY \r\nDOCTOR OF LAWS \r\nJerry Edward Dempsey, a native of Landrum, has always had a head for business. As a \r\nyouth, he demonstr~te.d his keen business sense when he started a small poultry business \r\nselling broilers to his neighbors. \r\nWith that spirit and initiative, Dempsey enrolled in Clemson University to pursue a \r\nMechanical Engineering Degree, which he received in 1954. He later obtained an MBA \r\nfrom Georgia State University and attended the executive seminar at the Aspen Institute \r\nof Humanistic Studies. \r\nDempsey once said, \"As early as I can remember, my dream was to run a major U.S. \r\ncorporation.\" His career has been a testament to that dream. Dempsey began at Borg\u0002Warner Corporation, where he spent 26 years progressing from student engineer to \r\npresident and chief operating officer. \r\nIn 1984, he joined Waste Management (previously WMX Technologies) as vice \r\nchairman and was named senior vice president of the company a year later. In 1986, \r\nDempsey was named president and CEO of Chemical Waste Management, a subsidiary of \r\nWaste Management. \r\nHe joined PPG Industries Inc. in 1993 as board chairman and chief executive officer, \r\nretiring in 1997. \r\nDempsey has served on the board of several corporations. He is currently a member of \r\nthe board of directors of Eastman Chemical Company, Birmingham Steel Corporation and \r\nNavistar International Corporation. He is a former board chairman of Chicago's Adler \r\nPlanetarium. He was a director of Business Roundtable; National Association of \r\nManufacturers; Allegheny Conference on Community Development; United Way of \r\nSouthwestern Pennsylvania; The Carnegie, where he was also chairman of the Carnegie \r\nScience Center; Pittsburgh Symphony Society; and the Duques_pe Club. Dempsey is a \r\ndirector of the Greenville Country Club and the Greenville Symphony. He is an elder in \r\nthe First Presbyterian Church. \r\nDempsey's ties to Clemson have remained strong. He is currently a member of the \r\nDean's Advisory Board of the Clemson School of Engineering and the President's Advisory \r\nCouncil. He was inducted into the Academy of Distinguished Clemson Engineers in 1995, \r\nand he received Clemson's President's and Alumni Distinguisped Service awards. He was \r\nco-chair of the Commission on the Future of Clemson University and is currently co-chair \r\nof the corporate committee for Clemson's capital campaign. \r\nHis many honors and ·awards included the Horatio Alger Award, the Anti-Defamation \r\nLeague American Heritage Award and Financial World magazine's service-business-CEO\u0002of-the-year Bronze Award. Dempsey received recognition as business leader of the year in \r\nOak Brook, Illinois, during his tenure at Waste Management-Chemical Waste \r\nManagement. He was named to the Business Hall of Fame for Southwestern Pennsylvania \r\nin 1997 and is listed in Who's Who in America and Who's Who in the World. \r\nIn recognition of his dedication to his profession and his service to Clemson University, \r\nit is with great honor and pleasure that we present the honorary degree, Doctor of Laws, to \r\nJerry Edward Dempsey. "
    },
    {
        "page_number": "7",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, \r\na senior faculty member, with the college baton, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the \r\nAmerican Council on Education, are as follows: \r\nCollege \r\nAgriculture, Forestry and Life \r\nSciences \r\nArchitecture, Arts and \r\nHumanities \r\nBusiness and Public Affairs \r\nEngineering and Science \r\nHealth, Education and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nD~rk Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurpie and Orange \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArc hi tee tu re \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocia 1 Sciences \r\nLibrary \r\nAc ad em ic Support \r\nInstruction \r\nCollegiate faculty follow their marshal in order of academic rank wearing academic \r\ncostumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United States wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions are \r\nspecified by a uniform code maintained by the American Council on Education. Caps are \r\nblack and are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels \r\nusually of metallic thread; other degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is to replace black velvet \r\nwith velvet in the discipline color. A second variation is a colored gown usually of the \r\nuniversity's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awarding \r\ninstitution. First, degree level is signified by the size of the hood with bachelors' smallest, \r\nmasters' larger, and doctors' quite large and of a different shape. Clemson does not award \r\nhoods to bachelors. The width of the velvet trim also conveys the degree. Secondly, the \r\ndegree is indicated by the color of the trim edging the hood to form the throat over the gown. \r\nThe most frequently seen is dark blue, which designates the doctor of philosophy (Ph.D.) \r\ndegree. Finally, the color of the hood~s lining specifies the awarding institution. The colors \r\nare displayed in combinations that are drawn from heraldry. Notice that the Clemson \r\nUniversity hood is lined with purple through which is an orange chevron {a \"Y\"). Although \r\nmany combinations are duplicated by dozens of institutions, Clemson is presently the only \r\ninstitution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastical, or military \r\nregalia as set forth by their professions. They are preceded by the University Marshal. Clad \r\nin a gown of office in gold and purple, the marshal wears no hood and bears the University \r\nmace. At the ceremony's close, the faculty do not exit as a part of the recessional but are \r\ndismissed, along with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "8",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present · at any convocation where the University, \r\nthrough its delegated members, is acting officially. At any official convocation \r\nsuch as commencement, the University Marshal, carrying the mace, precedes \r\nthe President into the assembly. The mace rests before the President's chair or \r\nspeaker's stand throughout the ceremony, and its removal from the assembly at. \r\nthe close of a convocation is symbolic of the official withdrawal of the \r\nUniversity and, thus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic \r\nclublike shape, however, is much more ·ancient, probably going back to man's \r\nprehistory. It is made of walnut wood and silver, with the seal of the University \r\nin gold and the University colors represented by insets of carnelian (orange) \r\nand amethyst {purple). Amethyst is also. the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the \r\noffice of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the whole \r\nbody of the institution. Clemson's chain and seal are made of silver and gold, \r\nand carnelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most \r\nacclaimed goldsmiths of our era. The enamel plaques for the batons were \r\nexecuted by the late Professor Marshall C. Bell, and the lapidary work was \r\nexecuted by the late Mr. C. C. Wilson ofr Clemson University. "
    },
    {
        "page_number": "9",
        "text": "CANDIDATES FOR THE DOCTOR'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nAnimal Physiology \r\nJennifer Therese Wyffels __________________________________ Annawan, IL \r\nB.S., Bradley University \r\nDissertation: Acute Radiation Exposure in the Cleamose Skate, Raja eglanteria: A Histological Study \r\nAdvisor: Dr. A. B. Bodine \r\nApplied Economics \r\nLouis Raymond Lanier ____________________________________ Lugoff, SC \r\nB.S., Clemson University \r\nDissertation: The Political Economy of Rent Sharing \r\nAdvisor: Dr. W.R. Dougan \r\nCrop and Soil Environmental Science \r\nHuseyin Caglar Karakaya ________________________________ Eskisehir, Turkey \r\nB.S.,. Anadolu University; M.S., Clemson University \r\nDissertation: Fasciation Mutation in Soybean: Molecular Mapping and Isolation of Phenotype Associated Genes \r\nAdvisor: Dr. H. T. Knap \r\nEnvironmental Toxicology \r\nGeorge Madison Huddleston III Greensburg, KY \r\nB.S., M.S., Eastern Kentucky University \r\nDissertation: A Constructed Wetland System Designed for Decreasing Concentrations and Bioavailability of Copper in Water \r\nAdvisor: Dr. J. H. Rodgers, Jr. \r\nFood Technology \r\nSu-il Park-------------------------------------- Chonbuk, Korea \r\nB.S., Korea University; M.S., Clemson University \r\nDissertation: Incorporation of Antimicrobial Agent into Food Packaging Films: AppJication and Effectiveness \r\nAdvisor: Dr. K. S. Marsh \r\nAtif Can Seydim ____________________________________ Ankara, Turkey \r\nB.S., M.S., Ankara University Faculty of Agficulture; M.S., Clemson University \r\nDissertation: Shelf-Life Evaluation of Ostrich Meat \r\nAdviso~: Dr. P. L Dawson \r\nZeynep Banu Seydim Ankara, Turkey \r\nB.S., Ankara University Faculty of Agriculture; M.S., Ankara University of Natural & Applied Sciences; M.S., Clemson \r\nUniversity \r\nDissertation: Studies of Fermentative, Microbiological and Biochemical Properties of Kefir and Kefir Grains \r\nAdvisor: Dr. A. K. Greene \r\nArunya Teerakam __________________________________ Songkhli, Thailand \r\nB.S., M.S., Chulalongkorn University \r\nDissertation: Diffusion of Nisin in Protein Packaging Films \r\nAdvisor: Dr. P. L. Dawson \r\nForest Resources \r\nRuiRong _______________________________________ Anhui,China \r\nM.S., University of Science & Technology of China \r\nDissertation: Double-stranded RNAs in the Dogwood Anthracnose Fungus, Discula destructiva Redlin \r\nAdvisor: Dr. F. H. Tainter \r\nGenetics \r\nJenith Cyril. ____________________________________ Tamil Nadu, India \r\nB.Sc., M.Sc., University of Madras \r\nDissertation: Biochemical and Molecular Analysis of Cold Acclimation in Bermuda grass and Seashore Paspalum \r\nAdvisor: Dr. W. V. Baird \r\nShuj ing Rao Clemson, SC \r\nB.S., M.S., Zhongshan University \r\nDissertation: Characterization of a Cypovirus with Eleven Segments of Double Stranded RNA Isolated from Cabbage Looper, \r\nTrichoplusia ni \r\nAdvisor: Dr. G. R. Carner "
    },
    {
        "page_number": "10",
        "text": "Microbiology \r\nGuorong Zhang -------------------------------------Tianjin, China \r\nB.S., Tianjin University; M.S., University of Manchester \r\nDissertation: A Noval Design of Targeted Endocrine and Cytokine Therapy for Breast Cancer \r\nAdvisor: Dr. W. Y. Ghen \r\nPlant Physiology Tharathom Boonkaew ________________________________ Bangkok, Thailand \r\nB.Sc., Chiangmai University; M.Sc., Chulalongkom University \r\nDissertation: In Vitro Culture of Gink20 biloba L. \r\nAdvisor: Dr. N. D. Camper \r\nJeanne Andrishok Briggs _____________________________ North Myrtle Beach, SC \r\nB.A., Coastal Carolina University; B.S., M.S., Clemson University \r\nDissertation: Pesticides Movement in Runoff Water at Container Plant Nurseries \r\nAdvisor: Dr. T. Whitwell \r\nZoology \r\nCharissa Dresden,Osbome ________________________________ Highland, IN \r\nB.S., Butler University \r\nDissertation: Effects of Fumonisins on Selected Murine Immune Responses and Infection with Trypanosoma cruzi \r\nAdvisor: Dr. G. P. Noblet \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nChemistry \r\nRitchie Curtis Eanes Ridgeway, VA \r\nB.S., Guilford College \r\nDissertation: Development of a Radio,frequency Glow Discharge Ion Trap Mass Spectrometer for Elemental Analysis and Ion, \r\nMolecule Applications \r\nAdvisor: Dr. K. N. Marcus \r\nMustafa Guzel ------------------------------------- Manisa, Turkey B.S., Hacettepe University; M.S., Clemson University \r\nDissertation: Asymmetric Catalytic Synthesis Using Arene Chromium Carbonyls \r\nAqvisor: Dr. G. B. Jones \r\nJason Eric Riggs----------------------------------- Lawrenceville, GA \r\nB.S., Berry College \r\nDissertation: Optical Limiting Properties of Fullerenes and Related Materials \r\nAdvisor: Dr. Y. P. Sun \r\nCivil Engineering \r\nVenkata Bharath Rayasam ________________________________ Hyderabad, India \r\nB.T., Jawaharlal Nehru Technical University \r\nDissertation: Study of Losses to Single Family Dwellings due to Hurricanes using Geographic Information System \r\nAdvisor: Dr. S. Amirkhanian \r\nYan Sun Shandong, China \r\nB.S., M.S., Tongji University ,) \r\nDissertation: Wind Loads of Hurricane Straps: The Role of Structural Influence Functions in Developing Net Loads on Roof \r\nConnections \r\nAdvisor: Dr. T. A. Reinhold \r\nElectrical Engineering \r\nZekeriya Tufekci ___________________________________ Osmaniye, Turkey \r\nB.S., Hacettepe University; M.S., Clemson University \r\nDissertation: Local Feature Extraction for Robust Speech Recognition in the Presence of Noise \r\nAdvisor: Dr. J. N. Gowdy \r\nEnvironmental Engineering and Science \r\nJames Edward Roane __________________________________ North Vernon, IN \r\nB.S., University of Evansville; B.S., M.A., Purdue University \r\nDissertation: Radionuclide Separation using Coupled Chromatographic and Scintillation Detection Techniques \r\nAdvisor: Dr. T. A. Devol "
    },
    {
        "page_number": "11",
        "text": "Industrial Engineering \r\nStacye Patterson Chen ------------------------------------Decatur, AL \r\nB.S., M.S., The University of Alabama; M.B.A., Brenau College \r\nDissertation: The Effects of Individual Differences and Training on Paced and Unpaced Inspection Tasks \r\nAdvisor: Dr. A. K. Gramopadhye \r\nXiaochun Jiang . \r\nB.S., East China Institute of Technology; M.S., Nanjing University of Science and Technology \r\nDissertation: Evaluation of Hybrid Inspection Systems Performance Assessment and Trust Measurement \r\nAdvisor: Dr. A. K. Gramopadhye \r\nNanjing, China \r\nApichat Sopadang _________________________________ Chiang Mai, Thailand \r\nB.S., Chiangmai University; M.S., Vanderbilt University \r\nDissertation: Synthesis of Product Family-Based Robust Design: Development and Analysis \r\nAdvisor: Dr. B. R. Cho .. / \r\nMaterials Science and Engineering lulian Gheorghe ___________________________________ Woodstock, GA \r\nM.S., University of Bucharest \r\nDissertation: In-Situ Formation of Fiber Reinforced lntermetallic Matrix Composites \r\nAdvisor: Dr. H.J. Rack \r\nRoy Townsend Littleton IV North Frog Level, VA \r\nB.S., Virginia Commonwealth University; M.S., Clemson University \r\nDissertation: An Investigation of Transition Metal Pentatellurides as a Potential Low-Temperature Thermoelectric Refrigeration \r\nMaterials \r\nAdvisor: Dr. T. M. Tritt \r\nMathematical Sciences \r\nRussell Dean Albright ________________________________ Grand Ledge, MI \r\nB.S., Grand Rapids Baptist College, M.S., Clemson University \r\nDissertation: Structure and Leaming in Graph-Theoretic Probability Models \r\nAdvisor: Dr. D. D. Warner \r\nMark Andrew Fitch ___________________________________ Pendleton, SC \r\nB.S., Bob Jones University; M.S., Clemson University \r\nDissertation: Slope Critical Configurations Generated from Regular Polygons \r\nAdvisor: Dr. R. E. Jamison \r\nMichael Dennis McGonagle ________________________________ Sandwich, MA \r\nB.S., Rose-Hulman Institute of Technology; M.S., Purdue University \r\nDissertation: A Hybrid Poisson Solver for Complex Geometries \r\nAdvisor: Dr. D. D. Warner \r\nThomas Harvey ·Whitaker _____ ---.. ___________________________ Forest City, NC \r\nB.S., Gardner-Webb College; M.S., Western Carolina University \r\nDissertation: Improved Methods for Numerical Shade Sorting in Apparel Manufacturing \r\nAdvisor: Dr. J.P. Jarvis \r\nMechanical Engineering \r\nStephane Maurice Morvan ______ __._, . _________________________ Courbevoie, France \r\nB.S., Ecole National Des Arts Et Metier; M.S., Clemson University \r\nDissertation: A Computer Aided Representation for Heterogeneous Components \r\nAdvisor: Dr. G. M. Fadel \r\nPhysics \r\nAshish Ojha.--------------------------------------- Lucknow, India \r\nB.S., M.s:, Clemson University \r\nDissertation: Quantitative Analysis of Single Cell Gel Electrophoresis \r\nAdvisor: Dr. L. L. Larcom \r\n.. "
    },
    {
        "page_number": "12",
        "text": "COLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction \r\nKelly Harrison Maguire ____________________________________ Roebuck, SC \r\nB.A., M.Ed.; Converse College \r\nDissertation: Building Envisionments in an After-School Enrichment Program for Girls \r\nAdvisor: Dr. B. N. Bailey \r\nEducational Leadership \r\nDeborah Campbell Hudson Gastonia, NC \r\nB.F.A., University of North Carolina-Charlotte; M.B.A., Winthrop University \r\nDissertation: Compensation Variables for Chief Financial Officers (CFO's) in the North Carolina Community \r\nAdvisor: Dr. J. L. Flanigan \r\nKevin Randall Rice Cary, NC \r\nB.A., North Carolina State University; M.H.R.D., Clemson University \r\nDissertation: The Analysis of Importance and Performance Toward Job Satisfaction of University Housing Professionals \r\nAdvisor: Dr. J. L Flanigan \r\nParks, Recreation, and Tourism Management \r\nGwynn Margaret Powell ____________________________________ Seneca, SC \r\nB.A., Mercer University \r\nDissertation: Perceptions of the Leaming Process in Seasonal Staff Training \r\nAdvisor: Dr. F. A. McGuire \r\nBarbara K. Williams Cumberland, MD \r\nB.S., University of Maryland-College Park; M.A., M.S., West Virginia University \r\nDissertation: Extraction of Primary Products from a Controlled Area: The Case of the Makuleke Community and the Kruger \r\nNational Park, South Africa \r\nAdvisor: Dr. G. W. Burnett \r\n• "
    },
    {
        "page_number": "13",
        "text": "CANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nBrandon N. Boozer __________ Newberry, SC Brenda T. Wright ____________ Greer, SC \r\nBeverly Morgan McClanahan Columbia, SC \r\nMASTER OF FOREST RESOURCES \r\nJames Paschal Marshall ________ Columbia, SC Loyd David Weston __________ Columbia, SC \r\nHarry Strohecker Morrison IV Estill, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nOskar Emilio Arocha ____ Santiago, Dominican Republic Frank Finucan Limehouse IV ------- Beaufort, SC \r\nSean Patrick Blacklocke Charleston, SC \r\nAnimal and Food Industries \r\nMichael Patrick Daly Alpharetta, GA \r\nAnimal Physiology \r\nJennifer Ann Wrona Henderson Bentonville, AK \r\nAquaculture, Fisheries, and Wildlife Biology \r\nJonathan Andrew Batson --------Pickens, SC Christopher Robert Mueller _______ Gardiner, NY \r\nJoseph Roy Cant~ell Piedmont, SC Jason Wayne Peeples Varnville, SC \r\nTucker A. Jones Condon, OR Jason Jeremy Schaffler Tahlequah, OK \r\nCrop and Soil Environmental Science \r\nGarland Michael Veasey Clover, SC \r\nEnvironmental Toxicology \r\nBrandon Michael Beck __________ Belleair, FL Adam Cory Ryan __________ Shortsville, NY \r\nChristine Anne Cline Salt Lake City, UT Eric John Van Genderen San Diego, CA \r\nForest Resources \r\nWilliam Steven Busbee ________ Greenville, SC Lisa Edna Ellis -----------Columbia, SC \r\nRoderick DeWayne Cooper Seneca, SC Louwanda W. Jolley Clemson, SC \r\nGenetics \r\nBenjamin Matthew Levy _________ Greer, SC \r\nMicrobiology \r\nJohn Grady Abercrombie -------- Pickens, SC Ryan Smith Westberry --------- Florence, SC \r\nMargaret Norvell Kennedy Chapel Hill, NC \r\nPlant and Environmental Sciences \r\nGretchen Lyn Jameson __________ Boone, IA Terri Lynn Van Zant __________ Zionsville, IN \r\nPlant Pathology \r\nChristian Bernard Dellis _______ Rocky Mount, VA Jeremy Lloyd McCracken ______ Galivants Ferry, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nMASTER OF ARCHITECTURE \r\nRui Bai ______________ Beijing, China Shae Suzanne Hensley __________ Odessa, TX \r\nEugene Murdaugh Bell Beech Island, SC Jennifer Gayle Hurst Union, SC \r\nBradley Kyle Brown Conyers, GA Anna Starr Kellett Fountain Inn, SC \r\nAnthony Joseph Carmola Oneida, NY William Terry Kirby, Jr. Spartanburg, SC \r\nAndrew Matthew Clark Baton Rouge, LA Mark Christopher Palmer Clio, SC \r\nAmy P. Clement Vidalia, GA Kevin Speir Purvis Kingsport, TN \r\nTimothy Michael Dotson Medina, OH Paul Lawrence Rosen North Miami Beach, FL \r\nWilliam David Drennan Richburg, SC Bryan Kenneth Schroeder Wayne, NJ \r\nMaurie Rae Duderstadt Fredericksburg, TX James Russell Stein Melbourne Beach, FL \r\nRudi Danny Elert Greenwich, CT Thomas Cullen Sweeney Arnold, MD \r\nKelly Anne Gordon Charleston, SC William Kenyatta Turner Winston,Salem, NC "
    },
    {
        "page_number": "14",
        "text": "MASTER OF CITY AND REGIONAL PLANNING \r\nJeffrey James Burns ___________ Lockport, NY Jana Colleen McMakin _________ Greenville, SC \r\nDiana Allen Eldridge Greenville, SC Mary Lucille Noth Asheville, NC \r\nLonnie Benjamin Ellisor Spartanburg, SC Jason Matth~w Peek Greenville, SC \r\nSusan Lenoir Fisher Charlotte, NC Scott Walton Philips Winter Park, FL \r\nAbigail Ruth Kinnison San Antonio, TX Suzanne Michelle Sears Covington, KY \r\nMargaret Steele Marshall Norfolk, VA Jennifer Leigh Vissage Greenville, SC \r\nJoshua Lange Martin Hilton Head Island, SC Jason Michael Whinghter Beech Island, SC \r\nMASTER OF FINE ARTS \r\nJason Boyd Blalock __________ Kennesaw, GA Janet Thomas Orselli __________ Columbia, SC \r\nChristie Denise Dockery Murphy, NC Paula Jolene Swisher Clemson, SC \r\nMASTER OF ARTS \r\nEnglish \r\nJohn Michael DeWorken _______ Greenville, SC Jeffrey Patrick McQuillen _________ Selden, NY \r\nNicole Trista Guttermuth Miami, FL Christa Erin Stewart Frisco, TX \r\nAndrew Lake Jameson Clemson, SC Cathy Lynn Whaley Johnson City, TN \r\nHistory \r\nSusan Sumerau Corley _______ North Augusta, SC Anne Pryor McMahan __________ Seneca, SC \r\nCarole Louise Ryan Hasson Levittown Bucks, PA Alison Lee Ollinger,Riefstahl North East, PA \r\nTodd Edward Hull Hagerstown, MD Christopher Joseph Osbourn Nashville, TN \r\nKevin Michael Kerr Pembroke Pines, FL \r\nProfessional Communication \r\nJulie Danielle Eason Campbell _____ Murrell's Inlet, SC Joseph Duane Hooper ---------- Taylors, SC \r\nMeredith Elizabeth Chandler Greenville, SC Birmagidra Marie Gainor Parrott Sumter, SC \r\nStephanie Jean Haney Charlotte, NC Melissa Lauren Tidwell Charleston, SC \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nMASTER OF BUSINESS ADMINISTRATION \r\nAmy Lauren Adams ___________ Seneca, SC Marvin Michael Kerl Taylors, SC \r\nDmitriy Afanasenko Almaty, Kazakstan Thomas Kjellberg Greenville, SC \r\nChad Martin Armstrong Laurens, SC James William Liddle Easley, SC \r\nJason McDavid Ballew Greenville, SC Guojie Liu Beijing, China \r\nStephen Ashley Barrett Greenville, SC Mark Allen Lovelace Greenville, MA \r\nMelanie Reichard Bennett Irmo, SC Glenn Allan Luetkemeier West Lafayette, IN \r\nWalter Roger Bennett III Cooperstown, NY Leigh Ruddock Martin Greenwood, SC \r\nLaura Cristina Bravo San Jose, Costa Rica William Ghad McAllister Powdersville, SC \r\nReginald J evon Carpenter Spartanburg, SC Michael Kevin Mcloughlin North Potomac, MD \r\nJamie Lynn Cash Chattanooga, TN Bradley Robert Miller Grand Rapids, MI \r\nFrederick Santos Castaneda Atlanta, GA Kelly Marie Phillips Mistreanu Barnwell, SC \r\nCarl Eugene Chivers Perryopolis, PA Matthias Reinhard Wilhelm Mutzke _ Heidelberg, Germany \r\nKimberly Ann Comprini Greenville, SC Preslava Kirilova Nenova Varna, Bulgaria \r\nStacey M. Cruz Saratoga Springs, NY Teresa Charlene Owens Duncan, SC \r\nJessica Rae Dean South Charleston, WY Michael G. Philipp Aiken, SC \r\nAndrew Jacob Everhart Bristol, VA Bryant James Reeves III Boiling Springs, SC \r\nMark Joel Ewell Greer, SC Brian Patrick Rivers Detroit, MI \r\nMelissa Ann Ferguson Charlotte, NC Michael Alan Runge Columbia, SC \r\nRachel Ardith Fitzpatrick Greenwood, SC Joseph Duane Sangl Shelbyville, IN \r\nMark Christopher Fritz West Bloomfield, MI Dean Scott Singley Fairfax Station, VA \r\nBenjamin O'Neal Fulmer North Augusta, SC Shaun Edward Tooke Lawton, OK \r\nDiana Marie Gentile Greenville, SC Dennis Douglas Trout Chesnee, SC \r\nYuyu Gong Xinjiang, China Alan Lee Ward Flat Rock, NC \r\nHope Elizabeth Grant Hall Greenville, SC Kurt Lee Wick Richmond, VA \r\nPaul Dillon Helton Naples, FL William Matthew Wisenbaker Germantown, MD \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nLauren Ashley Allen -------- Columbia, SC Kristie /Michelle Nieves _________ Anderson, SC \r\nJamie Lin Brown ___________ Anderson, SC Magda Vandermeer O'Dell Greenville, SC \r\nKeith Allen Gray Anderson, SC Melissa Michelle Stewart Hanahan, SC \r\nHong Gu Yixing City, China Jeremy S. Weaver Calhoun Falls, SC \r\nJessica Frances Hoffman Newburgh, NY Shawn Alexander Wienke Anderson, SC \r\nVincent Paul Huygen Fountain Inn, SC \r\nMASTER OF PUBLIC ADMINISTRATION \r\n(Master of Public Administration is jointly administered by \r\nClemson University and the University of South Carolina.) \r\nElliot Farrell Bischoff _______ Webster Groves, MO Hannah Elizabeth Parker ________ Greenville. SC \r\nKerry Lynne Leonard Greenville, SC Benton Eugene Waller Easley, SC "
    },
    {
        "page_number": "15",
        "text": "MASTER OF ARTS \r\nEconomics \r\nFrank David Cureton _________ Greenville, SC Charles Steven Reback -------- Spartanburg, SC \r\nSean Eric Mulholland Anderson, SC \r\nMASTER OF SCIENCE \r\nApplied Psychology \r\nJohnell 0. Brooks. ___________ Pickens, SC Theodore B. Pasquale --------Jamestown, NY \r\nMichael Joseph Garrity Madison, NC Tracey Lee Shilobod Latrobe, PA \r\nMarianne Liptak Garfield Heights, OH Julie Winchester Workman Tallahassee, FL \r\nRebecca Marie Morley Miamisburg, OH \r\nApplied Sociology \r\nAllison Carole Britt _________ Loganville, GA Stacey Ann Willocks _________ Longwood, FL \r\nGraphic Communications \r\nGareth MacGregor Burns _____ Stone Mountain, GA Benjamin Carter Cook ---------Augusta, GA \r\nIndustrial Management \r\nSriram Aravamudhan __________ Madras, India Kevin Michael McKenzie _______ Summerville, SC \r\nWilliam Duncan Bradshaw, Jr. Chapin, SC Sathish Neelakantan Clemson, SC \r\nMichael A. Brown Cleveland, TN Jabbar Ali Stackston Gastonia, NC \r\nShalil J. Fernandes Bombay, India Venkatachalam Subbiah Chennai, India \r\nChia S. Lin Taipei, Taiwan \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nMechanical Engineering \r\nTodd Alan McKee __________ Kingsport, TN \r\nMASTER OF SCIENCE \r\nBioengineering \r\nMichael Lawrence Cartner-------- Fort Mill, SC Jonathan Byrnes McGlohorn _______ Pomaria, SC \r\nJoshua James Lovekamp Augusta, GA Michael Jacob Merves Fairfield, OH \r\nCeramic and Materials Engineering \r\nDavid Mesa. ___________ Medellin, Colombia Jason Peter Street. ___________ Six Mile, SC \r\nChemical Engineering \r\nKatherine Ever Harrison--------- Gastonia, NC \r\nChemistry \r\nErik Jevon Nelson ___________ Hazel Crest, IL \r\nCivil Engineering \r\nChristopher Shannon Farmer ______ Tuscaloosa, AL Rob Andrew Matthews III ____ Hilton Head Island, SC \r\nMichael Hoyt Hamilton Chapin, SC Michael Travis McKinney Hodges, SC \r\nJennifer DePercin Harter Columbia, SC David Carson Pelfrey Easley, SC \r\nOliver Himbert Puttlingen, Germany John Michael Waters Iva, SC \r\nXin Jin Beijing, China Samuel Thomas Watson Piedmont, SC \r\nComputer Engineering \r\nAnkur Bhargava ____________ Clemson, SC Kalyan Chakravarthy Nidumolu _____ Narsapur, India \r\nSrinivas Challa Clemson, SC Himanshu R. Sanghavi Mumbai, India \r\nNathan Andrew DeBardeleben Richmond, VA Kunal Harendra Shah Bombay, India \r\nKapil Kumar Jain Hyderabad, India Anand C. Varadharajan Madras, India \r\nRavikanth Konda Hyderabad, India \r\nComputer Science \r\nKartik D. Agarwal __________ Mumbai, India Milind Madhukar Koli _________ Clemson, SC \r\nJeremy Travis Barron Rock Hill, SC Scott Allan Linde Orlando, FL \r\nJohn Frank Bubba, Jr. Bunnell, FL John Crispe Lunn IV Baton Rouge, LA \r\nBrian Scott Corbin Clifton, SC Hemanth Mikkilineni Vizag, India \r\nEthan Allen Davies Clemson, SC Veeravenkata Seela Nagapraveen Rajahmundry, India \r\nAditya Abhay Desai Pune, India Hosahalli Nanjappa Narendra Bangalore, India \r\nLili Ding Hangzhou, China Aravind Naik Nunsavathu Guntur, India \r\nLaxmikanth Reddy Dubbudu Warangal, India Sourabh Pandit Indore, India \r\nFriedrich Wilhelm Engler Due West, SC Saurabh Manohar Pathak Pune, India \r\nKavita Harakchand Gada Bombay, India Mahesh V. Patil Mumbai, India \r\nMandar Vidyadhar Gokhale Mumbai, India Vijaya K. Poliboyina Andhra Pradesh, India \r\nMatthew Allen Hanna Conway, SC Kanchana Sethu Bombay, India \r\nRaghuraman Jaganaathan Bombay, India Heena Prakash Sharma Mumbai, India \r\nVinay Krishna Kaza Hyderabad, India Kumar C. Shunmugavelayutham Ilanji, India \r\nSwapneel Ajit Kekre Mumbai, India Brian Peter Sorge Cedarbrook, NJ "
    },
    {
        "page_number": "16",
        "text": "Computer Science (continued) _ \r\nKrishnan Sridhar ___________ Chennai, India Andrew Chapman Vann ______ Winston-Salem, NC \r\nPawan R. K. Sunkesula Hyderabad, India Barathram Vasudevan Madras, India \r\nThomas James Tidwell Jacksonville, FL Tilak Yalamanchili Vijayawada, India \r\nSuresh Vadhanam Hyderabad, India \r\nElectrical Engineering \r\nYang An _____________ Shaanxi, China Dennis Moses ____________ Clemson, SC \r\nJin Fu Tianjin, China Muralikumar A. Padaparambil Coimbatore, India \r\nKiran S. Jayanthi Vizag, India James Lesley Peacock Alma, GA \r\nRamakrishna Karamsetty Vijayawada, India Anupama Seshadri Kalpakkam, India \r\nRajesh Krishna Reddy Kovvuri Bangalore, India Charles Brandon Snyder Greenwood, SC \r\nHarish Vengareddy Kutagulla Hyderabad, India Venkatasubramanian Swaminathan Chennai, India \r\nKanchan Mangrulkar Hyderabad, India Amar Mallikh Vellanki Nellore, India \r\nJabberia Rico Miller Rock Hill, SC Raghavan Venugopal Mumbai, India \r\nEngineering Mechanics \r\nDerek Paul Columbus _________ Damascus, MD Richard Brian Mock _________ Charleston, SC \r\nEnvironmental Engineering and Science \r\nStacey Lynn Fox ___________ Broomall, PA Brian Anthony Powell _________ __.Mobile, AL \r\nMegan Amy Goddard Aptos, CA Chapman Millard Ross Conyers, GA \r\nChristopher Jon Grossman Lawrencebµrg, IN Darren J. Steinhilber Hatboro, PA \r\nRichard Ryan Haddock Kingstree, SC Meghna Harish Swamy Bangalo~e, India \r\nJay Scott Hoskins Jefferson City, MO Thomas Scott Swartout Columbia, SC \r\nJonathan Patrick Hunt Florence, SC Daniel Trammel Seminole, FL \r\nKirsten Elizabeth Melsheimer Seneca, SC \r\nHydrogeology \r\nRobert Alan Bridges ___________ Decatur, IL Panagiota Vasi Passinos ______ West Palm Beach, FL \r\nAllison Elizabeth Corbin Hanahan, SC Crystal Ann Mattox Taylor Fort Mill, SC \r\nSusan Elizabeth Kelly Mt Pleasant, SC Cameron Mace Warlick Charlotte, NC \r\nIndustrial Engineering \r\nAmit Dinesh Bhalerao __________ Pune, India Reena B. Master ____________ Clemson, SC \r\nRamashekhar Cherukumilli Bangalore, India Vinay Mehendiratta New Delhi, India \r\nAshok Darisipudi Clemson, SC Garett Robert Rozek Waukesha, WI \r\nHarnish Narendra Goradia Mumbai, India Rajeev Madhukar Sahasrabudhe Bombay, India \r\nJuneedasif Iqbal Hussain Bombay, India Saptagiridhara Rao Tangudu Clemson, SC \r\nNikhil Sampatkumar Iyengar Mumbai, India Satya B. Vallepalli Hyderabad, India \r\nKunal Kapoor Jamshedpur, India Jeenal Vora Hyderabad, India \r\nPrabhu Krishnadas Madras, India Kesava R. Yalavarti Guntur, India \r\nVishwanath Krishnamoorthy Mumbai, India \r\nMaterials Science and Engineering \r\nCharu Brij Chhibber ___________ Pune, India Krishna Kumar Kharia ________ Jamshedpur, India \r\nAditee Sadgopal Date Pune, India Neelesh Suresh Kunte Pune, India \r\nSunil A. lnamdar Pune, India Neetal Balkrishna Timble Bombay, India \r\nShashank Gulabchand Kasliwal Solapur, India \r\nMathematical Sciences \r\nNicole Alaine Bannister ________ Anderson, SC Toshinori Okuyama ___________ Mie, Japan \r\nNatalie Smail Lochner North Huntingdon, PA John Paul Roop Fries, VA \r\nAdam James Lynn South Tewksbury, MA Alicia LaShawn Teal Baltimore, MD \r\nMechanical Engineering \r\nMary Virginia Armfield ________ Cullowhee, NC Zeyu Liu-------------'--Beijing, China \r\nSurya Prakash Batchu Hyderabad, India James Blakeley Long Boone, NC \r\nTiffany Arnitta Camp Charlotte, NC N irav Mahendrakumar Mehta Mumbai, India \r\nRyan Brandon Conatser Aiken, SC Ian Paradis Greenville, SC \r\nCharles Pinson Cooper Laurens, SC Murali Saminathan Coimbatore, India \r\nChaiwat Foongkiatchai Bangkok, Thailand George G. Scarlat Bucharest, Romania \r\nGuandong Jiao Shanghai, China Roger Wayne Schwandner Redwood, NY \r\nSuman Konda Visakhapatnam, India Todd Alan Schweisinger Huntington Beach, CA \r\nHenri Kowalczyk Miami, FL Kishore Krishna Varanasi Hyderabad, India \r\nHaipeng Li Beijing, China Yan Zou Sichuan, China \r\nPhysics \r\nGeorge Calhoun Jordan IV _______ Greenwood, SC David Alan Weston ___________ Taylors, SC \r\nGary Austin Lamberton, Jr. Burnt Hills, NY Donny Wayne Winkler Seneca, SC \r\nDale L. Theiling, Jr. Charleston, SC \r\nTextiles, Fiber and Polymer Science \r\nHui Xu -------------- Nanjing, China "
    },
    {
        "page_number": "17",
        "text": "COLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\nJanice Lynne Reiselt Homer, GA \r\nMASTER OF HEAL TH ADMINISTRATION \r\n(Master of Health Administration is jointly administered by \r\nClemson University and the Medical University of South Carolina.) \r\nKelly D. McCormick -------- Spartanburg, SC Richard Edwin McManemon -------Taylors, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nCurt David Bosson _______ Hilton Head Island, SC Meng-lun Lai __________ Taichung, Taiwan \r\nMelanie Jean Brusco Hollywood, FL Kristin Caroline Long Mauldin, SC \r\nHorace Butler, Jr. Greenville, SC Robert Sprague Mann . Chapel Hill, NC \r\nPamela Groomes Cobb Seneca, SC Elizabeth Anne Penny Rock Hill, SC \r\nRobin Lynn Codega Chatham, MA Corey Taylor Reedy Camden, SC \r\nLea Marie Cox Seneca, SC Starrin Renee Shafer North Tonawanda, NY \r\nNatalie Michele Cropp Andrews, SC Janeen Marie Smith Grafton, MA \r\nStephanie Ann Ellison Pendleton, SC Daniel Paris Stratford Camden, SC \r\nMitchell Lee Eyster Columbus, OH Olga Merissa Sutherland Belton, SC \r\nTiffany Dawn Gary ·New Iberia, LA Bridget Kathleen T ennity Kennett Square, PA \r\nWesley Floyd Grant Anderson, SC \r\nMASTER OF INDUSTRIAL EDUCATION \r\nMartha Ford Brooks __________ Pickens, SC Donald Wayne Quillen--------- Taylors, SC \r\nJohn Thomas Clemens Clemson, SC Amy Grace Roberts Charleston, SC \r\nHubert Chamblee McClure Anderson, SC \r\nMASTER OF PARKS, RECREATION, AND TOURISM MANAGEMENT \r\nSharon Elizabeth Brown ________ Charlotte, NC Ning Ou ____________ Tangshan, China \r\nKelly Denise Lasher Weaverville, NC David Leander Suter Murrell's Inlet, SC \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nLori Lynn Brownlee-Brewton ______ Abbeville, SC Evie Griffith Hughes __________ Walhalla, SC \r\nJohn Michael Frady Walhalla, SC Jennifer Maria Odom Pamplico, SC \r\nGerald Glen Gates Anderson, SC C. Lance Radford Anderson, SC \r\nLisa Coggins H-aynes Elberton, GA \r\nCounseling and Guidance Services \r\nKaren Martin Abell __________ Laurens, SC Jane Cannada Massey _________ Pendleton, SC \r\nJessica Peebles Allender Duncan, SC Trude Lynn Molin Seneca, SC \r\nYutasha C. Ballenger Greer, SC Melanie Rish Mustin Piedmont, SC \r\nLinda Lee Berry Anderson, SC Andrea Davis Parsons Chappells, SC \r\nOdessa Rose Cameron Knoxville, TN Sabrina Diane Pinion Seneca, SC \r\nCynthia Ann Coker Simpsonville, SC Tanya Spires Richbourg Anderson, SC \r\nJames K. Cothran, Jr. Clemson, SC Tammy Vassar Rivera Greenville, SC \r\nEstelle Craig Taylors, SC Jacqueline Marie Rosa Central, SC \r\nDaniel Paul Cutler Prairie du Sac, WI Rebekah Warner Ross Powdersville, SC \r\nAngela Bragg Farmer Easley, SC Robert Chad Seaborn Easley, SC \r\nMonica Ross Finley Easley, SC Angela Wade Simpson Charlotte, NC \r\nDeonne Delores Giles Anderson, SC Sandra Rivers Strickland Anderson, SC \r\nElizabeth Lane Hayden Columbia, SC Jennifer Lynn Stublick Little River, SC \r\nLeslie Jean Hogan Marion, SC Sheridan Vail Thompson Central, SC \r\nKatie W. Holcombe Seneca, SC Donna Gray Tingle Clemson, SC \r\nMichelle Antonia Jackson Greenville, SC Amanda Laverne Verner Westminster, SC \r\nJoycelyn La Tosha Jeffcoat Swansea, SC Lisa Marie Cann Wardlaw Williamston, SC \r\nJessica Marie Kohler Seneca, SC Melissa Joye Williams Hinsdale, NY \r\nReading \r\nLisa Claybourne Ethington _______ Anderson, SC \r\nSpecial Education \r\nChristine Victoria Franz _______ Hanover Park, IL Angela Rae Martin ---------- Seneca, SC \r\nAhnna Stancil Gibson Norris, SC Courtney Michelle McBride Greenville, SC "
    },
    {
        "page_number": "18",
        "text": "• \r\nMASTER OF SCIENCE \r\nNursing \r\nKathy Hamlin Betsill _________ Anderson, SC Sandra Yvonne Roock_· _______ Spartanburg, SC \r\nBeth Ann Bigham Mauldin, SC Stephen Thomas Small Westminster, SC \r\nStacey Green Branyon Honea Path, SC Nandel Hiott Smith Anderson, SC \r\nJane Biederman Haertlein Greer, SC Valerie B. Snyder Easley, SC \r\nSuelane Yvonne Hannah Greer, SC Terrill Marsh Spivey Easley, SC \r\nSandra L. Masur Jacobs Anderson, SC MaLee Smith Thompson Rock Hill, SC \r\nFreda Hill Kelley Anderson, SC Vanessa Thompson Spartanburg, SC \r\nKristina Entrekin Kinard Greenville, SC Jennifer Cooper Walker Taylors, SC \r\nSusanne Marklin Spartanburg, SC DianaLee Waterman Auburn, ME \r\nRachel Haggard Montjoy Greenville, SC June Elizabeth Weir Simpsonville, SC \r\nCasey Annette Lowe Norris Anderson, SC Gayla Renee Wilson Anderson, SC \r\nJohn Cenarosa Paguntalan Greenwood, SC Lawrence Robert Wood Ill Lancaster, SC \r\nJulie Hedden Perry Central, SC Buffy Wooten York Lavonia, GA \r\nDennis Alfred Reiche Six Mile, SC \r\nParks, Recreation, and Tourism Management \r\nDaniel Joseph Dodd _________ Mt Pleasant, PA Katrina Marjorie Krause _______ Washington, DC \r\nMark Christopher Jewell Lynchburg, VA \r\nGRADUATE SCHOOL \r\nMASTER OF FINE ARTS IN COMPUTING \r\nJames Richard Soukup _______ Myrtle Beach, SC David Alden Wentworth --------Clemson, SC "
    },
    {
        "page_number": "19",
        "text": "CANDIDATES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nWILLIAM BUSSE WEHRENBERG, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\nWilliam David Brown, Jr. _______ Simpsonville, SC *Kevin Michael Kubach _______ Alpharetta, GA \r\nKelly Elizabeth Cullen Chester Springs, PA Lisa Christine Vickers Exton, PA \r\n***Elizabeth Katherine Harris Fredericksburg, VA \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\n+*Claudius Hugh Crawford III _______ Bartow, FL Keith Alan Norris----------- Dillon, SC \r\nJustin Morgan Hamilton Belle Glade, FL Christopher Monts Rauch Lexington, SC \r\nJonathan Joel Keisler Lexington, SC Amanda Margaret Ruth Robesonia, PA \r\nThomas Edward Kemp III Turbeville, SC Kevin Brock White Ridge Spring, SC \r\nAgricultural Education \r\nGeorge Rembert Beasley, Jr.------ Bishopville, SC **Teresa Lynch Ford __________ Pickens, SC \r\n*Charles Frederick Bland Chester, SC Rebecca Ann Nance McConnells, SC \r\nCarrie Ana Covington McConnells, SC Ashli Robin Young Kershaw, SC \r\nJessica Renee Crank Mansfield, OH \r\nAgricultural Mechanization and Business \r\nChristopher Mark Henkel ________ Gilbert, AZ Joshua David Poston --------Johnsonville, SC \r\nJason Eugene Morse Sumter, SC \r\nAnimal and Veterinary Sciences \r\nJennifer Nichole Albertson _______ Walhalla, SC Brian M. Lardiere _________ Sparrow Bush, NY \r\nJeffery Thomas Alt Richburg, SC Mary Beaudrot Mauldin Greenwood, SC \r\n*Dolly Louise Arnette Dillon, SC Susan Elizabeth Nunes Greenville, SC \r\nJessica Alan Bell Anderson, SC Patrick Belton O'Dell, Jr. Belton, SC \r\nTracey Dawn Brown Greenville, SC Kelly Elizabeth Paddock Columbia, SC \r\nAndrew Ross Dinkins Sumter, SC **Nathan Edward Phillips Piedmont, SC \r\nJonathen Tyler Doran Johnston, SC Melissa Bourne Privette Rock Hill, SC \r\nMatthew Thomas Goslee Columbia, SC *Jennifer Lynn Rector Anderson, SC \r\n**Ashley Mills Harper Greenville, SC Suzanne Michelle Robinson Columbia, SC \r\nSharon McCormick Hart Gr.eenville, SC *Laura Elizabeth Sessions Charleston, SC \r\nLeslie Marie Henderson Chesnee, SC *Marian Rebecca Shuler Mt Pleasant, SC \r\n**Rachel Kathleen Hohmann Johnsonville, SC Vanessa Lynn Smith Greene, NY \r\n***Anna Cannon Holder Pickens, SC Sara Elizabeth Stout Greer, SC \r\nCynthia LeAnne Hollis Lexington, SC Halicine Janel Van Brink Atlanta, GA \r\n**Angela Marie Houwing Sumter, SC Jason Randall Wendt Westminster, SC \r\nTeri L. Jager Lilburn, GA Elizabeth Caroline Wilkins Winnsboro, SC \r\nAnna Kay Jenkins Clemson, SC **Kelly Waynette Yongue Gaston, SC \r\n+**Erin Ann Kelly Poland, OH \r\nAquaculture, Fisheries, and Wildlife Biology \r\nEbbie James Atkinson III ________ Charleston, SC Faren Wolter McCord ________ Gordonsville, VA \r\nSteven Botelho Providence, RI *Emily Kathleen Parnell Florence, SC \r\nVirginia Katherine Bruce Camden, SC Keys Smith Phinney St George, SC \r\nMichelle Renee Buckner Gainesville, FL Derek Matthew Ross Miami, FL \r\n*Bradley Michael Harmon Aiken, SC Charles William Rush III Greenwood, SC \r\nTakako Hashimoto Ora~geburg, SC Jeremy Michael Sanders Charleston, SC \r\nBrandon Michael Hoffman Swansea, SC \r\nBiochemistry \r\nChristopher Todd Coey ________ Lexington, OH Thomas J. Ormsbee------ Hilton Head Island, SC \r\nKristi Marie Collura Fort Mill, SC *Elizabeth Alexandrianne Pellegrino Charleston, SC \r\n+***Heidi Marie Cooper Clemson, SC *Jacob Wesley Phillips West Union, SC \r\nBrandon J. Cummins Charleston, IL ***Gina Lynette Pries Greenville, SC \r\n+*Nahal Suzanne Jamir North Augusta, SC Colleen Patrice Riley West Caldwell, NJ \r\nShahed Lewis Pickens, SC \r\nBiological Sciences \r\n*Benjamin Jerome Askins _______ Johnsonville, SC Luis Thormer Chastain ______ _ _ Honea Path, SC \r\nAsha Lenora Bailey Hartsville, SC *Katherine Elizabeth Clark Fort Mill, SC \r\nWilliam Henry Ballinger III Greenville, SC *Allison Anne Davis Batesburg, SC \r\nPatrick Edward Bise Summerville, SC **Travis Wayne Davis Summerville, SC \r\n+***Jonathan Gregory Black Lexington, SC Mary Nicole Eckel Florence, NJ \r\nYolanda LaRose Bodrick Cameron, SC ***Ashley Love Farr Augusta, GA \r\nLehabim Jermaine Burnside Greenville, SC *Ashley Donovan Gilbert Greenville, SC \r\nMichelle Marie Cardetti Longwood, FL Kylie Ann Hordych North East, PA \r\nj \r\nl "
    },
    {
        "page_number": "20",
        "text": "Biological Sciences (continued) \r\nStephanie Querida,Quinn Hoyes ____ Elon College, NC Jeanna Markese Shumpert. _________ Taylors, SC \r\nJill Marie Hudgens Simpsonville, SC +***Christine Marion Smith Deltona, FL \r\nElizabeth Jean Johnston Greenville, SC **Robert Michael Steadham II Pickens, SC \r\nMelissa Ann Justice Townville, SC **James Porter Stokes Ill Anderson, SC \r\n*Douglas Gordon Leney Marlton, NJ Joseph Paul Thames Horatio, SC \r\nMichael Joseph Malinsky Hammonton, NJ Ashley Marie Tilghman Leesburg, VA \r\nCheryl Ann Matasovsky Waldorf, MD Matthew David Trzaskus Louisville, KY \r\nKatherine Marfie Murphy Springfield, VA Gregory Ross Weathers Greenville, SC \r\nChristina Ann Naughton Greenville, SC Matthew Clayton Webber Chattanooga, TN \r\n**Tenley Erin Palisin Pawley's Island, SC ***Faith Elizabeth Wiley Chester, SC \r\nMelissa Michelle Redlinger Pittsburgh, PA **Rebecca Gloryann Winsor Kingsport, TN \r\n*Eric Scott Riesenfeld Reisterstown, MD ***Eugenia Darrington Wooten Clemson, SC \r\nSusanna Marie Ringler Aiken, SC *David Everett Yoder Mauldin, SC \r\nChristopher C. Sherod Anderson, SC **Jennifer Ann Zeitler Elkhart, IN \r\nCrop and Soil Environmental Science \r\n+*Margaret Eleanor Bussey ______ Summerville, SC *Kathryn Renee McAninch ------ Spartanburg, SC \r\nJoshua Ryan Massey Pendleton, SC Robert William Weathers Branchville, SC \r\nEntomology \r\nJames Randall Adkins--------- Clemson, SC \r\nFood Science \r\nLauren Michelle Ackerman -------- Suffern, NY Kashauna Yolande Guinyard ______ Orange burg, SC \r\n*Valerie Anne Bush Kingsport, TN **Theresa Marie Hedrick Columbia, SC \r\nHoliday A. Durham Landrum, SC Jillian Elizabeth Johnson Summerville, SC \r\nAndrew Walter Geskie Wading River, NY *Elizabeth Hart Smith Florence, SC \r\nKerry Elizabeth Gibson Lawrenceville, GA \r\nForest Resource Management \r\nDarren Clark Atkins --------- Abbeville, SC Rodney Blake McNeace ---------Union, SC \r\nGlen Michael Bentley Moncks Corner, SC James McCutchen Moody Dillon, SC \r\nMatthew Hunter Caldwell Little Mountain, SC Stephen William Pohlman, Jr. Ware Shoals, SC \r\nDavid Michael Davis Pickens, SC · Thomas Austin Powell Hanahan, SC \r\nKevin Brock Farmer Fountain Inn, SC Rufus Joe Redfearn III Camden, SC \r\nDavid Zachariah Foster Inman, SC Irvin Clayton Ridgeway Ill Charleston, SC \r\nKristofer Lynwood Hardwick Cheraw, SC Andrew Thomas Smith Anderson, SC \r\nRobert Moore Harris Hartsville, SC James Clayton Taylor Marion, SC \r\nJames Lynwood Hodges, Jr. Beaufort, SC Nathan Dean Timms Anderson, SC \r\nJoseph Thomas Johnson Ill Aiken, SC Andrew Russell Walden Ill Spartanburg, SC \r\nDavid Lane Lee Ill Sumter, SC Joshua Duvall Whittington Florence, SC \r\nDevon James McCaskill Lancaster, SC \r\nHorticulture \r\nJohn David Allison ---------- Columbia, SC Adrienne Janel LaBranche --------Coventry, RI \r\nPreston Adam Charles Clinton, SC Jason Ray McCroskey Greenville, SC \r\nMarion Epps DuBose IV Manning, SC Matthew Leroy Money Asheville, NC \r\nJodie Franks Greer Anderson, SC Ryan Asher Okey Weirton, WV \r\nTimothy Allen Johnson Easley, SC Brian Martin Weisman Seneca, SC \r\nMicrobiology \r\nRay Euyeen Ahn ----------- Fair Play, SC Darrell Edward Jones __________ Knoxville, TN \r\nSean Thomas Arledge Easley, SC lrfan Aiyub Khan Spartanburg, SC \r\n*Leigh Bra Clinton, SC +*Kimberly Gale Kinard Columbia, SC \r\n**John William Branch Kingsport, TN Nassim Lewis Pickens, SC \r\n+*Virginia Barrett Browning Florence, SC **Amanda Marie Mathis Bishopville, SC \r\n*Paula Amber Davidson Woodruff, SC Katie Suzanne McGinnis Ninety Six, SC \r\n+***Eowyn May Davies Conway, SC *Melanie Elaine Parker Clemson, SC \r\nMatthew Foreman Ellis North Augusta, SC Angela Marie Pelletier Florence, SC \r\n*Meredith Claire Guy Dacula, GA +**Lindsay Merritt Rohas Midlothian, VA \r\nJennifer Carol Henderson Gainesville, GA Vivian Riley Whitaker Charleston, SC \r\n+*Anna Nichole Honko Tega Cay, SC \r\nPackaging Science \r\nEric Joseph Abed---------- Charleston, SC John Martin Leaphart _________ Lexington, SC \r\n*Sarah Elizabeth Belcher Greer, SC George Anthony Lloyd, Jr. Mauldin, SC \r\nJeffrey Smith Boland Greer, SC Allison Marie Moore Macon, GA \r\nKenisha Shanice Bradford Fort Myers, FL Charles Joseph Ryan, Jr. Spartanburg, SC \r\n*William Malcolm Garner Laurens, SC Thomas Guery Sinclair Union, SC \r\n*Suzanne Michelle Hamlin Roswell, GA Robert Jon Van Wageninge East Brunswick, NJ \r\nJason Douglas Jones Chesterfield, SC \r\nPre-professional Studies \r\nFranklin Jeffrey Chyatte _______ Washington, DC Kelly Colleen Lipsey ---------- Houston, TX \r\nLori Smith Garner Winter Park, FL "
    },
    {
        "page_number": "21",
        "text": "COLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nJANICECERVELLI SCHACH, Dean \r\nBACHELOR OF FINE ARTS \r\nJonathan William Bethel Nassau, Bahamas *Heather Kay Keller __________ Hanahan, SC \r\nEric David Carlson Clemson, SC *Ashley Kay Webb Spartanburg, SC \r\nSkye Tarpie Frost Port Macquarie, Australia Nathan David Woodward Clemson, SC \r\nCatherine Anne Hollingsworth Jolly Spartanburg, SC \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\nKirsten Holley Bloss __________ Columbia, SC Karen Lea King -----------Glenwood, IN \r\n**Susan Fay England Gainesville, GA Ross Carter Lefebvre Cincinnati, OH \r\nRyan Matthew Foster Greenville, SC Patrick Trevor Livingston North, SC \r\n+*Marshall Eugene Giles Indian Land, SC Edward Todd Richardson Goldsboro, NC \r\n*Robert Daniel Hyatt Waynesville, NC Christopher Selwyn Thompson Barnwell, SC \r\nWilliam David Johnson Easley, SC Patrick Andrew Watson Easley, SC \r\nBACHELOR OF ARTS \r\nDesign \r\n*Mican Allen Andrews ________ Alpharetta, GA Kelley Lynn Hubbard. ______ Hilton Head Island, SC \r\nMary Martha Brake Dover, NH Jin Hee Lee Duncan, SC \r\nMatthew Allen Brewer Rembert, SC Stephanie Suzanne Metz Hanahan, SC \r\nChristopher Tennent Cecil Spartanburg, SC **Emily Elizabeth Moore Augusta, GA \r\n+**Christopher Joseph Ching Anderson, SC Erik James Muehlhausen Plymouth, IN \r\n*Laurie Shannon Green Greenwood, SC Travis Brandon Rice Anderson, SC \r\nDon Anthony Guarcello Brielle, NJ \r\nEnglish \r\nDavid William Ables _________ Woolwich, ME *Alexander Austin Lee ________ Mt Pleasant, SC \r\nJodi Beth Baker Sayville, NY *Lawrence Donald Long III East Bend, NC \r\nStacey Lynn Beaton Greenville, SC Kelly Elizabeth Mayfield Anderson, SC \r\nWhitney Leigh Bevill Anderson, SC Lauren Anne McCarty Fairfax, VA \r\n*Stephen David Caldes Westfield, MA Sarah Elizabeth Morgan Howell, MI \r\nPhillip Russell Caston Spartanburg, SC Rachael Louise Perkins Williamstown, NJ \r\nMark Steven Champion Tampa, FL *Glenn Reid Quattlebaum, Jr. Manning, SC \r\nMary Kathleen Connell Central, SC Dana Celeste Robinson Lugoff; SC \r\nMatthew Vernon Creech Walterboro, SC +**Brian Michael Ruggiero Providence, RI \r\nCourtney Elise Dunn Savannah, GA Nicole Hayden Schnibben Fort Campbell, KY \r\n***John Oliver Felling Somers, NY *Elizabeth Marie Schofield Jacksonville, FL \r\n*Mary Elizabeth Ferrigan Greenwood, SC Bridget Ellen Scott Florence, SC \r\n**Anna Kathlene George Fort Mill, SC Ashley Elizabeth Sherry Alpharetta, GA \r\nEden Ashley Harris Pickens, SC Charles Michael Short, Jr. Fort Mill, SC \r\n**Jessica Renee Hicks Voorhoes, NJ ***Sarah Thompson Sloan Marion, SC \r\nJames Scott Hogan North Branford, CT Bryan Robert Smith Yardley, PA \r\nMary Porter Hudson Orangeburg, SC Katherine Anne Smoak Lancaster, SC \r\nSharlie Brianne Ivester Belton, SC John R. Sokohl, Jr. Chattanooga, TN \r\n**Katrina Dee Jackson Joanna, SC *Amy Marie Thompson Walhalla, SC \r\nKatrina Shonta Jackson Edgemoor, SC Lee Mclaurin Tiller Florence, SC \r\nJohn W. Keebler Massapequa, NY ***Lois Brooke Williams Clemson, SC \r\n**Mason William King Kingsburg, SC Emily Hunter Wood Manasquan, NJ \r\nEmily McKain Langdon Blythewood, SC *Crystal Elaine Young Anderson, SC \r\nHistory \r\n*Mary Jennifer Duvall Adams _____ Westminster, SC Michael Cory Mazuk _________ San Angelo, TX \r\n**Patrick Lewis Burke Chester, VA Ernest Damon McKenzie Lake City, SC \r\n*Claire Elizabeth Jamieson Charleston, SC Scott Lawrence Pacult Piedmont, CA \r\nJesse Colin Kidd Ponte Vedra Beach, FL Baron Zachary Rickenbaker Toccoa, GA \r\n***Dendy Susannah Macaulay Indian Trail, NC Thomas Wesley Salmons IV Columbia, SC \r\n**Amy Michelle Matthews Richmond, VA Blaise Christopher Simonetti Greenville, SC \r\nLanguage and International Trade \r\nEric F. Ayala __________ Panama City, Panama Jillian Starr OrRico ----------Lafayette, IN \r\nRachel Elizabeth Clark Chesapeake, VA Rachael Marie Alkana Papadatos Barstow, CA \r\nChesley Reed Cordray Charleston, SC \r\n*Emily Hope Crawford Greer, SC \r\nFelipe Segundo Estrada Paniagua Miama, FL \r\n**Tanner Woods Pittman Spartanburg, SC \r\nLauren Marie Ponder Spartanburg, SC \r\n**Elizabeth Jean Poston Hendersonville, NC \r\nCarmina Giraldo Pereira, South America *Rachel Casey Ridge Charleston, SC \r\n*Christopher Michael Graney Clifton Heights, PA Laura Leigh Robinson Greenville, SC \r\nAdam Michael Hermansen Waco, TX Sara Elizabeth Setzler Houston, TX \r\nLouise Caroll Jenkins Charleston, SC \r\nAida Paola Lacayo Miami, FL \r\nBianca Tiffany Storsberg Tega Cay, SC \r\nJon Jeffries Tate Central, SC \r\nSarah Elizabeth Larson Williamsburg, VA *Melanie Rae Warren Thompson Clemson, SC \r\n*Erin Marie Lentz Hilton Head Island, SC Karla Christina Torres Greenville, SC \r\n**Ginger Leigh Marshall Greenville, SC Shannon Elizabeth Wanner Durham, NC \r\nSuzanne Nicole Nedovich Avon, CT Courtney Colleen Wittstruck Lincoln, NE "
    },
    {
        "page_number": "22",
        "text": "Modem Languages \r\nJacqualene Brooke Harper ______ Chevy Chase, MD Ernest Damon McKenzie ________ Lake City, SC \r\nMark Joseph Lisi Englewood, CO **Maggie Ann Muir Conway, SC \r\nPhilosophy \r\nDavid Bradley Jones __________ Lexington, SC Suzanne Kirayoglu --------- Spartanburg, SC \r\nSpeech and Communication Studies \r\nLeslfe Faye Anderson ___________ Cary, NC Andrea Meredith Holt ________ San Antonio, TX \r\n**Katherine Elizabeth Avant Mountain Brook, AL *Alexsis Lee Horowitz Washington, OC \r\nRobert Blair Babcock Columbia, SC **Allison Joanne Labate Pawling, NY \r\nMatthew Aaron Bailey Stone Mountain, GA Tara Rebecca Langley Greenwood, SC \r\n**Vikki Bedigian Whitinsville, MA Jason Connon Littlefield Moore, SC \r\nWade Devereux Bicknell Chatham, MA Paulette Gwendolyn Majors Montgomery, AL \r\nMargaret Grace Bolt Greenville, SC Tyler Clark McClure Las Vegas, NV \r\nAndrew Robert Boyce Greenville, SC Jennifer Lynn MeE-dor Mechanicsville, VA \r\n**Priscilla Jane Brown Greenville, SC Arny Leigh Montgomery Beaufort, SC \r\n*Samantha Leigh Carruth Landrum, SC Melanie Gayle Moody Darlington, SC \r\nAnn Janet Connelly Waterbury, CT Margaret Ellen Olson St Matthews, SC \r\n*Amanda Ruth Dawkins Powdersville, SC **Sandra Allison Owens Lancaster, SC \r\nCarmen Maree DiBiase Camden, SC Tyler Michelle Page Greenville, SC \r\nWilliam Edward Doolan Spartanburg, SC Catherine Graham Parker Abbeville, SC \r\nFaith Elise Marie Duncan Greenville, SC Nicole Marie Peterson Alpharetta, GA \r\nCheznee Dawnell Egernonye Anderson, SC Jack Denver Powell, Jr. Westminster, SC \r\nRobin Michelle Ensley Easley, SC Erin Renee Precious Georgetown, TX \r\n*Cayce Boyd Fant Greenville, SC *Tracee La Tiffany Ready Aiken, SC \r\nChristopher Rhett Frye Alpharetta, GA Charli Jo Reasons Charlotte, NC \r\nMelissa Ann Gebhart Miami, FL Mary Elizabeth Redmond Columbia, SC \r\nRhett Harmon Gramling Gramling, SC Allyson Paige Rosebrock Columbia, SC \r\nMandy Elizaoeth Griffith Duluth, GA Robert Christian Ulon Marlboro, NJ \r\n*Jennifer Anne Guth North Oaks, MN Christian Scott Uva Charlotte, NC \r\nHoward David Hassard, Jr. Wayne, NJ *Caraline Mary Valentine Ruffin, SC \r\nCatherine Clabaugh Heatly Spartanburg, SC *Elizabeth Asia Van Voorhis Dallas, GA \r\n**Genie Brannon Holmes Johnston, SC Mary Shannon Williams Simpsonville, SC \r\nDOUBLE MAJOR \r\nEconomics and German \r\n*Travis Richard Hauck _________ Florence, SC \r\nEconomics and History \r\nJohn Henry DeGregorio _________ Miami, FL \r\nEconomics and Speech and Communication Studies \r\nMichael Lonnie Fowler Loris, SC \r\nEnglish and History \r\n**Dawn Marie Jackson _________ Ellicott City, MD \r\nEnglish and Spanish \r\n*Heidi Burke Gross Villa Hills, KY \r\nHistory and Political Science \r\n*Elizabeth Nicole Elliott Spartanburg, SC \r\nPolitical Science and Speech and Communication Studies \r\n***Rita Kyleen Bolt --------- Anderson, SC Ashleigh Brooke Foard _________ Yorktown, VA \r\nAnna Elisabeth Corpening Lenoir, NC Rebecca Paige Townes . Conway, SC \r\nPsychology and Speech and Communication Studies \r\nWilliam Franklin Rogers III West Columbia, SC \r\nSociology and Speech and Communication Studies \r\nShekera Shenise Weston Fort Campbell, KY \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nMatthew David Balanky ________ Jacksonville, FL +**Christina Marie Lindsey _______ Columbia, SC \r\nTodd Bryan Bulwinkle Hanahan, SC Jack Allen Lostetter Lugoff, SC \r\nDavid William Butler Spartanburg, SC Benjamin Nelson Manning Wilmington, DE \r\nScott Martin Ditman Easton, MD William Heyward Neely III Columbia, SC \r\nDavid Paul Ellis Hampton, SC James Russell Patterson Slickville, PA \r\nRyan Christopher Fiocchi Vineland, NJ Joseph Sidney Pelton Summerville, SC \r\nFrancis Reid Fisher Kensington, MD Matthew Paul Robbins Moncks Comer, SC \r\nDwayne Russell Galloway Greenville, SC Andy Eugene Roberts Chesnee, SC \r\nKevin Scott House Raleigh, NC Andrew Richard Smith Chester Springs, PA \r\nBrant Len Hutchinson Florence, SC Eric Douglas Vinson Camden, SC \r\nEric Landon Koehler Winston~Salern, NC **Bruce Ray Vollnogle Greenville, SC \r\nBrett Nelson Kramer Fort Mill, SC Ronald Todd Williams Snellville, GA "
    },
    {
        "page_number": "23",
        "text": "Design \r\nJustin Andrew Abrams __________ Joanna, SC Scott Edward Leahy _________ Pembroke, MA \r\nMyles Steven Alexander, Jr. Six Mile, SC Damien Urain Linnen Georgetown, SC \r\nJeffrey Ray Ballard Greenville, SC Joseph Bernard Merritt Myrtle Beach, SC \r\n*Amy Christina Briggs Rock Hill, SC Misti Marie Mroz Hallstead, PA \r\n*Paul Eugene Brown Greenwood, SC Homer Kurt Hermann Nestlen Inman, SC \r\nBrandee Drummond Burnett Greenwood, SC +***Zachariah Lee Riddley Columbia, SC \r\nJason Patterson Diehl Marietta, GA Tori Barbrey Rogers Simpsonville, SC \r\nBrandon Kenneth Edwards Simpsonville, SC Ryan Joshua Selwa Conway, SC \r\nStephen Andrew Fintak Lexington, SC Anne Rachel Singer Exton, PA \r\nMartin David Furness Manchester, England *Matthew Edward Szymanski Aiken, SC \r\nFrances Maegen Furtick Springfield, SC Michael Kevin Tilley Travelers Rest, SC \r\nNicholas Daniel Gerstner York, SC Emily Rae Tin~ler Rock Hill, SC \r\n**Steven Roberts Grogan Sumter, SC *Lauren Elizabeth Ulmer Walterboro, SC \r\nMariam M. Heelan Hilton Head Island, SC Rebecca Claire Waterman Watkinsville, GA \r\nHans Curtis Herrmann Alexandria Bay, NY Gregory Scott Watford Florence, SC \r\nAmanda Kaye Jackson Franklin, VA *Kent David Williams Greenville, SC \r\n**Cullen Scott Keen California, MD +***Terry David Ben Wilson, Jr. Central, SC \r\nJohn Lee Kester III Sumter, SC \r\nCOLLEGE OF BUSINESS AND PUBLIC AFFAIRS \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nJohn David Langston _________ Fort Worth, TX John Buxton Shaw III _________ Moncure, NC \r\n+***Dendy Susannah Macaulay Indian Trail, NC \r\nPolitical Science \r\nTeresa Megan Barnes __________ Conyers, GA Gabrielle Taki Hopkins _______ Cabin John, MD \r\nLatisha Andrea Brown Anderson, SC W. Walker Hunter III Augusta, GA \r\n*Michael Donald Cerasa Wilbraham, MA Brian Alan Hutcheson Ocala, KY \r\nBrandi Nicole Covil Clemson, SC Christian Bernard LaGrossa Downingtown, PA \r\nJonathan Carl Emory Santiago, Chile *Keith Joseph Rosa Wyckoff, NJ \r\nAnne Christine Funk Annapolis, MD *Tiffany Rae Winters Morganville, NJ \r\nPsychology \r\nBritton· Ashley Belk __________ Anderson, SC +***Reyburn Williams Lominack III ____ Newberry, SC \r\nChristie Lee Berthelsen Alpharetta, GA *Katherine Elizabeth Mackes Salisbury, MD \r\nMelanie Chapman Bragg Simpsonville, SC *Brandy Tennille McKinney Jonesville, SC \r\n+***Bethani Lavice Brown Myrtle Beach, SC *Jennifer Lyn Nice Havertown, PA \r\nMichelle Alicia Burgher Kingston, Jamaica *Julie Emery Nicholas Clarence, NY \r\n*Ashley Suzanne Campbell Cincinnati, OH Jessica Faye Nichols Rock Hill, SC \r\nElizabeth Horry Jordan Coker Manning, SC Ryan Fong Nieves Goose Creek, SC \r\nLeslie Yvonne Coker Greenville, SC Amanda Jane Oberdorf£ Killingworth, CT \r\n*Shaun Nicholas Cox Black Mountain, NC Michael P. Ouellette East Longmeadow, MA \r\nMary Beth Delozier Silver Spring, MD Joshua Harris Pannell Anderson, SC \r\n+***Michelle Cordray DiMaio Ravenel, SC Heather Moore Pelton Fairfax, VA \r\nAlejandro Dubreuil Lima, Peru Elizabeth Susan Pond Seneca, SC \r\nSarah Beth Dylewski Saxonburg, PA ***Jeffrey Michael Rae Sayre, PA \r\nShanna Brittney Earles Kingsport, TN Robin Leigh Ray Fountain Inn, SC \r\nAmanda Joy Forsman Hockessin, DE *Sharon Elizabeth Roberts Lugoff, SC \r\n***Megan Cynthia Gadke Orange, OH Timicia L. Robinson Honea Path, SC \r\n***Jennifer Mareth Gage Summerville, SC *Melissa Rose Savia Stony Point, NY \r\n*Brian Thomas Grace Phillipsburg, NJ *Saad M. Shukur Greenville, SC \r\n***Michelle Lynn Grau Powdersville, SC Carolina Simon Boca Raton, FL \r\n*Thomas Paul Griffin Powdersville, SC George Robinson Stokely Irmo, SC \r\nKaylee Burroughs Hayes Tuscaloosa, AL +***Carrie Cathryn Tiger Marietta, GA \r\n**Ganon Wade Hicks Kingsport, TN Jaclyn Michelle Torlay Summerville, SC \r\n*Addie Virginia Holcomb Columbia, SC Sari Amanda Travis Greenville, SC \r\nAmanda Jolyn Keel Barnwell, SC **Silvia Leonora Travis Travelers Rest, SC \r\n**Irina Kitt Clemson, SC ***Elizabeth Laine Walters St George, SC \r\nKelly Ann Lodge Potomac Falls, VA Danielle Marisa Wilkinson East Patchogue, NY \r\n***Christina Marie Loeven Spartanburg, SC \r\nSociology \r\nKimberly MaeLouise Aiken _______ Anderson, SC **Nicole Yvonne Riggs _________ Walhalla, SC \r\nJames Andrew Armstrong Irmo, SC Thomas Elliott Rostin, Jr. Mt Pleasant, SC \r\nLashonda Lanae Cutchin Virginia Beach, VA David William Sloyer Seekonk, MA \r\nHarold Mack Kennedy III Manning, SC Erin Elizabeth Turner Greer, SC \r\nMarc Stephen Paisant Atlanta, GA Marcie Lynn Vander Ploeg River Edge, NJ \r\nMarcey Anne Payne Sarasota, FL Catherine Eastman Wheeler Clemson, SC \r\n***April Joy Poole Greenville, SC "
    },
    {
        "page_number": "24",
        "text": "DOUBLE MAJOR \r\nEconomics and Political Science \r\n**Cheryl Elizabeth Carpenter _____ Walled Lake, MI +*Herbert Cecil Howell 111 _________ 1.rmo, SC \r\nLauren Marie Hardy Mauldin, SC \r\nEnglish and Political Science \r\nEmily Woodward Rosen -------- San Diego, CA **Dayton Katherine Stout _________ Irmo, SC \r\nGerman and Political Science \r\n+***Michele Ann Laudenberger Carlisle, PA \r\nPolitical Science and Sociology \r\nMeredith Renee Pearson _______ Silver Spring, MD +**Cynthia Kathleen Pettitt ------Richmond, VA \r\nPolitical Science and Spanish \r\n+*Kelly Lynn Anderson Mt Pleasant, SC \r\nPolitical Science and Speech and Communication Studies \r\nMohamed Wagih Abdel-Kader Clemson, SC \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nRobert Edgar Adams, Jr. ---------Laurens, SC \r\nScott Curtis Bain Marietta, GA \r\n*George Herring Bowen Clemson, SC \r\n**Caroline Dew Brown Hartsville, SC \r\nKenneth Nelson Burton, Jr. Silver Spring, MD \r\n*Andrea Nicole Chapman Pickens, SC \r\nBrian Robert Hansen West Milford, NJ \r\n+***Jennifer Elizabeth Heim Fort Mill, SC \r\nMichael James Hood Piedmont, SC \r\nLauren Elizabeth Jacobs Sevema Park, MD \r\nTrevis Sentell Johnson Garnett, SC \r\n+*Melissa Diane Kelley Easley, SC \r\n*Roy Michael King Birmingham, AL \r\nKaryn E. Kingsbery New Orleans, LA \r\nApril Kelly Koziol Travelers Rest, SC \r\nT oemika D. Lloyd Elloree, SC \r\nChristopher Daniel Longley Signal Mountain, TN \r\nJohn David Love Lancaster, SC \r\nShannon M. McAvoy Hawthorne, NJ \r\n*Ryan William Owen Walhalla, SC \r\nAndrew George Paland Madison, NJ \r\nStephen Ricardo Paoli Suffern, NY \r\nCharles Spiro Pappas __________ Webster, MA \r\nApril Regina Porter Seneca, SC \r\nMichael Brandon Pridemore Franklin, TN \r\n*Ashley Allen Proctor Myrtle Beach, SC \r\n*Susan Amanda Ridgeway Anderson, SC \r\nKenneth Ray Ringenberg Bourbonnais, IL \r\nMichelle Lynn Saverance Florence, SC \r\n+**Amanda Lee Schmidt Hilton Head Island, SC \r\n***Christopher Donald Semesky Baltimore, MD \r\n*Camron Lewis Smith Irmo, SC \r\nMolly Beth Smothers Greenville, SC \r\nMatthew Jeffrey Stephen Boston, MA \r\nEarl Collen Stone 11 El Paso, TX \r\nChristine Mary Szafran Acton, MA \r\nMarie Elizabeth Treadway Travelers Rest, SC \r\nWilliam Russell Tressler Seaford, DE \r\nBrian Paul Werner Stonington, CT \r\nAlton Clinton Whitley Ill Clemson, SC \r\n**Robert Justin Wilkes Orangeburg, SC \r\n**Elizabeth Joy Williams Greenville, SC \r\nDaysi Castillo Wilson Panama City, Panama \r\nEconomics \r\n***Susan Baker Breitmeier _____ Melbourne Beach, FL Jeremy Lee Loescher -----------Dixon, IL \r\n*Matthew Michael Brennan · De Pere, WI Nicholas R. Pavlish Cleveland, OH \r\nMatthew O'Neal Darnell Bamberg, SC Lawrence Robert Pole Utica, NY \r\nJared Bankes Herzog Asheboro, NC James Adam Prosser Britton's Neck, SC \r\nGerald Douglas Hom Summerville, SC +***Margaret Brooks Rhine Lexington, SC \r\nW. Walker Hunter Ill Augusta, GA Taylor Ryan Sacha Winter Park, FL \r\nChristopher Harrison Lee Mt Pleasant, SC *Peter Morgan Schoenbauer Germantown, MD \r\n**Samuel Dale Little II Pickens, SC \r\nFinancial Management \r\n*Jennifer Brooke Alt--------- Edgemoor, SC \r\nAmanda Harmon Ballington Gilbert, SC \r\n*Derek Wade Beane Southboro, MA \r\nMichael Fowles Becher Greenville, SC \r\nChristi Suzanne Brown Due West, SC \r\n*Lasonya Denise Burkett Columbia, SC \r\n+*Michael Patrick Cahill Terre Haute, IN \r\nCourtney Tyler Cape Liberty, SC \r\n**Nichole Michelle Cayton Hanover, MA \r\n***Len Gene Pennell Clamp Williston, SC \r\nJohn Nicholas Cluney Southbury, CT \r\nDavid Allen Corbin Charleston, SC \r\nJason Trent Douglas New Orleans, LA \r\nJustin Daniel Dubiel Camden, OH \r\nJason Ryan Eargle Orangeburg, SC \r\nMatthew Chandler Eaves Rock Hill, SC \r\n**Jill Nicole Edmunds Lincolnton, GA \r\nJoseph Lawrence Egan Jefferson Township, NJ \r\n*Meghann Naomi Gardner Knoxville, TN \r\n***Amy Catherine Giannini Fitchburg, MA \r\n***Jeffrey Dean Gilstrap Easley, SC \r\nChristopher Scott Hammond Florence, SC \r\nBrian Robert Hansen _________ West Milford, NJ \r\nHaley Ann Hiers Gaffney, SC \r\n+**Bradley Kyle Holliday Greer, SC \r\n*William Joseph Hopke, Jr. Richmond, VA \r\n+***Timothy Brent Iredale Snellville, GA \r\nMichael Neil Jones Greer, SC \r\n*Kimberly Ann Kattermann Blairstown, NJ \r\n*Casey Kathryn Kearse Greer, SC \r\nAlexander Thomas LaSalle West Long Branch, NJ \r\nMeredith Suzanne Lee Aiken, SC \r\nCharles Bradley Literati Spartanburg, SC \r\nChristopher Daniel Longley Signal Mountain, TN \r\nCarmen Marie Lueras Anchorage, AK \r\nMichael Henry Mallon Point Pleasant, NJ \r\nAmy Michelle McColl Clio, SC \r\nDarcy Anne McNiff Cherry Hill, NJ \r\n+*John Calvin Miller Lake View, SC \r\nMonica Maxine Mose Columbia, SC \r\nJohn Mischel Murphy Greenville, SC \r\n**Ashley Elizabeth Nute Columbia, SC \r\nDavid Andrew Parker Florence, SC \r\nTarik Saeed Pierce Florence, SC "
    },
    {
        "page_number": "25",
        "text": "Financial Management (continued) \r\nPhilip J. Potter Gaffney, SC Charles William Staton, Jr. Honea Path, SC \r\nMichelle A. Proveaux Chapin, SC Curtis F. Sullivan Mansfield, MA \r\nJohn Arthur Reagan IV Spartanburg, SC **Kimberly Elizabeth T eiken Greenville, SC \r\n*Bryan Angelo Reviello Hillsborough, NJ ***Julie Marie Tompkins Westminster, SC \r\nRyan Preston Rickards Cope, SC Kyle Austin Walter Simpsonville, SC \r\nJonathan Taylor Rollings Columbia, SC Laura Armitage Walton Simpsonville, SC \r\nMichael Douglas Rose Franklin, VA *Amy Marie Wasatonic Greenville, SC \r\nRyan Matthew Sansavera South Glastonbury, CT Mary Elizabeth Wilborn Spartanburg, SC \r\nAndrew Zachary Schiff Florence, SC Roger Williams, Jr. Walterboro, SC \r\n***Ginny Lee Sherrow Waterford, MI Ashley Charles Woodard Walterboro, SC \r\nBrandy Lynn Smith ;.. York, SC Patrick Thor Woods Greensboro, NC \r\nDerek Stribling Stapleton Cornelia, GA +***Mariah Kay Zander Oconomowoc, WI \r\nGraphic Communications \r\nMichelle Denise Baskerville Monroe, CT John Joseph Jasins Littleton, MA \r\nJohn Maxwell Birkhead Stafford Springs, CT Christopher Dayton King Greenville, SC \r\nMagen Brianne Blackwelder Winnsboro, SC Melinda Jane Macky Nqrth Augusta, SC \r\n*Ana Cristina Boscio North Augusta, SC John Timothy McCarthy III Pasadena, MD \r\nRobert Gordon Castles, Jr. Seminole, FL Marion Edwin Mclaurin Bennettsville, SC \r\n*Samantha Marie Curry Reading, PA David Eugene McMahan Black Mountain, NC \r\nMeghann Byrnes Donaldson Gaithersburg, MD Sharon Kay Miller Erdenheim, PA \r\nRichard John Donoghue, Jr. Westport, CT Michelle Christine Mollgaard Anderson, SC \r\nJoey Lamont Erwin Chester, SC Crystal Dione Pressley Pendleton, SC \r\n*Jamie L. Field Charleston, SC Tiffany Shea Repokis South Boston, VA \r\nJatika Lanea Furtick Swansea, SC Stephanie Jane Shealy Columbia, SC \r\n*John Gregory Gleich Pittsburgh, PA Whitney Nichole Smith Florence, SC \r\nRoss Arthur Gormley Ponte Vedra Beach, FL Dorothy Lauren Stiles Greensboro, NC \r\nMerri Beth Grant Piedmont, SC ***Gloria Beth Tate Taylors, SC \r\nSanders Dickinson Guignard Columbia, SC Joshua Joseph Taylor Lexington, SC \r\n*Anne Marie Hathcock Denver, NC Sarah Ann Trahan Glastonbury, CT \r\n*Lauren Michelle Henne Hilton Head Island, SC Denise Christine Weltzien Duluth, GA \r\nGeorge Michael Hermiston Westwood, MA William Nelson Zamorski Batavia, IL \r\n*Courtney Dawn Hughes North Augusta, SC *Sara Georgina Zee Millsboro, DE \r\nKathryn Ann Hunter Hilton Head Island, SC \r\nIndustrial Management \r\nJohn Charles Hunter Bennettsville, SC Joseph Paul Skinner Marion, SC \r\n*Jason Thomas Owens Chester, SC Jason Matth~w Williams Belton, SC \r\nBart Jefferson Quattlebaum St Matthews, SC \r\nManagement \r\nMatthew Richard Adams Spartanburg, SC Christina Michelle Manos West Columbia, SC \r\nMichael Mellette Andrews Florence, SC Joseph David McCain Richburg, SC \r\nDeborah Lee Staughton Anthony Ontario, Canada Adrian Wesley Messer Liberty, SC \r\n*Adrianne Elizabeth Arnold Clemson, SC Daniel James Middleton Waldorf, MD \r\n+**Elizabeth Anne Blackbum Marion, SC James Martin Mix on Bamberg, SC \r\n*Christina Kae Brosche Anderson, SC Matthew Brian Moraski Charlottesville, VA \r\nKristin Marie Campbell Seneca, SC Jennifer Lynn Morine Okatie, SC \r\n**Allison Marie Collins Lancaster, SC Matthew Russell Pensinger Marietta, GA \r\nLoni Tristin Colwill Cohasset, MA Brooke Lynnette Petty Gaffney, SC \r\nMeghan Walston Cumor Ellicott City, MD Christopher Paul Pfeiffer Pittsburgh, PA \r\nAllen Benjamin Davis Columbia, SC John Pratt Reed, Jr. Hilton Head Island, SC \r\nRonald Joseph Degler, Jr. Ridgeland, SC *Mary Watkins Ross Central, SC \r\nTodd Marsh Elfert Columbia, SC *Kelly Anne Rudolph Potomac, MD \r\nLauren Ann Gibbons Riv.a, MD Jani Tapio Saari Helsinki, Finland \r\nJonathan Tyler Gibson Greenville, SC ***Shannon Elizabeth Saunders Georgetown, SC \r\n*Keith Erik Goryl Smithfield, RI **Paul Glenn Schubert Corvallis, OR \r\nAmanda Michelle Graham Chapin, SC *Anton John Sedalik III Mt Pleasant, SC \r\nJason Scott Graham New Hartford, NY Sara Senn Santa Rosa, CA \r\nBrian David Haddock Orangeburg, SC ***Jessica Cary Shelton Richmond, VA \r\nJacqualene Brooke Harper Chevy Chase, MD Ashley Anne Simons Holly Hill, SC \r\nAllison Catherine Hickey N r.w Orleans, LA Aaron Zachary Sims Ridgeland, SC \r\nVirginia Parris Hicks Easley, SC *Kellie Nicol Smith Charleston, SC \r\nShevlin Flint Howe Greenville, SC *Sarah Louise Stevenson Columbia, SC \r\nDebra Lorenn Jones Columbia, SC Anne Alysia Swanson California, MD \r\n*Valerie LuAnne Keller Orangeburg, SC Dawn Yvonne Toland Massillon, OH \r\nStacie Elizabeth Koon Cayce, SC *Kimberly Louise Toney W estminister, MA \r\nEric Jam es La Barge Fayetteville, NY Kerry Elizabeth Volpe Garden City, NY \r\nTammy Selena Lancaster Eatonton, GA Kathryn Carletta Werner Simsbury, CT \r\nDouglas Eugene Limbaugh, Jr. Easley, SC \r\nMarketing \r\nJoseph Ryan Alford Greenville, SC Brad Kenneth Banks Columbia, SC \r\nAdam Mathew Allenspach Parkland, FL Matthew Thomas Barrett Gaithersburg, MD \r\n*Bonnie Marie Apgar Simpsonville, SC Mary Charlotte Barry Pinopolis, SC \r\nNicholas Barry Aughtry Simpsonville, SC Kelly O'Connor Barton Pittsburgh, PA \r\nShannon Michelle Bailey Charleston, SC John Evan Bennett Pickens, SC "
    },
    {
        "page_number": "26",
        "text": "Marketing (continued) • Barry William Blakely Seneca, SC Valerie Jeanne Minnich Avon, CT \r\nThomas Livingstone Boggs Columbia, SC Scott Rice Mitchell East Grand Rapids, MI \r\nLesley McKinley Brees Greenville, SC Lisa Nicole Mogan Centerville, MA \r\nAaron Thomas Brewer Greenville, SC Amanda Brooke Moore Campobello, SC \r\n*Christopher Joel Brice Inman, SC Brock Van Moore Mt Pleasant, SC \r\nKelley Marie Campbell Pickens, SC *Katie Elizabeth Morrison Sumter, SC \r\nPatrick T. Carroll Hilton Head Island, SC Wesley Alexander Morrow Greenville, SC \r\nMichael Andrew Chisholm Fallston, MD Robert Frederick Muhlhauser III Cincinnati, OH \r\nReshauna T enille Cobb Columbia, SC **Sylvia Carolyn Murrell , Edgefield, SC \r\nChandler Austin Cole Spartanburg, SC James Robert Neel, Jr. Newberry, SC \r\nMildred DuBose Coleman Augusta, GA *Melanie Ann Nelson Hilton Head Island, SC \r\nRichard Jacob Crowder Columbia, SC Nicholas Lynwood Newman Fairfax, VA \r\nDeidra A. Duncan Camden, DE Matthew Glenn Olsen Brockport, NY \r\nElizabeth Kay Eastwood Greeley, CO Brantley Susan Owens Barnwell, SC \r\nAdrienne Renee Ellis Franklin, NC Wesley Durell Perry Manlius, NY \r\nJohn Douglas Engler, Jr. Augusta, GA Peter Anthony Pigeon Columbia, SC \r\n*Janis Patrice Faile Winnsboro, SC Adam Mark Pirttima Ocala, FL \r\nNicole Ivy Charlaine Fearon Sewell, NJ Adam Frederick Porter Doylestown, PA \r\nMatthew Charles Federico Cornelius, NC Christopher John Ramsey Virginia Beach, VA \r\nBrad James Fink Atlanta, GA Allison Raynor West Windsor, NJ \r\nTeal Amanda Flint Clemson, SC Brandi Nichole Riddle Newberry, SC \r\nChristina Anne Fullington Fairfield, CT Bradley Pierce Robertson Lancaster, SC \r\nAndrea Gaines Orlando, FL Justin John Sanderson Franklin, NC \r\nBryan Victor Gaines Buffalo, SC **Loretta Ann Sexton Prince George, VA \r\n*Jocelyn Morgan Gilleland Conway, SC **Catherine Brooke Sigmon Spartanburg, SC \r\nMatthew Owen Goldrick Florence, SC Andrea Jean Sinkin Nissequogue, NY \r\nSara Elizabeth Grimsley Columbia, SC Jordan Ann Smith Taylors, SC \r\nDeven Deanna Grinstead Cornelia, GA Kimberly Dawn Smith Simpsonville, SC \r\nKristen Leigh Hammel Oakton, VA Donavon Maurice Springs Camden, SC \r\nAshleigh Brooke Harmon Greenville, SC Gene Franklin Stephens, Jr. Neeses, SC \r\nKelly Ann Harrell Florence, SC Lauren Carol Stewart Manning, SC \r\nDavid William Hart Fountain Inn, SC Thomas Ryan Swicker Wall, NJ \r\n**Julie Elizabeth Herman Solon, OH Avery Alan Telligman Chester, SC \r\nSteven Brandon Hester Greenville, SC Ling Ho Tsui Charleston, SC \r\nScott Jeffrey Hoffman Columbia, SC Derek Anthony Turpin Easley, SC \r\nChad Edwin Johnson Washington Depot, CT Adam Pressley Varnadore Conway, SC \r\nMary Elizabeth Jones Longwood, FL Jill Marie Vos hake Mobile, AL \r\nShawn Lernard Jones Abbeville, SC **Matthew Wadleigh Chester, NJ \r\nJeffrey Thomas Kane Acton, MA Daniel Lee Wangerin Sheboygan, WI \r\nKeith Michael Katona Branford, CT Thomas Judson Watkins North Augusta, SC \r\nJohn H. Laver IV Erie, PA Virginia Sommers Weaver Roanoke, VA \r\nTremper Longman IV Philadelphia, PA *Emily Marie Welsh Bethel Park, PA \r\nJoshua Bryan Massengill Spartanburg, SC Matthew Thomas Whinghter Beech Island, SC \r\n*Jennifer Patricia Massey Hamilton, NJ Jametta Keralyn White Montevallo, AL \r\n**Meghan Elizabeth Matthews Pickens, SC *Curry Blake Williams Lancaster, SC \r\nKevin Michael Mayer Roswell, GA *Govie Lee Williams II Norway, SC \r\n**Stephanie Sue Meador Aiken, SC Elizabeth Ann Wilson Spartanburg, SC \r\nMegan Whitney Miley Hunt Valley, MD Christopher John Winters Chester, SC \r\n*Anna Elizabeth Shields Miller Columbia, SC Joseph Lorenzo Young Goose Creek, SC \r\nCheryl Sharpe Miller Blythewood, SC ***Sally Michelle Zeigler Williston, SC \r\nPre-professional Studies \r\nRalph King Anderson, Jr. Florence, SC \r\nPsychology \r\nSuzanne Hillary Bonner Gaffney, SC Kathryn Marie Molnar Cincinatti, OH \r\n***Michelle Ann Buckler Bamberg, SC Alexandra Warren Noe Columbia, SC \r\n***Virginia Madison Butler Conway, SC +**Mandy S. Piepgras Snellville, GA \r\nJacqueline L. Dalleska Huntley, IL Tracy Manieri Priest Hudson, NH \r\nHeather Marie Diliberto Taylors, SC Stephanie Marie Rackey Burtonsville, MD \r\nJennifer Kaye Frank Yorktown, VA Cynthia Marie Rando Danvers, MA \r\n***Beth Alison Gadke Orange, OH Melanie Lorrene Sanders Central, SC \r\nSteven Bradley Gambrell Woodruff, SC Jennifer Brooke Sarratt Anderson, SC \r\n*Kiisha Nannette Gladden Edison, NJ Ida Carolyne Sauls Fairfax, SC \r\n***Ashley Lauren Gower Florence, SC ***Hayley Nicole Shilling Pickens, SC \r\n***Pamela Kylene Gravley Clemson, SC *Cassandra Patrice Smisson Dover, DE \r\n***Mallory Schreiner Groves Ellicott City, MD **Christine Jeanette Smith San Antonio, TX \r\nRichard Alan Henderson Seneca, SC *Kimberly May Whitney Fort Myers, FL \r\nHeather Leeann Howell Easley, SC Jason David Zarolnick Marlboro, NJ \r\n**Kelly Delane McCabe Charleston, SC \r\nSociology \r\nKathryn Talmadge Barnes Anderson, SC Janet Denise Martin McCormick, SC \r\nDaa'lyah Davis Estill, SC Sylvia Rebecca Moore Walhalla, SC \r\n***Jennifer Anne Helm Massillon, OH *Heather Lynn Torbett Simpsonville, SC \r\nSarah Emlyn Logan Kissimmee, FL Jean Marie Trufan Anderson, SC "
    },
    {
        "page_number": "27",
        "text": "COLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF ARTS \r\nChemistry \r\n+**Lisa Marie Coward ________ Chesterfield, VA Michael Andrew Watson -------- Anderson, SC \r\nComputer Science \r\nGeorgina Miyuki Kogati Coleman _____ Piedmont, SC Devon Gene Kelly _________ Ellicott City, MD \r\n***Kevin Patrick Eudy Charlotte, NC \r\nGeology \r\nRonald Terrell Johnson _________ Santee, SC \r\nMathematical Sciences \r\n*Rebecca Russell Harvey ________ Hartsville, SC Christopher Monte Mize ________ Greenville, SC \r\nPhysics \r\nJonathan Russell Jeffries --------- Elyria, OH \r\nDOUBLE MAJOR \r\nChemistry and Spanish \r\nFelipe Andres Ortiz---------- Union City, NJ \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering \r\nMatthew George Arrants ________ Lexington, SC Wade Hampton Crow ________ Spartanburg, SC \r\n**Jansy Elizabeth Brown Taylors, SC *John Ashley Hayes Clemson, SC \r\nWilliam Rhett Butler II Cheraw, SC Courtney Neil Lyerly III Conway, SC \r\nCeramic Engineering \r\n**Andrew Michael Albers _______ Mishawaka, IN *Jonathan Michael Potter ________ Anderson, SC \r\nPrerak Y. Badheka Gujart, India Suzette Lea Rhyne Goose Creek, SC \r\n***Daniel Walter Belouin Clover, SC Edmund Penn Sanders Florence, SC \r\n+***Jeffrey Robert DiMaio Aynor, SC **Jennifer Lyn Thomson Hardyston, NJ \r\nGrady Lynn Hansen Stanton, MI **Jason Charles Williams Lilburn, GA \r\n***Sarah Elizabeth Mongeau Oviedo, FL *Stephanie Diane Wright Plant City, FL \r\nChemical Engineering \r\nLatisha Michelle Abney -------- Columbia, SC *Christopher Eugene Long -------Columbia, SC \r\nElizabeth Hamilton Ansley Spartanburg, SC Christopher Call Luca Byfield, MA \r\nKeri Brianna Baker Central, SC Kathryn Jean Madding Simpsonville, SC \r\n*Shelley Elaine Beard Fort Mill, SC John McMillan McCain, Jr. Denmark, SC \r\n*Jessica Lyn Bednarcik Charlotte, NC Mark Phillip Menees Anderson, SC \r\n***Benjamin Walter Bolt Greenville, BC +**Joseph Pinckney Mizzell III Orangeburg, SC \r\n+*Kevin Todd Boulware Lexington, SC Jason Lawrence Morgan Huntersville, NC \r\n+*Brent Constant Bregenzer Germantown, TN James Earl Newman, Jr. Fairfax, SC \r\nJodi Lee Christopher Landrum, SC Stephen Patrick Nothe Florence, SC \r\n*Charles Michael Coffey Rock Hill, SC Jeremy Shane Osborne Kingsport, TN \r\nMatthew Allen Cribb Columbia, SC William Brian Pool Beaumont, TX \r\nSanjay Kumar Dabra Charleston, SC *Robin McKinney Pope Easley, SC \r\n+**Christina Emaculet Daniels Kingstree, SC Charles Robert Ray III Rock Hill, SC \r\n*Amanda Brooke Davis Greenville, SC **Matthew Jason Shealy Pomaria, SC \r\n***Julia Elizabeth Dubnansky Saxonburg, PA Amy Renee Slough Greenville, SC \r\nKavitha Ganesan Greenville, SC *Amy Ruth Smith Boise, ID \r\nGeorge Chester Greene IV Charleston, SC *Amanda Kathryn Stennett Catlettsburg, KY \r\n+***Rebecca Kim Jelen Columbia, SC Christopher David Theisen Greer, SC \r\n*Joseph Francis Jones Lexington, SC *Gregory Abbott Wellman, Jr. Keller, TX \r\nAbraham Joseph Letter Walhalla, SC Robert Lanier Willis, Jr. Rock Hill, SC \r\nMaria Kathleen Manalo Lipata Goose Creek, SC \r\nChemistry \r\nCasey Michael Beard _________ Cheyenne, WY **James Richard Lee __________ Greenville, SC \r\nMatthew Harris Blum Solon, OH Hassan Mustafa Pressley Nesmith, SC \r\n***Matthew Ryan Branham Lugoff, SC **Shannon Aimee Schoppman East Patchogue, NY \r\n+**Michael David Capracotta North Charleston, SC Paul Vincent Szklennik Boiling Springs, SC \r\n**Shannon Recca Cooke Simpsonville, SC Shelby Lehann Taylor Beaufort, SC \r\nDuane Marshall Goodine Westminster, SC Bethany Faye Wells Rock Hill, SC \r\nJermaine DeSean Johnson Edgefield, SC "
    },
    {
        "page_number": "28",
        "text": "Civil Engineering \r\nHeith Wynn Adams __________ Conway, SC Aaron O'neal Livingston _________ Pornaria, SC \r\nRobert Matthew Anderson Sumter, SC Lucie Norvell Maguire Charleston, SC \r\n*Julie Anne Babb Gray Court, SC Jason Robert Manners Ocala, FL \r\nDouglas Arthur Marett Anderson, SC \r\nMarcus Ward Mathis Gaffney, SC \r\n*Joshua Kyle Bauer Chapin,' SC \r\n*John Matthew Bolin Orangeburg, SC \r\n**Wendell Ronald Buckman Red Creek, NY *Jason Lee Miller Inman, SC \r\nBenjamin Allen Campbell Summerville, SC Kristopher Layne Mitchell Spartanburg, SC \r\n*James Lucas Cook Columbia, SC *Iris Faith Neal Hilda, SC \r\n*Jessica Eve Cummings Burke, VA Cecily Michelle Nolan Surfside Beach, SC \r\nWilliam Michael Deloach, Jr. Winder, GA Thomas S. Peake Glenn Springs, SC \r\n*Matthew Arthur Edwards Springfield, VA Norris Brenton Powell Johnsonville, SC \r\nChristopher Michael Evans Pearl River, LA William Glenn Powell Waterloo, SC \r\n**Christopher Lee Farrar Anderson, SC Dwayne Scott Robinett Beaufort, SC \r\nScott W. Gilner Suffern, NY Elisabeth R. Rose Fort Mill, SC \r\nJeffrey David Glass Greenville, SC **Justin Brian Schumacher Powdersville, SC \r\nMichael Ryan Goforth Lilburn, GA +***Christopher Michael Strang Florence, SC \r\nAnna Lee Guss Isle Of Palms, SC Amanda Gayle Thompson Simpsonville, SC · \r\n***Lars Rornoren Hagen, Jr. Coral Springs, FL **John Gibbs Townsend Charleston, SC \r\nMichael Thomas Hannah Abbeville, SC Stephen Russell Trott Lothian, MD \r\nLarry Joe Haselden, Jr. Johnsonville, SC Courtney Brooke Tyndell Seneca, SC \r\n*John David Hausman Onawa, IA Jonathan Eric Waldrop Pickens, SC \r\n*Travis Kent Hege Rock Hill, SC Jess S. Wallace Glen Ellyn, IL \r\nRyan Christopher Jarrell Spartanburg, SC \r\nComputer Engineering \r\nTanveer Ahmed ___________ Columbia, SC Christopher William Jones __________ York, SC \r\n*David Patrick Beaudreau Simsbury, CT Leonidas Thomas Katsaros Anderson, SC \r\nMarshall Ivan Bowles Blackstock, SC + **Rooparn Bhanu Master Clemson, SC \r\nBryan Lance Bringle Blythewood, SC John Robert McAlpine V Mooresville, NC \r\n*Billy Brandon Brock Westminster, SC +***Matthew Jefferson Miller Pataskala, OH \r\nScott Copley Buchholtz Philadelphia, PA +*Edward Scott Norris Fairfax, VA \r\nDavid J arnes Buckley Pickens, SC Joshua John Page Columbia, SC \r\n*John Carroll Carpenter Chester, SC *Philip Eugene Parker Gaffney, SC \r\n***Justin Cody Church North Wilkesboro, NC Mark Allan Rhodes Anderson, SC \r\n+**Deborah Marie Crosby Greenville, SC Alan Edward Robinson Seneca, SC \r\nLouis Shane Eckley Charlotte, NC *Christopher Andrew Schinke Irmo, SC \r\nWilliam Radcliffe Free III Bamberg, SC John David Seely Bluffton, SC \r\nAllen Coates Gaulden Landrum, SC Thomas Edward Utley Bluffton, SC \r\nRyan Wesley Hanks Spartanburg, SC Dale Anthony Whitchurch St Louis, MO \r\nJeremy Rolland Hudgin Mt Laurel, NJ *Yimin Wu Hilton Head Island, SC \r\n+**William Thomas Jeter ' Summerville, SC \r\nComputer Information Systems \r\nBryce Eugene Anderson --------- Naples, FL Damon Martin Meek __________ Columbia, SC \r\n***Christopher Lee Davis Mauldin, SC Lucinda Marie Morrison Great Falls, SC \r\nTodd Ian Dickerson Duluth, GA *Richard Sharpe Nettles Spartanburg, SC \r\nNirna Fiuzat Clemson, SC Paul John Ott Rowesville, SC \r\n*Andrew Robert Gilbert Horseheads, NY Jessica Lee Plock Sumter, SC \r\nArny Christine Gottko Westfield, NJ ***Andrew Bruce Smith Mechanic Falls, ME \r\nZachary Taylor Hanna Summerville, SC Jason Michael Smith Seneca, SC \r\nDavid Keith Knight Easley, SC Michael Joseph Snyder, Jr. St George, SC \r\nDeAundra Monique Koon Columbia, SC Marjorie Arlene White Anderson, SC \r\n+***Maria Cristina Lander Hartsville, SC \r\nComputer Science \r\nMarla Adzoa Anyorni ---------Columbia, SC +***Scott James Pearson _________ Seneca, SC \r\nMichael David Berryhill Tega Cay, SC Christian Rodriguez Greenville, SC \r\nJason Robert Czarniecki Charleston, SC Glenn George Segelken Summerville, SC \r\nShawn Christopher Dubis Summerville, SC Timothy Graham Smith Greenville, SC \r\nHopi Boyd Jagger Georgetown, SC +*Jesse Horton Sowell II Macedonia, SC \r\nJoseph Robert Jeffcoat Gaston, SC . **Matthew Adam Terry Anderson, SC \r\nAaron Matthew Kluge Greenville, SC Paul Gerard Trepagnier New Orleans, LA \r\nSteven John Mecking Anderson, SC John James Trussell Columbia, SC \r\n***Thomas Leonard Newton Clemson, SC *Parul M. Vernekar Greer, SC \r\nElectrical Engineering \r\nAdam Patrick Baier __________ Pittsburgh, PA Tamesha Nicole Green ________ Mt Pleasant, SC \r\n+*Lee William Brandon Atlanta, GA Samuel David Griffith Greenville, SC \r\nMilon Randal Chapman Lake Toxaway, NC Justin Allen Hames Gaffney, SC \r\nStephanie Rene Chapman Greenville, SC Ryan Antonio Hartley Batesburg, SC \r\n**Timothy John Cobb Greer, SC Chadwick Merritt Hitt Liberty, SC \r\nSantoya Quatae Daniel Belton, SC Nam Trung Huynh Goose Creek, SC \r\nSoumya Dasgupta Charleston, SC Denton Daniel Jarvis Clemson, SC \r\nBrian Allen Despain Plant City, FL Carla Jo Keller Mansfield, OH \r\nTodd Edward Dunn Marietta, GA Ryan Patrick Lentz Mauldin, SC \r\nChristopher Jason Foster Mauldin, SC *Michael Salvador Macias Sumter, SC \r\nSummer Aimsley Fowler Simpsonville, SC Richard Sean McCall Seneca, SC "
    },
    {
        "page_number": "29",
        "text": "Electrical Engineering (continued) \r\nStephen James Petrus _________ Greenwood, SC Hugh Wallace Tinsley III __________ York, SC \r\nJae M. Purvis Columbia, SC Joel Alexander Wade Taylors, SC \r\n**Jeremy Paul Rudbeck Simpsonville, SC **Paul Gehring Walter Summerville, SC \r\nChris Agno San Pedro Charleston, SC *Nicholas Joseph Whitmire Anderson, SC \r\n*John David Strait III Blythewood, SC \r\nIndustrial Engineering \r\nChristopher Brandon Bardett ______ Alpharetta, GA James Richard Matthews _________ Union,-'SC \r\nMary Ellen Bolin Charleston, SC Robert Lloyd Niday Simpsonville, SC \r\nSandra Maria Childs Ladson, SC Reginald Warren Sauls Moncks Corner, SC \r\nFrederick Glover Choate Devon, PA Carrie Nichole Seger · Fort Mill, SC \r\nTawanna Leshe Farr Greenville, SC David Michael Smith Summerville, SC \r\nRodney Darrell Hannah Bishopville, SC Johanna Brooke Stackley York, SC \r\nKylie Deborah Hislop Jacksonville, NC Fletcher Bruce Vanyo Somerset, PA \r\nMatthew Christopher Jiron Conway, SC Scott Edward Wages Alexandria, VA \r\nDrew Daniel Johnson Conway, SC Paul Clayton Wright Anderson, SC \r\nMathematical Sciences \r\n**Robert Michael DiGiuseppe _____ Charleston, SC *Jessica Ann Pursley _________ Champaign, IL \r\n*Carol Ann Janowsky State College, PA \r\nMechanical Engineering \r\n*Andrew Paul Aubin _________ Keeseville, NY Joseph Ernest Law -----------Aiken, SC \r\nJametta La'Shay Black Varnville, SC Eric A. Leeds Marietta, GA \r\nDarby Ryan Blanton Gaffney, SC **Aaron Parkin Leininger Rocky Mount, NC \r\nTremelle La Shon Caldwell Newberry, SC +***Robert Miles MacMeccan III Richmond, VA \r\nDavid Ray Carpenter Franklin, NC Ryan Scott Moore Greensburg, PA \r\n*Jason Michael Cianfrani Somerdale, NJ *Christopher Todd Morrison Powdersville, SC \r\nDavid Edward Domnisch Pamplico, SC David Shawn Morrow Pendleton, SC \r\nCurtis Charles Easler Chapin, SC \r\nWesley Ryan Edwards Florence, SC \r\nTravis Franklin Murphy Greenwood, SC _ \r\nJohn Larsen Neumeister Orangeburg, SC \r\nBrent Lyle Erickson Glen Mills, PA Michael Patrick O'Neal Anderson, SC \r\nAndrzej M. Franczak Wroclaw, Poland John Dean Ridings Spartanburg, SC \r\nCory Lee Friedman Charleston, SC *Allen Arthur Rogers Spartanburg, SC \r\n*Kelly Adam Friedman Charleston, SC Peter James Shepherd Summerville, SC \r\nBrian Thomas Gause Kingstree, SC James Anthony Shirley Bishopville, SC \r\nScott James Gerace Pearl River, LA +***Andrew David Sommers Richmond, VA \r\nJames Ryan Hill Simsbury, CT *John Carlt<;>n Sosebee Greenville, SC \r\nAudrey Michele Hooper Mauldin, SC Jeffrey Todd Stover Greenville, SC \r\nChihping Hsu Florence, SC James Edward Walton III Columbia, SC \r\nRobert I. Jeyachandran Colombo, Sri Lanka Michael Wayne Williamson Marion, SC \r\nCameron L. Kerr Clemson, SC Sungpil Yi Parsippany, NJ \r\n*David Keith Kuklewicz Damascus, MD \r\nPhysics \r\n+*Paola Nidia Alboni _________ Wellford, SC *John Michael Cook _________ Fort Mill, SC \r\n+***Holly LeAnn Bowen Brentwood, TN *Robert Edward Flandry III Spartanburg, SC \r\nTextile Chemistry \r\n**Travis Wayne Baughman ------- Columbia, SC *Philip J. Schmidt __________ Greenville, SC \r\nDallas Hugh Burnett New Prospect, SC Angela Jane Siegel Tega Cay, SC \r\nTextile Management \r\nLaura Marie Allen---------- Columbia, SC Cameron Wylie Hamrick ________ Gaffney, SC \r\n*Danielle Renee Germann Columbia, SC Jeffrey Scott Tankersley Mauldin, SC \r\nTextile Science \r\nGeorge Edwin Godbee III ______ North Augusta, SC *Farzad Nazir----------- Lahore, Pakistan \r\nSyed Abid R. Kazmi Karachi, Pakistan \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nHAROLD ERNEST CHEA THAM, DEAN \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\nDawn Elizabeth Berlew ________ Gambrills, MD *Jenna Leeanne Henson ________ Greenville, SC \r\n*Laney Brooks Brant Columbia, SC Susan Marie League Starr, SC \r\n***Linda L. Bums Clemson, SC *Nicole Michele Leonardi Piedmont, SC \r\n*Yolanda Bree Carter Easley, SC Leigh Elizabeth McGeary Webster, MA \r\nAnna Kathleen Creech Wedgefield, SC Margaret Jean Moore Noblesville, IN \r\nJulia Helen Davis Dalzell, SC **Joni Leigh O'Dell Enoree, SC \r\nJulia Elizabeth Evans Greenville, SC Jennifer Hope Parham Greenville, SC \r\nJessica Carey Griggs Florence, SC Anna Maria Parnell Bishopville, SC \r\nKelli Ann Hardin Greenville, SC Bailey Anne Perkins Overijse, Belgium "
    },
    {
        "page_number": "30",
        "text": "Early Childhood Education (continued) \r\n*Gregory Mark Solarek _______ Murrell's Inlet, SC Ann Elizabeth Tucker _________ Roswell, GA \r\nBrantley Mayer Stallworth Columbia, SC Allison Lynn White Cleveland, GA \r\nKaty Suzanne Stanton Greenville, SC Johanna Lee Williams Landrum, SC \r\n**Teresa Danielle Stewart Starr, SC *Anna Louise Wilson Mt Pleasant, SC \r\n*Sharie Elizabeth Stickles Elloree, SC Kristin Elise Woods Mt Pleasant, SC \r\nKatherine Nell Timmerman Greenville, SC Megan Ann Wynne Gainesville, FL \r\nLisa Jo Tortorici Charleston, SC Kelly Susan Zimmel Winston-Salem, NC \r\nElementary Education \r\n***Julie Ann Adkins ____________ York, SC *Carol Fricks Massey __________ Walhalla, SC \r\nMeghan Jean Ammerman River Vale, NJ *Amy Leigh Mattison Spartanburg, SC \r\n*Beth Jaclyn Balesteri Monterey, CA Ashley Elizabeth Maxie Six Mile, SC \r\nDana Lynn Ballentine Aiken, SC *Kelly Erin McGee Norcross, GA \r\nLauren Rachael Ballington Columbia, SC Claudia Lynn McJunkin Pickens, SC \r\n+**Kristen Ann Berardi Tega Cay, SC Maya Ursula Mehanna Charlottesville, VA \r\n*Katherine Lynne Brueckner Madison, NJ Stacey Ann Miller St Augustine, FL \r\nRebekah Alyson Burdette Mauldin, SC ***Lauren Ann Miner Fort Mill, SC \r\nJennifer Lynne Callaham Anderson, SC *Bradley Thomas Moore Greenville, SC \r\nCorinne Leigh Carroll Pound Ridge, NY Christine Elizabeth Moore Columbia, MO \r\nMeghan Ann Carroll St Matthews, SC Sarah Jo Moose Pendleton, SC \r\n*Jennifer Eichel Cato Aiken, SC **Brooke Helene-Teresa Morra Dover, DE \r\nCarrie DuPre Cochran Anderson, SC **Erin Leigh Moss Abbeville, SC \r\nHelen Ansley Coker Sumter, SC Carrie Marie O'Brien Lilburn, GA \r\n**Casey Lane Corn Spartanburg, SC Kimberly Megan O'Connor Madison, CT \r\nJulie Marie Crawford Sumter, SC *Sara Elizabeth Odom Darlington, SC \r\n**Tracy Tallant Cubbison Spartanburg, SC Paul Jorge Oliveira Middletown, NJ \r\n**Megan Elizabeth Easty Beaufort, SC **Miranda Brooke Oprea Aiken, SC \r\nLisa Marie Emmerling Bethel Park, PA Kimberly Kaye Pendergraft Lake City, SC \r\nJohn Jamal Wilson Evans Camden, SC *Christine Noelle Piscitelli Howell, NJ \r\n+**Crystal Dawn Fanning Orangeburg, SC Brandy Jade Powell Walhalla, SC \r\nBonnie Lea Felder Summerton, SC ***Natalie Ann Rabalais Lafayette, LA \r\n*Emily Elizabeth Figart Lancaster, PA *Jennifer Dianne Ray North Charleston, SC \r\nMacey Stanton Gilbert Florence, SC *Allison Kay Rickard Sumter, SC \r\nDana Frances Gilleland Six Mile, SC **Rachel Marie Rosborough Blackstock, SC \r\n*Lindsay Hope Graves Greenville, SC **Janet Katherine Sealey Chapin, SC \r\nEllen Lorayne Hall Bethune, SC Lori Elizabeth Sellers Belton, SC \r\nCourtney Carol Hodges Bennettsville, SC Elizabeth Marie Senneca Huntington, NY \r\nJohn Gabriel Hollingsworth Anderson, SC Kristy Trevino Smith San Antonio, TX \r\nWinston Eric Holton Thomasville, GA *Lisa Anne Stanley Florence, SC \r\n*Eliza Daphine Howell Spartanburg, SC Michael Bradley Sutton Whitmire, SC \r\nAllison Sue Jaffe South Setauket, NY Virginia Rebecca Taylor Mt Pleasant, SC \r\nMichael Lemark Jenkins Wando, SC Tamara Elizabeth Thomas Spartanburg, SC \r\nMeredith Frances King Turnersville, NJ *Cameron David Thorstad Aurora, CO \r\n*Laura Lynn Kitchens Edgefield, SC John Haig Timmins Warren, OH \r\nAmy Jo Klaren Seneca, SC Danielle Christine Trickett Darnestown, MD \r\nBrandon O'Neal Koon Prosperity, SC *Carrie Melissa Warren Catawba, SC \r\n***Kelly Ann Kreitzer Summerville, SC Margaret Grace Westerlund Westminster, CO \r\nKirsten Anne Kuhlmann Columbia, SC *Lindsey Anne Widerman Cherry Hill, NJ \r\n***Diane Page Lewis Greer, SC *Nina Nicole Williams Myrtle Beach, SC \r\n*Amy Catherine Long Landrum, SC *Rebecca Copeland Williams Laurens, SC \r\n*Julie Denise Long Newberry, SC ***Allison Carter Yoder Lancaster, SC \r\nSecondary Education \r\nCharles Tyrone Allen ________ Ontario, Canada Jessica Marie Miragliuolo ---------Bangor, ME \r\nBrad Alan Batson Greenville, SC *Summer Nicole Muzika North Myrtle Beach, SC \r\nJessica Lauren Clarke Cobleskill, NY *April Beth Pierce Columbia, SC \r\nCourtney Elizabeth Espen Milwaukee, WI Brian Edward Rietveld Lugoff, SC \r\nAshley Stott Gosnell Landrum, SC Andreas Westergaard IV Charleston, SC \r\nTyrone Michael Harris Middlebrook, VA *Jerry Lewis Williamson, Jr. Greenville, SC \r\n*Andrew Michael Heck Austin, TX Sherita Lavon Wilson Cross, SC \r\nDanette Maryce Hulse Anderson, SC *Christine Renee Wright Greenville, SC \r\nJustin Keith McCormick Dunn, NC ***Kyle Mclendon Young Clemson, SC \r\nSpecial Education \r\n*Mary Jo Baier _____________ Milford, NJ *Heather Beth Kozlowicz ________ St Louis, MO \r\nJoye Catherine Frady Greenville, SC Elise Katherine Natale Berwyn, PA \r\nDanielle Marie Goetz Pittsburgh, PA **Joanna Frances Ronecker Pittstown, NJ \r\nAaryn Rachel Groves Avon, CT Erica Kathleen Schreiber Lexington, SC \r\nSarah Christine Hasty Cassatt, SC *Emily Shelton Steele Lilburn, GA \r\nLindsay Lang Hogon Sumter, SC *Keleen Marie T eramano Greenville, SC \r\nKathryn Lynn Honea Walhalla, SC Jessie Thomas Williams Florence, SC \r\n*Charlotte Cayton Jones Florence, SC \r\nDOUBLE MAJOR \r\nEnglish and Secondary Education \r\nChristina Elaine Davenport Greenwood, SC "
    },
    {
        "page_number": "31",
        "text": "BACHELOR OF SCIENCE \r\nHealth Science \r\n*Jennifer Leigh Badia _________ Shadyside, OH **Lacey Kaselle Mcllwain _________ Greer, SC \r\nKeisha Loretta Barr Kingstree, SC **Jessica Diane Millender Greenwood, SC \r\nMatthew Hawkins Behr Holly Hill, SC Seiler Caswell Purdy South Portland, ME \r\nMichael Donald Beres Lexington, SC Allison Leigh Reynolds Columbia, SC \r\nAshlee Nicole Carmichael Seneca, SC Mikel Anne Rowland Belton, SC \r\nKatie Elizabeth Davis Clemson, SC Steven Robert Sattazahn Palmyra, PA I \r\n**Rachel Claire Egner Glenside, PA · *Nicole Marie Seiler South New Berlin, NY \r\nShawna Leali Erwin Sumter, SC Katherine Elizabeth Shackson Centreville, VA \r\nDevon Corine Farrington Ewing, NJ ***Amy Katherine Staggs Johnson City, TN \r\nJennifer Leigh Flynn Westport, CT Margaret Virginia Stith Mt Pleasant, SC \r\n**Melanie Elizabeth Haddock Kingstree, SC **Lara Elizabeth Stokes Lugoff, SC \r\nBenjamin Raymond Hess Cincinnati, OH *Theresa Nolasco Valdez Goose Creek, SC \r\nKatie Amanda Howe Hanover, PA Brian Patrick Wade Jacksonville, FL \r\nLindsey Anne Lopanik Charleston, SC Jason Rick Wilson Greenville, SC \r\nIndustrial Education \r\nJames Seldric Blocker ---------Columbia, SC Kelcey Damon Hatcher ______ Fort Washington, MD \r\nTerry Michael Bryant Savannah, GA Jason Dexter Holloman Decatur, GA \r\nJames Edward Dent Lewisburg, PA William Chapell Laffoday, Jr. Charlotte, NC \r\nRoderick Farlando Gardner Jacksonville, FL Bradley James LeCroy Walhalla, SC \r\nMathematics Teaching \r\n+**Courtney Paige Hartle _______ Lexington, SC \r\nNursing \r\nBenita Rae Alley __________ Honea Path, SC \r\nMary Katherine Arrington Greenville, SC \r\nTerri Alicia Ballew Landrum, SC \r\nJennifer Lyn Berry Mt Pleasant, SC \r\nTeresa Hurt Berry Saluda, SC \r\n**Pamela Michele Bouknight Batesburg, SC \r\n+*Dava Susan Bowers Cayce, SC \r\nKyndra Ashanta Brown Edgewood, MD \r\n*Miranda Jill Burroughs Laurens, SC \r\n**Emily Frances Campbell Columbia, SC \r\nMeghann Judith Cantey Summerville, SC \r\nChristina Anne Cartlidge Anderson, SC \r\n*Dana Lynn Clements Duluth, GA \r\n+**Allison Louise Collins Pamplico, SC \r\n+**Carrie Margaret Compton Lexington, SC \r\nJennifer Brooke Davis Belton, SC \r\n*Ashley Elizabeth Delores Dom Pelzer, SC \r\nJulie Marie Dom Lexington, SC \r\nRachel Theresa Fitten Annapolis, MD \r\nAmanda Evans Forrest Anderson, SC \r\nJessica Susan Garland Walhalla, SC \r\nCraig J. Garst II Clemson, SC \r\n+*Shelley Renee Gaskins Cheraw, SC \r\nJameson Blythe Greiner Long Creek, SC \r\nAlana Michelle Harbin Anderson, SC \r\n+**Kibble Lynn Harris Salisbury, MD \r\nMichael Joseph Hemmert Easley, SC \r\nJennifer Lynn Huber Lexington, SC \r\nJoanna Campbell Hunter Columbia, SC \r\nCarissa Faith James Greenville, SC \r\nLatasha Shantell Johnson -------Blackville, SC \r\n*Christopher Bryan Kennedy-Fleming Belton, SC \r\nCrystal Sue Kim Westminster, SC \r\n+**Naomi Flo Kip linger Charleston, SC \r\nYolanda English Livingston West Columbia, SC \r\n+**Krista Leigh Lord Snellville, GA \r\nElaina Stellette McAdams Due West, SC \r\nCarol Lynn Mention Hemingway, SC \r\n+*Kathryn Suzanne Mitchell Beaufort, SC \r\nJanna Joyce Moore Walterboro, SC \r\nMegan Teresa O'Connor Fulton, MD \r\n**Leesa Alethea Oliver Salem, SC \r\nLara Dawn Osewalt New Brighton, MN \r\nErica Yolanda Pickett Columbia, SC \r\nDenise Anita Porterfield Fountain Inn, SC \r\nRegan Alexandra Rouse Mt Pleasant, SC \r\nMonica Jill Schlott Summerville, SC \r\nAshley Renee Schroeder Annapolis, MD \r\nSumer Diane Shirley Belton, SC \r\nTracy Lynn Simons North Augusta, SC \r\nCarolyn Leigh Sinclair Columbia, SC \r\nAmy Elizabeth Sobczyk Westminster, SC \r\n**Kristen Elizabeth Swartout Easley, SC \r\n*Leigh Ann Tabor Greenville, SC \r\nJason Richard Thrift Anderson, SC \r\nJennifer Dawn Turner Evington, VA \r\nTamika Denise Whitner Moore, SC \r\nMegan Anne Wuestefeld Westmont, NJ \r\nJamekia Kotecha Young Spartanburg, SC \r\nParks, Recreation, and Tourism Management \r\nRyan Nelson Anderson _________ Fort Mill, SC \r\nWesley Ryan Andrews Florence, SC \r\nSarah Camak Bednar Greenville, SC \r\nAva Christy Braswell Pendleton, SC \r\nAmy Lynn Lafrance Cooper Wagener, SC \r\n*Kelly Maureen Cox Mauldin, SC \r\nErin Darcy Earl Greenville, SC \r\n*Sara Fulbright Echols Rock Hill, SC \r\n*Geoffrey Creighton Eddings Camden, SC \r\nMargaret Heath Etheredge Columbia, SC \r\nJonathan Wright Fleming New Zion, SC \r\nElizabeth Anne Fulmer Beaufort, SC \r\nMark John Gaglione Harrison, NY \r\nVirginia Michele Georgian Spartanburg, SC \r\nKenneth Steven Gustafson, Jr. Charleston, SC \r\n**Mandy Elizabeth Hemingway Mt Pleasant, SC \r\nJohn William Irvin Easley, SC \r\nRobert Brennen Kin Aiken, SC \r\nEvelyn Wallace Lancaster Spartanburg, SC \r\nHappy Nick Lempesis III _______ Charleston, SC \r\n+***Jennifer Leigh McGinnis Greensboro, NC \r\nHeather Daphanee McKinney Lyman, SC \r\nDavid Shannon McMillan Bamberg, SC \r\nShara Elizabeth Merritt Irmo, SC \r\nSuzanne Christine Morton Summerville, SC \r\nJennifer Leigh Pamelle Charleston, SC \r\nReed Walton Patterson Gaffney, SC \r\nJonathan Hugh Peel Newberry, SC \r\nLindsey Robertson Propes Columbia, SC \r\nMary Hampton Purser Greenville, SC \r\nWilliam Porter Robinson Spartanburg, SC \r\nJerad Thompson Smith Scottsdale, AZ \r\n**Chad Alan Speck Nashville, TN \r\n*Robert Larry Taylor II Seneca, SC \r\n***Bradford Dorman Wade Aurora, CO \r\nJennifer Leigh Wade Columbia, SC \r\n*Megan Marie Wadford Columbia, SC \r\n**John Craig Walters Clemson, SC "
    },
    {
        "page_number": "32",
        "text": "Parks, Recreation, and Tourism Management (continued) \r\nKevin Scott Wedgworth-------- Wellington, FL Kelly Elizabeth Wragg ____________ Ira, VT \r\nPre-professional Studies \r\n***Leslie Rebecca Brewer ________ Allendale, SC \r\nScience Teaching \r\nJames Harley Heyward, ________ Bennettsville, SC Sean Padrick Vick ___________ Clinton, SC \r\n*Cara Jayne McDaniel Batesburg, SC \r\n*Cum laude: A grade point ratio of 3.40 to 3.69 \r\n**Magna cum laude: A grade point ratio of 3. 70 to 3.89 \r\n***Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\n+Departmental Honors: The graduates so designated have completed an enriched program of study designed by their departments with the approval of the Calhoun \r\nCollege Honors Program. To cam Departmental Honors students must complete an honors thesis and/or other upper division honors courses, while maintaining \r\nan overall grade-point ratio of 3.40 or higher. Departmental Honors graduates appear in the line of march wearing the Calhoun College Honors Medallion on an \r\norange and purple ribbon. This medallion is made possible by an endowment established by Mrs. Katherine Inabinet Vickery of Columbia, South Carolina, to \r\nhonor the memory of her husband and Clemson graduate, the late B. C. Inabinet. \r\nStudents wearing the white stoles over their gowns are members of honorary societies that require a minimum 3.00 grade point ratio for membership. The stoles \r\nhave the University seal embroidered on one side, and on the other side are the emblem(s) of honorary societies in which the student is a member. "
    },
    {
        "page_number": "33",
        "text": "Awards \r\nNORRIS MEDAL \r\nFirst awarded at Clemson University in 1908, the Norris Medal was established under the terms \r\nof the will of the Honorable D. K. Norris, a life trustee of this institution. The medal is given each \r\nyear to the graduating student who, on the basis of exceptional scholastic achievement and leadership \r\nability, is judged by the University Scholarships and Awards Committee to be the best all-around \r\nstudent. \r\nAll recipients of the Norris Medal have their names affixed to a bronze plaque mounted at the \r\nfront entrance of Sikes Hall. \r\nRECIPIENT OF THE NORRIS MEDAL \r\nRITA KYLEEN BOLT \r\nAnderson, SC \r\nALGERNON SYDNEY SULLIVAN AWARD \r\nThe Sullivan Award is given annually to individuals who possess the characteristics of heart, \r\nmind, and conduct as evince a spirit of love for and helpfulness to other men and women. These \r\nhumanitarian qualities are exhibited in the following recipients. \r\nRECIPIENT OF THE ALGERNON SYDNEY SULLIVAN CITIZEN AW ARD \r\nCHARLIE R. WHITE, JR. \r\nClemson, SC \r\nRECIPIENTS OF THE ALGERNON SYDNEY SULLIVAN STUDENT AW ARD \r\nMOHAMED W AGIH ABDEL-KADER \r\nClemson, SC \r\nHEIDI MARIE COOPER \r\nClemson, SC \r\nALUMNI MASTER TEACHER AWARD \r\nThis award is presented by the Clemson Alumni Association for distinguished achievements in \r\nclassroom teaching. The faculty recipient is selected by the Student Alumni Council from \r\nnominations submitted by students. A bronze plaque is presented permanently to the recipient and \r\nthe award carries with it a stipend of fifteen hundred dollars. \r\nRECIPIENT OF THE ALUMNI MASTER TEACHER AW ARD \r\nA. DENNY SMITH \r\nFACULTY SCHOLARSHIP AWARD \r\nEstablished at Clemson University in 1959, this award is made annually by the faculty of \r\nClemson University to the member of the graduating class who has the highest scholastic \r\nachievement. All graduates who have completed the requirements for the bachelor's degree since the \r\nlast commencement exercise and who have completed at Clemson at least 7 5 percent of the work \r\nrequired for graduation shall be eligible for consideration. \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AW ARD \r\nHEIDI MARIE COOPER \r\nClemson, SC \r\nJULIA ELIZABETH DUBNANSKY \r\nSaxonburg, PA \r\nKEVIN PA TRICK EUDY \r\nCharlotte, NC \r\nASHLEY LOVE FARR \r\nAugusta, GA \r\nBETH ALISON GADKE \r\nOrange, OH \r\nASHLEY LAUREN GOWER \r\nFlorence, SC \r\nPAMELA KYLENE ORA VLEY \r\nClemson, SC \r\nELIZABETH KA THERINE HARRIS \r\nFredericksburg, VA \r\nMARIA CRISTINA LANDER \r\nHartsville, SC \r\nDIANE PAGE LEWIS \r\nGreer, SC \r\nROBERT ?\\1ILES ~IACMECCAN III \r\nRichmond, VA \r\nMATTHEW JEFFERSON MILLER \r\nPataskala, OH \r\nLAUREN ANN MINER \r\nFort Mill, SC \r\nSCOTT JAMES PEARSON \r\nSeneca, SC \r\nZACHARIAH LEE RIDDLEY \r\nColumbia, SC \r\nCHRISTOPHER DONALD SEMESKY \r\nBaltimore, MD \r\nSARAH THOMPSON SLOAN \r\nMarion, SC \r\nAMY KA THERINE STAGGS \r\nJohnson City, TN \r\nGLORIA BETH TA TE \r\nTaylors, SC \r\nEl_iGENIA D l\\ P RINGTON WOOTEN \r\nClcms•,•n, SC \r\nALLISON CARTER YODER \r\nLancaster. SC \r\nSALLY MICHELLE ZEIGLER \r\nWilliston, SC "
    },
    {
        "page_number": "34",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green Clemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the \r\nRoyal School of Mines in Paris (1828-1832). His early profession was that of a \r\nmining engineer; however, circumstances diverted his interests into politics \r\nand the life of a southern planter, and he soon became an enthusiastic advocate \r\nof scientific agriculture. He had a career as a diplomat (charge d'affaires to \r\nBelgium, 1844-1852) and served as the first Superintendent of Agricultural \r\nAffairs in Washington (1860). As a scientist he published numerous articles in \r\nthe fields of mining, ·chemistry and agriculture. His varied activities included \r\nhis assistance in the founding of the Maryland Agricultural College, his support \r\nof the Morrill Act, his leadership in South Carolina after the Civil War, and \r\nhis part in founding Clemson University. \r\nThomas Clemson was the son .. in .. law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two four .. year \r\ncurricula, supplemented by two two .. year preparatory courses. Today the \r\nUniversity has six major academic units. These are the College of Agriculture, \r\nForestry, and Life Sciences, the College of Architecture, Arts, and Humanities, \r\nthe College of Business and Public Affairs, the College of Engineering and \r\nScience, the College of Health, Education, and Human Development, and the \r\nGraduate School. \r\nThe institution is an accredited member of the Southern Association of \r\nColleges and Schools; various curricula are accredited by the Accreditation \r\nBoard for Engineering and Technology, American Assembly of Collegiate \r\nSchools of Business, American Council for Construction Education, American \r\nSociety of Landscape Architects, Computing Science Accreditation Board, \r\nHuman Factors and Ergonomics Society, International Association for \r\nManagement Education, National Architectural Accrediting Board, National \r\nAssociation of Industrial Technology, National Association of State Directors \r\nof Teacher Education and Certification, National Council for Accreditation of \r\nTeacher Education, National League for Nursing, Pla~ning Accrediting Board, \r\nand Society of American Foresters. \r\nClemson is a land .. grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is \r\nalso heavily committed to a varied program of public service, including the \r\nwork of agricultural extension which has professional personnel located in each \r\nof the State's counties. "
    },
    {
        "page_number": "35",
        "text": "CLEMSON ALMA MATER \r\nA. C. Corcoran, '19 \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. · \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\n' \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "36",
        "text": "Note: Candidates appearing in this program are not certified graduates. Likewise, \r\nacademic honors designations are based upon performance prior to final grades. Both \r\ncertification of graduation and honors designations must come from the Registrar of \r\nthe University. \r\n********** \r\nFirst Aid A First Aid Station is located at Portal 0. \r\nEvacuation System Littlejohn Coliseum is equipped with a fire alarm evacuation \r\nsystem. In the event of activation, as noted by sustained horns and strobe lights, \r\nplease proceed to the closest available exit. Remain outside the building until fire \r\nofficials deem the building safe to re--enter. \r\nNo Smoking Smoking is prohibited in the seating area of Littlejohn Coliseum. \r\nCigarette receptacles are provided around the outer concourse. \r\n• "
    },
    {
        "page_number": "37",
        "text": ". HUHiiLL \r\n~~ \r\n(1~ (U' "
    }
]