[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n5-1-2003\r\nClemson Commencement Program, May 2003\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, May 2003\" (2003). Clemson Commencement Programs. 220.\r\nhttps://tigerprints.clemson.edu/comm_programs/220"
    },
    {
        "page_number": "2",
        "text": "One Hundred Seventh Commencement \r\nMay 9, 2003 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "CEREMONIAL MUSIC \r\nDEPARTMENT OF PERFORMING ART~ \r\nPre-Ceremony Music \r\nManhattan Beach March - John Philip Sousa \r\nClemson University Symphonic Band, Conducted by Dr. Mark Spede \r\nHigher and Higher - Wilson/arr. Herndon \r\nImpulse, Directed by Dr. Dan Rash \r\nEnglish Folk Song Suite - Ralph Vaughn Williams \r\nI. March: \"Seventeen Come Sunday\" \r\nII. Intermezzo: \"My Bonny Boy\" \r\nIII. March: \"Folk Songs from Somerset\" \r\n\"Jupiter\" from The Planets - Gustav Holst \r\nClemsoh University Symphonic Band, Conducted by Dr. Mark Spede \r\nOde to Clemson - McGarity/arr. Conley \r\nImpulse, Directed by Dr. Dan Rash \r\nProcessional Music \r\nFlourish for Wind Band - Ralph Vaughn Williams \r\nPomp and Circumstance, Op. 39 - Edward Elgar \r\nMusical . Interlude \r\nClemson University Symphonic Band, Conducted by Dr. Mark Spede \r\nSavannah River Holiday - Ron Nelson \r\nClemson University Alma Mater - Farmer and McGarity/arr. Freeman \r\nImpulse, Directed by Dr. Dan Rash \r\nRecessional Music \r\nFlourish for Wind Band - Ralph Vaughn Williams \r\nCongratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for individual \r\ngraduates. Such expressions frequently detract from the recognition due the \r\nnext graduate in line. Your cooperation is respectfully requested. "
    },
    {
        "page_number": "4",
        "text": "9:30 A.M. \r\nGraduation \r\nFriday, May 9, 2003 \r\nLittlejohn Coliseum \r\nORDER OF CEREMONIES \r\n2:30 P.M. \r\n(Audience will please stand as faculty and candidates march in and \r\nremain standing for the invocation.) \r\nInvocation \r\nRicky A. Bussey, Student Representative \r\nDeborah L. West, Student Representative \r\nIntroduction of Trustees \r\nPresident James F. Barker \r\nConferring of Honorary Degree \r\nPresident James F. Barker \r\nReflections \r\nThe Honorable David H. Wilkins (A. M. ceremony) \r\nAnne Snipes (P.M. ceremony) \r\nRecognition of the Deans of the Colleges \r\nVice President for Academic Affairs and Provost \r\nDoris R. Helms \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident James F. Barker \r\nRecognition and Presentation of Awards \r\nNorris Medal \r\nAlgernon Sydney Sullivan Award \r\nAlumni Master Teacher Award \r\nFaculty Scholarship Award \r\nSymphonic Band \r\nImpulse \r\nDr. N. Dwight Camper, University Marshal \r\n• "
    },
    {
        "page_number": "5",
        "text": "BOARD OF TRUSTEES \r\nLawrence M. Gressette, Jr., Chairman. __________ Columbia \r\nLouis B. Lynn, Vice Chairman Columbia \r\nBill L. Amick Batesburg--Leesville \r\nJ. J. Britton Sumter \r\nLeon J. Hendrix, Jr. Kiawah Island \r\nThomas C. Lynch, Jr. Clemson \r\nPatricia H. McAbee Greenwood \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick III Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nWilliam C. Smith, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nTrustees Emeriti \r\nLouis P. Batson, Jr. -~~~~~~~~~~~~~~~Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW. G. DesChamps, Jr. Bishopville \r\nHarold D. Kingsmore Aiken \r\nPaul W. McAlister Laurens \r\nPaul Quattlebaum, Jr. Charleston \r\nD. Leslie Tindal Pinewood \r\nAllen P. Wood Florence \r\nExecutive Secretary to the Board of Trustees \r\nand Executive Assistant to the President \r\nJ. Thornton Kirby \r\nADMINISTRATIVE OFFICERS \r\nJames F. Barker President \r\nDoris R. Helms Vice President for Academic Affairs and Provost \r\nBenjamin W. Anderson General Counsel \r\nA. Neill Cameron, Jr. Vice President for Advancement \r\nAlmeda R. Jacks Vice President for Student Affairs \r\nJohn W. Kelly Vice President for Public Service and Agriculture \r\nScott A. Ludlow Chief Business Officer \r\nLawrence Nichols II Chief Human Resources Officer \r\nTerry Don Phillips Director of Athletics \r\nChristian E. G. Przirembel Vice President for Research "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nDAVID H. WILKINS \r\nDOCTOR OF HUMANITIES \r\nThe Honorable David H. Wilkins, speaker of the S.C. House of Representatives, is a \r\nremarkable statesman and consensus builder. Described as a \"fair and visionary political \r\nleader\" and a \"man of impeccable character and integrity,\" he represents the finest \r\nqualities gained from his Clemson experience. \r\nThe Greenville native attended Clemson on a full athletic scholarship and earned a \r\nbachelor's degree in history in 1968. A distinguished military graduate, he went on to study \r\nat the University of South Carolina School of Law, earning a J .D. in 1971. After a stint in \r\nthe U.S. Army, he returned to Greenville where he has practiced law for more than 30 \r\nyears. \r\nWilkins has served as speaker of the S.C. House of Representatives since December 1994. \r\nHe was the first Republican.-elected speaker of any state legislative body in the South since \r\nReconstruction. He began his legislative career in 1981 and quickly rose through the ranks \r\nin the House of Representatives, serving six years as chairman of the Judiciary Committee \r\nand two years as speaker pro tern. \r\nIn his 23 years in the Legislature, Speaker Wilkins has been on the cutting edge of most \r\nmajor reform initiatives. He wrote or co.-sponsored the legislation on welfare reform, \r\nproperty tax relief, education accountability, LIFE scholarships, judicial reform, \r\ngovernment restructuring and truth.-in.-sentencing. He was also instrumental in crafting \r\nSouth Carolina's historic ethics bill and played a key role in the fight to ban video \r\ngambling. He currently is leading a coalition to allow the state's research universities to \r\nincrease their research capability. \r\nSpeaker Wilkins has received numerous awards including being named the first recipient \r\nof both the David Eckstrom Leadership Award by the S.C. Republican Party in 2001 and \r\nthe Terry Haskins' Memorial Award. He received the 2001 Distinguished Service Award \r\nfrom the S.C. Association of Counties, the 2000 Palmetto Leadership Award by the S.C. \r\nPolicy Council and the 2000 Legislator of the Year by the S.C. Realtors Association. He \r\nhas been named Outstanding Legislator of the Year by a wide range of organizations. \r\nSpeaker Wilkins is past president of the National Speakers' Association and past chairman \r\nof the Southern Legislative Conference. In 2002, President George W. Bush appointed \r\nSpeaker Wilkins to the Board of Visitors of the U.S. Military Academy at West Point. \r\nClemson University holds Speaker David Wilkins' achievements and service to the people \r\nof South Carolina in the highest regard and wishes to express its deep and sincere \r\nappreciation for all he has done for this University through his years of service in the \r\nLegislature. In recognition of this and all he has meant to the citizens of South Carolina, \r\nClemson University presents the honorary degree, Doctor of Humanities, to Speaker David \r\nWilkins. \r\n• "
    },
    {
        "page_number": "7",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, \r\na senior faculty member, with the college baton, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the \r\nAmerican Council on Education, are as follows: \r\nCollege \r\nAgriculture, Forestry, and Life \r\nSciences \r\nArchitecture, Arts, and \r\nHumanities \r\nBusiness and Behavioral Science \r\nEngineering and Science \r\nHealth, Education, and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and Orange \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitecture \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocial Sciences \r\nLibrary \r\nAcademic Support \r\nInstruction \r\nCollegiate faculty follow their marshal in order of academic rank wearmg academic \r\ncostumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United States wear costumes specified by the awarding institutions. \r\nThe . academic costumes of faculty whose degrees are from United States' institutions are \r\nspecified by a uniform code maintained by the American Council on Education. Caps are \r\nblack and are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels \r\nusually of metallic thread; other degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell, like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is to replace black velvet \r\nwith velvet in the discipline color. A second variation is a colored gown usually of the \r\nuniversity's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awarding \r\ninstitution. First, degree level is signified by the size of the hood with bachelors' smallest, \r\nmasters' larger, and doctors' quite large and of a different shape. Clemson does not award \r\nhoods to bachelors. The width of the velvet trim also conveys the degree. Secondly, the \r\ndegree is indicated by the color of the trim edging the hood to form the throat over the gown. \r\nThe most frequently seen is dark blue, which designates the doctor of philosophy (Ph.D.) \r\ndegree. Finally, the color of the hood's lining specifies the awarding institution. The colors \r\nare displayed in combinations that are drawn from heraldry. Notice that the Clemson \r\nUniversity hood is lined with purple through which is an orange chevron (a \"V\"). Although \r\nmany combinations are duplicated by dozens of institutions, Clemson is presently the only \r\ninstitution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastical, or military \r\nregalia as set forth by their professions. They are preceded by the University Marshal. Clad \r\nin a gown of office in gold and purple, the marshal wears no hood and bears the University \r\nmace. At the ceremony's close, the faculty do not exit as a part of the recessional but are \r\ndismissed, along with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "8",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present at any convocation where the University, \r\nthrough its delegated members, is acting officially. At any official convocation \r\nsuch as commencement, the University Marshal, carrying the mace, precedes \r\nthe President into the assembly. The mace rests before the President's chair or \r\nspeaker's stand throughout the ceremony, and its removal from the assembly at \r\nthe close of a convocation is symbolic of the official withdrawal of the \r\nUniversity and, thus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic \r\nclublike shape, however, is much more ancient, probably going back to man's \r\nprehistory. It is made of walnut wood and silver, with the seal of the University \r\nin gold and the University colors represented by insets of carnelian (orange) \r\nand amethyst (purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic · of the authority vested in the \r\noffice of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the whole \r\nbody of the institution. Clemson's chain and seal are made of silver and gold, \r\nand carnelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most \r\nacclaimed goldsmiths of our era. The enamel plaques for the batons were \r\nexecuted by the late Professor Marshall C. Bell, and the lapidary work was \r\nexecuted by the late Mr. C. C. Wilson of Clemson University. \r\n• "
    },
    {
        "page_number": "9",
        "text": "CANDIDATES FOR THE DOCTOR'S DEGREES \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nAnimal Physiology \r\nSamuelLowryGray _____________________________________ Seneca,SC \r\nB.S., Erskine College; M.S., Clemson University \r\nDissertation: Factors Associated with Mare Reproductive Loss Syndrome \r\nAdvisor: Dr. D. L Cross \r\nApplied Economics \r\nIsmail Aktar ______________________________________ Bursa, Turkey \r\nB.A., Anadolu University; M.A., New Mexico State University \r\nDissertation: The Future of Nuclear Power: A World Wide Perspective \r\nAdvisor: Dr. M. T. Maloney \r\nNeil Canaday Central, SC \r\nB.S., Clemson University \r\nDissertation: Taxation and the Determinants of Public Spending on the Education of African,Americans under Segregation: \r\nEvidence from South Carolina, 1895-1960 \r\nAdvisor: Dr. R. F. Tamura \r\nSteven Paul Clark Valdosta, GA \r\nB.A., Valdosta State University; M.A., University of Georgia; PhD., Clemson University \r\nDissertation: Management Versus Equity: A Principle Agent Problem in a Continuous,Line Structure Control Model \r\nAdvisor: Dr. M. T. Maloney \r\nThomas Andrew Evans--------------------------------- Quebec, Canada \r\nB.E., Royal Military College; M.S., Columbia University \r\nDissertation: The Effects of Federal Spending on Election Results: Evidence From a Parliamentary System \r\nAdvisor: Dr. W.R. Dougan \r\nLeon Peter Michos ____________________________________ Arlingtonl VA. \r\nB.S., Davis & Elkins College; M.S., Texas A&M University \r\nDissertation: Cognitive Ability, School Quality, and Earnings Inequality: An Empirical Analysis \r\nAdvisor: Dr. J. T. Warner \r\nBiochemistry \r\nSusan Kitchell Peirce Clemson, SC \r\nB.S., University of Wisconsin,Green Bay; M.S., University of Cincinnati; M.S., Cornell University \r\nDissertation: Regulation of Bax and Bcl,2 Levels by a Prolactin Antagonist in Human Breast Cancer Model Systems \r\nAdvisor: Dr. W. Y. Chen \r\nEntomology JanetLou~eK~u,Early __________________________________ ~Ea~on,PA \r\nB.S., Ursinus University; M.S., Clemson University \r\nDissertation: Red Imported,Firt Ants, Solenopsis invicta Buren, Colony Movement in Response to Applied Stimuli \r\nAdvisor: Dr. C. S. Gorsuch \r\nPudjianto Bogor, Indonesia \r\nB.S., M.S., Bogor Agriculture University \r\nDissertation: Response of the Beet Armyworm, Spodoptera exigua (Hubner)(Lepidoptera: Noctuidae), to Different \r\nNucleopolyhedrosis Virus Isolates and to an Optical Brightener \r\nAdvisor: Dr. B. M. Shepard \r\nJohn Powell Smith Gilbert, SC \r\nB.S., M.S., University of Georgia \r\nDissertation: Sequential Sampling Using Multi, Pest Thresholds for Managing Lepidopteran Pests of Collard \r\nAdvisor: Dr. B. M. Shepard \r\nCraig Arthur Stoops New Bloomfield, PA \r\nB.S., Shippensburg University of Pennsylvania; M.S., ClefYlson University \r\nDissertation: Potential for Resistance to Bacillus thuringien:;is var. israelensis in Larval Black Flies (Diptera: Simuliidae) and Adult \r\nMosquitoes (Diptera: Culicidae) \r\nAdvisor: Dr. P. H. Adler \r\nTatyana S. Vshivkova Vladivostok, Russia \r\nB.S., M.S., Far East State University \r\nDissertation: The World Revision of the Genus Limnephilus Leach, 1815 (Insecta: Trichopera, Limnephilidae, Limnephilinae, \r\nLimnephilini) \r\nAdvisor: Dr. J. C . Morse \r\nI "
    },
    {
        "page_number": "10",
        "text": "Environmental Toxicology \r\nAmanda Holly Karsten Pittsburgh, PA \r\nB.A., Miami University,Oxford; M.S., Medical College of Ohio, Toledo \r\nDissertation: Antibody Levels Against Select Marine Bacteria and Biomarkers of Inflammation in the Atlantic Sharpnose Shark \r\n(Rhizoprionodon terraenovae) From Three Southeastern U.S.A. Estuaries \r\nAdvisor: Dr. C. D. Rice \r\nRoderick Paul Regala Greenville, SC \r\nB.A., Boston University \r\nDissertation: The Effects of Mycobacteria and Xenobiotics on the Expression of Pro, Inflammatory Proteins in Fish Phagocytes \r\nAdvisor: Dr. C. D. Rice \r\nGenetics \r\nAnna Victorivna Blenda Melitopol, Ukraine \r\nB.S., Melitopol State Pedagog Institute \r\nDissertation: Genetic Analysis of Tolerance to Peach Tree Short Life (PTSL) Syndrome in Prunus Rootstocks \r\nAdvisor: Qr. G. L. Reighard \r\nPlant Physiology \r\nSandra Lowry Gray _____________________________________ Seneca, SC \r\nB.A., Winthrop University \r\nDissertation: Drug Discovery: Bench, Top Bioassays of Plant Extracts \r\nAdvisor: Dr. N. D. Camper \r\nKaren Carlson Hall Bryson City, NC \r\nB.S., Western Carolina University; M.S., Clemson University \r\nDissertation: Ethnobotany with the Eastern Band of Cherokee Indians, Including an Assessment of Change in Medicinal Plant Use \r\nThrough Historical Comparison \r\nAdvisor: Dr. N. D. Camper \r\nZoology \r\nMichele Lyn Barry _____________________________________ Acton, MA \r\nB.S., Framingham State College \r\nDissertation: Vegetation Growth and Development in a Constructed Wetland for Wastewater Treatment \r\nAdvisor: Dr. J. E. Schindler \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nBiosystems Engineering \r\nSerap Gorucu Adana, Turkey \r\nB.S., M.S., Cukurova University \r\nDissertation: Development of Concepts and Technologies per Site,Specific Management of Soil Compaction in Coastal Plains Soils \r\nAdvisor: Dr. Y. J. Han \r\nZhisheng Qing ------------------------------------- Ningxia, China \r\nB.S., Nanjing Institute of Metrology; M.S., China Agriculture University \r\nDissertation: Integrating Crop Models into GLS to Predict Regional Crop Yield \r\nAdvisor: Dr. D. E. Linvill \r\nChemistry KefuFu ________________________________________ Hunan,China \r\nB.S., Tongji University \r\nDissertation: Carbon Nanomaterials \r\nAdvisor: Dr. Y. P. Sun \r\nTeresa Anne Hill _____________________________________ Danville, VA \r\nB.S., Catawba College \r\nDissertation: Structural Studies of Complex Perfluorinated Ionomer Thin Films \r\nAdvisor: Dr. D. Perahia \r\nKankanige Prasanna Udena Perera Kelaniya, Sri Lanka \r\nB.Sc., University of Kelaniya \r\nDissertation: Synthesis and Characterization of Polyarylenes Via Bergman Cyclopolymerization of Bis,Ortho,Diynyl Arene (BODA) \r\nMonomers \r\nAdvisor: Dr. D. W. Smith, Jr. \r\nRakchart Traiphol Nakhonphanom, Thailand \r\nB.Sc., Khon Kaen University \r\nDissertation: Self,Organization of Polymers in Bulk, Thin Films and Solutions: Studies of Semiflexible Perfluorocyclo,Butyl Polyaryl \r\nEthers and Rigid Rod Dialkyl Poly (para,Phenyleneethynylenes) \r\nAdvisor: Dr. D. Perahia \r\n2 \r\n• "
    },
    {
        "page_number": "11",
        "text": "Chemistry (continued) \r\nGulay Zengin -------------------------------- Manchester, United Kingdom \r\nB.S., University of Liverpool \r\nDissertation: Synthesis and Pharmacology of Cannabimimetic Indoles \r\nAdvisor: Dr. J. W. Huffman \r\nCivil Engineering \r\nJohn Regan Prince ____________________________________ Greenwood, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Evaluating the Impacts of Qn,Site Design on Project Performance \r\nAdvisor: Dr. W . E. Back \r\nYan Sun Shanghai, China \r\nB.S., M.S., Tongji University \r\nDissertation: Wind Loads on Hurricanes Straps: The Role of Structural Influence Functions in Developing Net Loads on Roof \r\nConnections \r\nAdvisor: Dr. T. A. Reinhold \r\nComputer Science \r\nTanton Holt Gibbs Wynne, AR \r\nB.S., Harding University \r\nDissertation: Techniques to Facilitate Parsing of Grammars with Semantic Ambiguity and Validation of the Parser Front End \r\nAdvisor: Dr. B. A. Malloy \r\nElectrical Engineering \r\nXing Wang _______________________________________ Jilin, China \r\nB.S., M.S., University of Science & Technology,China \r\nDissertation: Design of Wide, Locking, Range Oscillator Elements for Coupled Oscillator Array Applications \r\nAdvisor: Dr. L. W. Pearson \r\nEngineering Mechanics \r\nDantong He-------------------------------------- Xiangfan, China \r\nB.S., Beijing Institute of Technology; M.S., Huanzhong University of Science And Technology \r\nDissertation: Adaptive Space,Time Finite Element Methods for the Wave Equation on Unbounded Domains \r\nAdvisor: Dr. L. L. Thompson \r\nCristian Daniel lanculescu Bucharest, Romania \r\nB.S., M.S., Polytechnic Institute of Bucharest \r\nDissertation: Iterative Solution of Exterior Helmholtz Problems with Exact Non,Reflecting Boundary Conditions on Distributed \r\nMemory Systems \r\nAdvisor: Dr. L. L. Thompson \r\nEnvironmental Engineering and Science \r\nAlper Elci _______________________________________ Izmir, Turkey \r\nB.S., M.S., Dokuz Eylul University \r\nDissertation: Experimental and Theoretical Study of Subsurface Flow and Transport in a Riparian Wetland \r\nAdvisor: Dr. F. J. Molz \r\nPatcharawadee Suwanathada Samut Prakan, Thailand \r\nB.S., Mahidol University; M.S., Chulalongkorn University \r\nDissertation: Development of an Energy Dispersive K X,ray Fluorescence System for Quantification of Mercury \r\nAdvisor: Dr. T. A. Devol \r\nIndustrial Engineering \r\nAmyGenellaYuha~-----------------------------------~Penesacob,FL B.A., Huntingdon College; M.S., Clemson University \r\nDissertation: Risk Assessment of Industrial Capitalization Projects \r\nAdvisor: Dr. R. P. Davis \r\nMaterials Science and Engineering \r\nHarald Dobberstein Passau, Germany \r\nB.S., University of Elangen,Nuremberg; M.S., Clemson University \r\nDissertation: A Thermodynamic and Kinetic Model for Nucleation and Growth in Solution Derived Thin Films \r\nAdvisor: Dr. R. W. Schwartz \r\nWeijie Huang Wuxi, China \r\nB.S., Beijing Normal University; M.S., Xiamen University \r\nDissertation: Solubilization of Carbon Nanotubes \r\nAdvisor: Dr. Y. P. Sun \r\nXuesong Jiao Beijing, China \r\nB.E., Beijing Institute of Technology; M.S., University of Science and Technology,China \r\nDissertation: Small Angle Neutron Scattering and Atomic Force Microscopy Studies of Complex Polymers and Polymer Interfaces \r\nAdvisor: Dr. D. Perahia \r\n3 "
    },
    {
        "page_number": "12",
        "text": "Physics AhmadH~hemAbdel-Hadi _____________________________ ~Jen~,PakM~e \r\nB.S., Winona State University; M.S., University of Kansas \r\nDissertation: Gravity Assist and Scattering of AGB Stars Off Molecular Clouds \r\nAdvisor: Dr. D. D. Clayton \r\nJeannette Marie Myers ----------------------------------Richfield, MN \r\nB.S., Mankato State University; M.S., Clemson University \r\nDissertation: Galaxy Evolution: Effects of Stellar Feedback on the Dynamics of Halo Formation \r\nAdvisor: Dr. D. H. Hartmann \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction \r\nSarah Omar Abdulkarim Clemson, SC \r\nB.A., King Saud University; M.Ed., Clemson University \r\nDissertation: Journey to Literacy: A Case Study of One Kindergarten Teacher's Approach to Early Literacy Instruction \r\nAdvisor: Dr. C. G. Weatherford \r\nEducational Leadership \r\nRicardo David Hall Warrensville Heights, OH \r\nB.A., M.Ed., Ohio University \r\nDissertation: An Analysis of Student Perception of Clemson University's Parental Notification Policy \r\nAdvisor: Dr. J. L. Flanigan \r\nCynthia Jones Pitts Clinton, SC \r\nB.S., Wofford College; M.Ed., Ed.S., Converse College \r\nDissertation: An Investigation of Transformational Leadership Behaviors in South Carolina Elementary School Principals \r\nAdvisor: Dr. R. L. Blackbourn \r\nValerie R. Ramsey Easley, SC \r\nB.S., Southern Wesleyan University; M.H.R.D., Clemson University \r\nDissertation: Perceptions of Factors that Influence the Career Mobility of Female College Business Officers in Higher Education \r\nAdvisor: Dr. L. W. Watson \r\nParks, Recreation, and Tourism Management \r\nHyorkJ in Kwon --------------------------=-~----------Seoul, Korea \r\nB.A., M.S., Kyonggi University \r\nDissertation: The Effects of Prototypicality on Vacation Destination Choice Behavior \r\nAdvisor: Dr. S. J. Backman \r\n4 \r\n• "
    },
    {
        "page_number": "13",
        "text": "CANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nBONNIE HOLADAY, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nMichael Terry Martin, Jr. _______ Seneca, SC \r\nMASTER OF FOREST RESOURCES \r\nVirginia Katherine Bruce Camden, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nJohn Olusegun Olufowote _______ Ibadan, Nigeria Orient Queen Vo ___________ Columbia, SC \r\nAnimal and Food Industries \r\nBrian Grady Bolt ___________ Anderson, SC Julian Everts Nixon ___________ Sumter, SC \r\nAnimal Physiology \r\nTalia Cecilia Blair _________ Indian Trail, NC Douglas Torrey Johannessen ______ Greensboro, NC \r\nDhanunjaya Reddy Gaddam Nellore, India \r\nAquaculture, Fisheries, and Wildlife Biology \r\nSamuel Thomas Finney ______ Cape Girardeau, MO David William Rudisail __________ Sunset, SC \r\nMelissa Ruth Ide Spring Lake, MI Drew Gordon Trested East Hampstead, NH \r\nBotany \r\nDavid Thomas Nestor _______ Greenville, SC \r\nEntomology \r\nDaniel Wayne Carnagey _________ Miller, MO Michael Edward Vickers _________ Decatur, IL \r\nRichard Charles Harrington Knoxville, TN \r\nEnvironmental Toxicology \r\nAnna Hampton Birrenkott _________ Seneca, SC Katherine Lynne Sciera ________ Fayetteville, GA \r\nJanis Suzanne King Peterson Burlingame, CA \r\nForest Resources \r\nWilliam Davidson Carlisle _______ Columbia, SC Dean Bernard Kubacz ---------- Pickens, SC \r\nThomas Marshall Floyd Covington, GA Jeremy William Pike Sterling, VA \r\nWilliam Lawrence Hascher Greenville, SC Bobby Kent Wagner Charlotte, NC \r\nGenetics \r\nShelly Kernodle Thompson ______ Greenville, SC \r\nHorticulture \r\nVeronda Beth Holcombe ________ Salem, SC \r\nMicrobiology \r\nAmanda Jeanneatte Cotter _______ Fullerton, CA Gabriel Mitchell McAlister ________ Clemson, SC \r\nJaleh Esmaeilzadeh Jalili Tehran, Iran Lori Lynn McGowan Anderson, SC \r\nPengju Luo Shanghai, China Honghong Zhu Zhejiang, China \r\nPackaging Science \r\nMelissa Ann Paulk _________ Columbia, SC \r\nPlant and Environmental Sciences \r\nStaci Nicole Burnett __________ Woodruff, SC Matthew Forrest Gregg _________ Fort Myers, FL \r\nJames Hammond Chappell Columbia, SC Crystal Hope Hammond Marietta, GA \r\nZoology \r\nMatthew Tildon Jones ________ Simpsonville, SC Kayce Scott Strickland _________ Anderson, SC \r\n5 "
    },
    {
        "page_number": "14",
        "text": "COLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES • \r\nMASTER OF ARCHITECTURE \r\nSara Elizabeth Ashworth ________ Rock Hill, SC - Jonathan Bradley Hyman ______ Timmonsville, SC \r\nJamison David Baty Lynchburg, VA Losse Furman Knight III Summerville, SC \r\nMichelle Myra Bellon Summerville, SC Louis J. Markovic III Gibsonia, PA \r\nDaniel Ryan Culbertson Greenville, SC Scott James Meade Prosperity, SC \r\nMaurie Rae Duderstadt Fredericksburg, TX Jefferson Ashley Olmert Greer, SC \r\nMelanie Easter Edwards Marietta, GA Charles Steven Padgett, Jr. Port Charlotte, FL \r\nNathan Dolen Fell Monroe, CT Alicia Lorraine Reed Greer, SC \r\nJames Butler Garland Greenville, SC Tyler Armistead Smyth John's Island, SC \r\nRobert Christopher Gray Princeton, NJ Grayson Bennett Thompson Laurens, SC \r\nCarrie Eleanore Harty Chicago, IL Lauren Marie Thomson Scotch Plains, NJ \r\nShae Suzanne Hensley Odessa, TX Matthew James Warner Livonia, Ml \r\nHans Curtis Herrmann Alexandria Bay, NY Maxie Lee Welsh Darlington, SC \r\nKelley Lynn Hubbard Hilton Head Island, SC Terry David Ben Wilson Yucaipa, CA \r\nGregory Laurence Huddy Beaufort, SC \r\nMASTER OF CITY AND REGIONAL PLANNING \r\nSoumya Ananthanarayanan _______ Mumbai, India lsmaila Odogba ___________ lhima, Nigeria \r\nLeslie Nall Coolidge Greenville, SC Jefferson Ashley Olmert Greer, SC \r\nBrian Allen Grady Cottage Grove, WI Rajeev Girish Shah Ahmedabad, India \r\nHope McNaughton Hasty Pendleton, SC Stephen Anthony Springs White Rock, SC \r\nJonathan Bradley Hyman Timmonsville, SC Ge Sun Anhui, China \r\nVikas Umeshchandra Jain Ahmedabad, India Kimberly Lynn Williams Crawfordsville, IN \r\nBlake Madison Lanford Greenwood, SC Yi Zhu Chongqing, China \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nJonathan Phillip Glover ________ Alpharetta, GA David Austin Ogle __________ Gatlinburg, TN \r\nMichael M. Holland San Antonio, TX Chadwick Thomas Thompson Fountain Inn, SC \r\nJarrett Scott Keim Atlanta, GA Steven D. Westra Princeton, WI \r\nMASTER OF FINE ARTS \r\nVisual Arts \r\nErin Lee Jones _____________ Greer, SC Brent Allen Roberts _________ Tallahassee, FL \r\nTravis Brian Linville Danville, KY \r\nMASTER OF ARTS \r\nEnglish \r\nBrandon Dean Fralix _________ Walterboro, SC Eric Martin Lander _________ Pancoastburg, OH \r\nHeather Marie Herrman Salina, KS Kristin Marie Puscas Dekalb, IL \r\nNicole Kathleen Kirkham Libertyville, IL James Eric Romesburg Akron, OH \r\nErin Patricia Knapp Peachtree City, GA Hannah Marie Still Greenwood, SC \r\nHistory \r\nKevin Michael Kerr ________ Fort Lauderdale, FL Michelle Marchi Terry _________ Anderson, SC \r\nProfessional Communication \r\nEdward Gordon Ballew, Jr. _________ Easley, SC Carol Current Hill __________ Pendleton, SC \r\nAmanda Georgette Brock Honea Path, SC Robert Alan Rettew, Jr. Clemson, SC \r\nAshley Sue Cowden Fair Play, SC Ashley Elizabeth Sherry Alpharetta, GA \r\nAndrew Kemble Edds Glen Allen, VA Kelly Nicole Spencer Middleburg, FL \r\nRobyn Rice Gillis Canton, NC Sarah Frances Weathers Townville, SC \r\nCatherine Clabaugh Heatly Spartanburg, SC Rachael Ann Wiles Fountain Inn, SC \r\nAndrew Michael Heck Austin, TX \r\nMASTER OF SCIENCE \r\nArchitecture \r\nY otin Artonkitjawat ______ Chonburi, Thailand \r\n6 "
    },
    {
        "page_number": "15",
        "text": "COLLEGE OF BUSINESS AND BEHAVIORAL SCIENCE \r\nYvonne Ayodele Akiwumi \r\nGavin Percival Axson \r\nLaura C. Bullock \r\nKevin M. Conaway \r\nJames Lucas Cook \r\nThomas Lawrence Copeland, Jr. \r\nKevin Jon Crawford \r\nGeorge Robert Dawson IV \r\nAlyson Marie Dumont \r\nChristopher Jason Foster \r\nElizabeth Shipley Foster \r\nStephan Geissler \r\nPatrick Carl Graffagnino \r\nAustin Oler Groves \r\nJames Jeffrey Gumaer \r\nLeonard Hugh Herndon Ill \r\nVirginia Parris Hicks \r\nWilliam Pierce Hodge \r\nKirk Thomas Jenkins \r\nAmit Dinesh Bhalerao \r\nJames Kenneth Cluverius, Jr. \r\nNeal Ray Ashley \r\nLindsay Ann Caldwell \r\nMASTER OF BUSINESS ADMINISTRATION \r\nAccra, Ghana Debra H. Jones \r\nSeneca, SC Jeffrey Clayton Koetting \r\nSeabrook Island, SC Douglas Gordon Leney \r\nSeminole, FL Aaron O'neal Livingston \r\nColumbia, SC Charles Edwin Lloyd IV \r\nSpartanburg, SC Kathleen Michelle Milo \r\nKingsport, TN Casey Patrick Morris \r\nFlorence, SC Jonathan A. Nelson \r\nDawsonville, GA Philip Anthony Pane \r\nMauldin, SC Benjamin Durham Price \r\nMidlothian, VA Joseph Levern Prince, Jr. \r\nEssen, Germany Rufus Joe Redfearn \r\nHamilton, GA Charles Bradley Richardson \r\nColumbia, MD Garett Robert Rozek \r\nRadford, VA Yvette Lalonde Sanders \r\nAbbeville, AL Brett Dorsey Shadburn \r\nEasley, SC Brandy Lynn Smith \r\nEasley, SC Angela Lynne Summers \r\nWest Columbia, SC Tian Wu \r\nMASTER OF ELECTRONIC COMMERCE \r\nMaharashtra, India Muhsin Erkoc \r\nRichmond, VA \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nAnderson, SC Angel Sonefelt Luper \r\nAiken, SC \r\nMASTER OF PUBLIC ADMINISTRATION \r\n(Master of Public Administration is jointly administered by \r\nClemson University and the University of South Carolina.) \r\nRickey W. Clark __________ Liberty, SC \r\nMASTER OF ARTS \r\nEconomics \r\nDonalds, SC \r\nOverland Park, KS \r\nMarlton, NJ \r\nPomaria, SC \r\nGreenwood, SC \r\nBeaufort, SC \r\nChesterfield, MO \r\nNorth Augusta, SC \r\nAuburn, NH \r\nNorth Augusta, SC \r\nFlorence, SC \r\nCamden, SC \r\nKaty, TX \r\nSimpsonville, SC \r\nBarnwell, SC \r\nCumming, GA \r\nSmyrna, SC \r\nMt Pleasant, SC \r\nGuangzhou, China \r\nIzmir, Turkey \r\nAnderson, SC \r\nTrammell Antonio Brown _________ Seneca, SC Leila Angelica Rodemann _______ Charleston, SC \r\nRichard James Coe Palm Harbor, FL Nicolae Adrian Stoian Deva, Romania \r\nDelia Hermina Mihalca Satu Mare, Romania Aleksandar Tomic Podgorica, Montenegro \r\nMASTER OF SCIENCE \r\nApplied Psychology \r\nJames Robert Davison _________ Clinton, MD Rebecca Marie Morley ________ Miamisburg, OH \r\nJames Maximilian Dickinson Clifton, NJ \r\nApplied Sociology \r\nKimberly Lynn Feindt ________ Jarrettsville, MD Emily Suzanne Rydell _________ Oakwood, OH \r\nKelly Nicole Foster Marietta, GA Schuyler Drew Wareham Martinsville, IN \r\nGraphic Communications \r\nDavid Ward Compton _________ Sumter, SC \r\nIndustrial Management \r\nAmitsinh Vikramsinh Bhonsle _______ Pune, India Michael Edwin Oberg --------- Florence, SC \r\nKun Chen HeBei, China Edward A. Serna Duluth, GA \r\nYunwei Cui Shanxi, China Jeffrey Todd Stover Greenville, SC \r\nMuhsin Erkoc Izmir, Turkey Shunju Xiong Zhongxiang, China \r\nSasidhar Gundimeda Chennai, India Mingzi Ye Clemson, SC \r\nJohn Robert McAlpine V Mooresville, NC \r\n7 \r\n.,"
    },
    {
        "page_number": "16",
        "text": "• \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCivil Engineering \r\nSteven Ryan Boatwright _______ Hartsville, SC \r\nMASTER OF SCIENCE \r\nBioengineering \r\nClaude A. Lobo _____________ Pune, India Anupama Natarajan __________ Madras, India \r\nBiosystems Engineering \r\nDeepesh Mathur ___________ Jodhpur, India Ryan Margaret Wedderien _________ Dalzell, SC \r\nChemical Engineering \r\nDaniel Richard Bosak __________ Bellmawr, NJ Ronnie Twain Pigott __________ Tylertown, MS \r\nChemistry \r\nGeorge Robert Martin ________ Alabaster, AL \r\nCivil Engineering \r\nCharles Hampton Atkins III _______ Rock Hill, SC Pawan Kumar Mulukutla ________ Chennai, India \r\nGresham Franklin Barker Camden, SC Manish Nainwal Clemson, SC \r\nBryan Kevin Brown Charleston, SC Vasuki Latha Oruganti Machilipatnam, India \r\nDallas Hugh Burnett New Prospect, SC Vidyanand Padmaprabhu Bangalore, India \r\nJessica E. Cummings Burke, VA Mary Katherine Phillips Savannah, GA \r\nMatthew Arthur Edwards Springfield, VA Khaldoun Muhammad Shatanawi Amman, Jordan \r\nBrian Scott Ellis Bamberg, SC Lauren Frances Waesche Baltimore, MD \r\nRaghunathreddy Kommidi Clemson, SC \r\nComputer Engineering \r\nPraveen Kumar Appani ______ Andhra Pradesh, India Shyamnath Harinath __________ Chennai, India \r\nVijayakrishna Basettihalli Bangalore, India Ranjesh Gandhi Jaganathan Coimbatore, India \r\nSrinivas Reddy Beeravolu Hyderabad, India Benjamin James Judy Lake Wylie, SC \r\nBilly Brandon Brock Westminster, SC lrfan Abidali Kapasi Mumbai, India \r\nChinmay Sham Dhodapkar Clemson, SC Pradeep K. Nalabalapu Hyderabad, India \r\nDeepak Madhav Gaikwad Bombay, India Alan Edward Robinson Seneca, SC \r\nComputer Science \r\nSreenivasa Reddy Badam ________ Pradesh, India Malathi Molugu ___________ Hyderabad, India \r\n(Degree awarded posthumously) Gaurav Narwani Jamshedpur, India \r\nMichael David Berryhill ________ Tega Cay, SC Kapil Prakash Padwal Mumbai, India \r\nStephen Patrick Ficklin _______ Myrtle Beach, SC Rajiv Porumalla Andhra Pradesh, India \r\nNaga Archana Godavarthy ____ Andhra Pradesh, India Zhiling Liu Spicer Chongqing, China \r\nJuneedasif Iqbal Hussain ________ Mumbai, India Ganeshram Sreenivasan Chennai, India \r\nTravis Michael Landry __________ Liberty, MS (Degree awarded posthumously) \r\nGerd Josef Marmitt ________ Sitzerath, Germany Rishi Srivatsavai __________ Hyderabad, India \r\nEric Wade Medlin ___________ Rock Hill, SC Nirali Balvantsinh Vaghela Gujarat, India \r\nSunil Mettu ___________ Hyderabad, India Zhenyu Xu Shanghai, China \r\nElectrical Engineering \r\nLee William Brandon _________ Atlanta, GA Michael David Lockard _________ Columbia, SC \r\nRico Sedaka Burch Nicholls, GA Dien K. Nguyen Savannah, GA \r\nHarshawardhan Diwakar Chitale Pune, India Jeremy Paul Rudbeck Simpsonville, SC \r\nPraveena Desu Hyderabad, India Sowjanya Syamala Bangalore, India \r\nSalil Dhananjay Divekar Pune, India Pradipta Kumar Tripathy Rourkela, India \r\nJason Anthony Ellenburg Easley, SC Aarthi Venkateshan Tamil Nadu, India \r\nSummer Aimsley Fowler Simpsonville, SC Haiming Wang Guangzhou, China \r\nChandrashekhar Ghone Thane, India Qingfeng Zhou Jiangxi, China \r\nJian Jiang Chengdu, China David Michael Zook Martinsburg, WV \r\nEngineering Mechanics \r\nDevon Dana Dazen North Huntingdon, PA \r\nEnvironmental Engineering and Science \r\nAngela Lyn Allen -----------Clemson, SC Samuel Vicente Henriquez ____ San Salvador, El Salvador \r\nAdlar Chadwick Bird Atlanta, GA Heidi Eichinger Holder Iowa City, IA \r\nGeoffrey Kelly Chambers Mt Pleasant, SC Kevin Joseph Reardon Greer, SC \r\nSiew,Ching Chin Sarawak, Malaysia Anja Schank Primstal, Germany \r\nAnna Campbell Franklin Anderson, SC Jacqueline Maria Smith Newnan, GA \r\nMichael Ryan Goforth Lilburn, GA Christopher David Theisen Greer, SC \r\nHydrogeology \r\nJames Jameson Henley_~ _______ Greenville, SC Anthony Soricelli _________ New Windsor, NY \r\nShaun Cameron Malin Indiana, PA Qingfeng Tan Zhejiang, China \r\nJaime Lea Piver LaPine, OR Cameron Mace Warlick Charlotte, NC \r\nJames Ross Richardson Dahlonega, GA \r\n8 "
    },
    {
        "page_number": "17",
        "text": "Industrial Engineering \r\nSwati Jayant Deo ----------- Gujarat, India Preetam Suryakant Nipanikar ________ Latur, India \r\nJason Mayo Edwards Chattanooga, TN Krishnakumar Shankarnarayan Pune, India \r\nChaehwa Lee Ulsan, Korea Naresh Kumar Tammineni Hyderabad, India \r\nCatherine E. Mclendon Pendleton, SC Ananth Uggirala Hyderabad, India \r\nMaterials Science and Engineering \r\nJohn Michael Draper __________ Green Bay, WI Yashodhan Santosh Parulekar ________ Pune, India \r\nPrajakta Subhash Kotasthane Pune, India Bindu Sadanadan Kerala, India \r\nMartin Kunz Selb, Germany Prochi Vijay Verma Pune, India \r\nRobert Hugh Lowery Richmond, VA \r\nMathematical Sciences \r\nYang An _______________ Xian, China Sundeep Samson ---------~Tamil Nadu, India \r\nKara Rene Andrighetti Greer, SC Padmapani S. B. Seneviratne Kandy, Sri Lanka \r\nMinsang Chan Guangdong, China Abdul-Baasit Shaibu Tamale, Ghana \r\nKatie Jeanene Durham Portland, OR Mayur Chandrashekar Shetty Mumbai, India \r\nSherlene Sarita Enriquez Dangriga Town, Belize Merry Robyn Minor Smith Goodwater, AL \r\nTimothy Blaine Flowers Newport News, VA Patti Ann Sylvia Raynham, MA \r\nTravieso Pablo Gonzalez Miami, FL Kristen Anne Cavell Woodward Spartanburg, SC \r\nRebecca Russell Harvey Hartsville, SC Wei Zhang Clemson, SC \r\nKerry Nicole Kendall Greenville, SC \r\nMechanical Engineering \r\nBalajee Ananthasayanam _______ Tamil Nadu, India David Wilson Knowles IV _________ Cheraw, SC \r\nMiranda Mcfarren Baladi North Augusta, SC Francois Maugin Toulouse, France \r\nDavid Nicholas Cowart Savannah, GA Jamie Lynn Morales St Bernard, LA \r\nAnne Delmotte Dovai, France Chaitanya Nandula Kurnool, India \r\nGregory Michael Feldman Charleston, SC Thomas Michael New Saluda, SC \r\nDaniel Jefferson Fleming Morganton, NC Vinay Ramanath Mysore, India \r\nMatthew Louis Grier Sandy Run, SC Mohan Rathinasabapathy Tamil Nadu, India \r\nHoria Alexandru Haghiac Galati, Romania Wayne Scott Strasser Spartanburg, SC \r\nDaniel McEachern Hicks Greenville, SC David Boone Wagener Simpsonville, SC \r\nMichael David Knauff Williamsport, PA \r\nPhysics \r\nJessica Lynn Crist ________ Charlton Heights, WV Larry Campbell Harris _________ Petersburg, VA \r\nKeith Wayne Davis Little Rock, AR David Alan Weston Greenville, SC \r\nXuejun Gu Shaoxing, China Yared Endalamaw Woldegiorgis Addis Ababa, Ethiopia \r\nTextiles, Fiber and Polymer Science \r\nAmanda Lattam Forster _________ Rock Hill, SC Megan Powell Leggett _________ Greenville, SC r \r\nWilliam Patrick Gray Chapel Hill, NC Bei Shen Sichuan, China \r\nPratik Kishore Ichhaporia Baroda, India \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\nGerald Franklin Brooks _________ Rock Hill, SC Vickie R. Hardy ____________ Lavonia, GA \r\nKimberley Gale Clardy Easley, SC \r\nMASTER OF HEAL TH ADMINISTRATION \r\n(Master of Health Administration is jointly administered by \r\nClemson University and the Medical University of South Carolina.) \r\nMarc Andrew Baur ________ Simpsonville, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nClifford Wayne Bailey ___________ Tampa, FL Jackie Jermaine Robinson ________ Orangeburg, SC \r\nAlejandro Dubreuil Lima, Peru Michael Marion Rodriguez Grant Town, WV \r\nRobert Lee Griffin IV Dallas, TX Clintoria Eugenia Session Seneca, SC \r\nJason Lee Gunnarson Duxbury, MA Audrey Deanna Shippey Orangeburg, SC \r\nDeborah Lynn Herman Indianapolis, IN Travis Jude Soileau Port Barre, LA \r\nAngela Prater Lawson Seneca, SC Ana Maria Antunes Storino Brazil, South America \r\nDavid Roosevelt Mahatha, Jr. Charlotte, NC C. Justice Tillman Hephzibah, GA \r\nJennifer Lynn Meador Mechanicsville, VA Anthony Clayton Wheeler Hampton, VA \r\nTarik Saeed Pierce Florence, SC Kamie Michelle Whitaker Liberty, SC \r\nRebecca Smith Pruitt West Union, SC \r\nMASTER OF PARKS, RECREATION, AND TOURISM MANAGEMENT \r\nGenie Brannon Holmes Johnston, SC \r\n9 "
    },
    {
        "page_number": "18",
        "text": "MASTER OF EDUCATION \r\nAdministration and Supervision \r\nRhonda Denise Black ___________ Seneca, SC Rex Sawyer Ward ------------ Loris, SC \r\nCecil Dan Marett Hartwell, GA Kyle Mclendon Young Clemson, SC \r\nDennis Edward Tomko Midland, MI \r\nCounselor Education \r\nCarl S. Austin, Jr. __________ Elizabethton, TN Heather Jean Kline __________ Pendleton, SC \r\nThomas Shane Axson Greenville, SC Jessica Kupper Huntingdon Valley, PA \r\nMelanie Lane Baker Seneca, SC Dana Graham Long Pomaria, SC \r\nStephanie Diane Berry Greenville, SC Tracy Nicole Mabry Spartanburg, SC \r\nChristina Marie Borke Cincinatti, OH Allison Evatt McElveen Honea Path, SC \r\nNikolina Camaj Zagreb, Croatia Sara Dirsh Mickel Anderson, SC \r\nShantell Monique Carter Anderson, SC Kathleen Mary Morrow Laurinburg, NC \r\nNicholas M. Cina Clemson, SC Haley Riannon Myers Birmingham, AL \r\nMelissa Altman Cromer Orangeburg, SC Birmagidra Marie Parrott Sumter, SC \r\nJanice Denise Davis West Palm Beach, FL Frances Frazier Pope Winnsboro, SC \r\nDeborah Henderson DeMint Greenville, SC Penny Evans Pope Greenville, SC \r\nJohn Jamal Wilson Evans Camden, SC Thaya LaCretia Posley Mauldin, SC \r\nAmy Camille Gamble Knoxville, TN Vanessa Williams Rettinger Sebring, FL \r\nHolly Allisa Harden Pickens, SC Rene Cobb Sawyer Easley, SC \r\nScott Allen Harvey Charleston, SC Laura Melissa Slice Florence, SC \r\nSeth Anderson Hodge Portland, CT Robert Larry Taylor II Seneca, SC \r\nChristina Joye Jenkinson Summerton, SC Karen Anita Washington Anderson, SC \r\nEdward Bradham Kizer Long Creek, SC Margaret Grace Westerlund Westminster, CO \r\nElementary Education \r\nVirginia Rebecca Taylor Mt Pleasant, SC \r\nReading \r\nJennifer Elizabeth Bull __________ Chapin, SC JoEllen Watson Faulkenberry ______ Piedmont, SC \r\nLinda Jo Longhurst Burns Clemson, SC Emily Gay Miles Scranton, SC \r\nErin Nicole Elliott Lebanon, CT \r\nSecondary Education \r\nPhillip David Hewlett __________ Fair Play, SC Beverly Dunn Smith ---------- Anderson, SC \r\nRoger L. Skillman Six Mile, SC \r\nSpecial Education \r\nDanielle Keelan ___________ Paramus, NJ \r\nMASTER OF SCIENCE \r\nNursing \r\nBetsy Serafina Baer ___________ Harrison, TN Cathy Mullikin Ford _________ Williamston, SC \r\nFlorencia Barron Clemson, SC Melissa Taylor Ford Spartanburg, SC \r\nMelissa Black Greenville, SC Evelyn Chester Hooper Anderson, SC \r\nLauren Elizabeth Britt Snellville, GA Heather Michelle Houston Newberry, SC \r\nPattie Burton Burriss Iva, SC Donna Johnson Poore Anderson, SC \r\nDori Lollis Dahlberg Anderson, SC Mary Sue Raaf Clayton, GA \r\nPeggy Ann Dermer Anderson, SC Jill Suzanne Shiver Camden, SC \r\nNancy Rankin Ewing Anderson, SC Bertha Nichols Stauff Hopkinton, MA \r\nMaria Flores,Harris Anderson, SC Brad Allen Wilson Weaverville, NC \r\nParks, Recreation, and Tourism Management \r\nMelanie Kalea Krehl Kihei, HI \r\nGRADUATE SCHOOL \r\nMASTER OF FINE ARTS \r\nDigital Production Arts \r\nMarc Henry Bryant _________ Echirolles, France Sara Rebecca Johnson ___________ Sumter, SC \r\nRobert Lloyd Helms Clemson, SC Jacob Andrew Richards Kalamazoo, MI \r\n10 "
    },
    {
        "page_number": "19",
        "text": "CANDIDATES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nCAL VIN LEE SCHOUL TIES, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\nKristin Marie Blum ___________ Dillon, SC ***Indrek P. Meyer _________ Middletown, OH \r\nScott Walter Durham Piedmont, SC Van Junius Stitt III Rock Hill, SC \r\nBrandi Summer Guy Greenwood, SC *Lindsay Long Whiteside Clemson, SC \r\nErika Lynn Hartwig Lexington, SC Allison Page Woodlee Midlothian, VA \r\nAnna Mary Leisgang Cincinnati, OH \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nDavid Blake Allen ____________ Latta, SC Hugh Chumbley Mclaurin IV _______ Elloree, SC \r\nDennis Elwyn Deal Clemson, SC *Benjamin Speaks Ruff Batesburg, SC \r\nK.C. Dixianna Dowlen Easley, SC Kayne Bradley Shirer Lonestar, SC \r\nMartin Thomas Eli Gamble Sardinia, SC *Jefferson Ephraim Burris Wilson Lowrys, SC \r\n*John Bradley Hall Spartanburg, SC Jared Lorn Davis Zuercher Myrtle Beach, SC \r\nAgricultural Education \r\nElliott Huger Lynam IV __________ Sumter, SC Chase Risque Mcintosh _________ Charlotte, NC \r\nAgricultural Mechanization and Business \r\nSamuel Grady Gilliam III ________ Abbeville, SC Nicholas Justin Hook. _________ Lexington, SC \r\n**Erica Goza Mayesville, SC Joshua William Simpson Westminster, SC \r\nAnimal and Veterinary Sciences \r\n*Edward Forrest Axson Seneca, SC Timothy Patrick Hass __________ Aiken, SC \r\nJonathan Alexander Blanton Rock Hill, SC John Michael Johnson, Jr. Kinards, SC \r\nEmily Whiting Bowen Pawley's Island, SC Sophia LayKeytria Johnson Summerville; SC \r\nRandolph Erwin Carothers IV Shelby, NC Amanda Renee Jones Seneca, SC \r\nBarbara Kristin Clinton York, SC Corey Le'Ttrell Magwood Charleston, SC \r\n*Joshua Brandon Cohen Charleston, SC Elizabeth Adair McKoy Wadmalaw Island, SC \r\n**Tristan Milton Cordray Ravenel, SC *Laura Anne Moyer Leesville, SC \r\n*Melissa Ann Dean Myrtle Beach, SC **Kristina Ann Petrovski Mt Pleasant, SC \r\n*Edward Neil Dixon Lexington, SC *Aaron Thomson Ramey Abbeville, SC \r\nKimberly Joy Ellis DeKalb, IL *William Oran Ratterree Spartanburg, SC \r\nJennifer Lynn Farmer Beaufort, SC William Jacob Reinhardt Rock Hill, SC \r\nStephanie Marie Fotomy Endicott, NY Sven Thomas Samoska Bethlehem, CT \r\n+**Katherine Rose Fowler Winnsboro, SC Lara Ann Smith Jonesville, SC \r\n*Anne Courtenay Freeman Columbia, SC Tyler Jonathan Lee Smith Rock Hill, SC \r\nElpinikki Evelyn Goan Greenville, SC *Alison Nicole Starr Moore, SC \r\n*Caroline Lee Goodman Elgin, SC William Brittain Stokes Lancaster, SC \r\n*James Emmons Gregory Pensacola, FL Andrea B. Svendsen Charleston, SC \r\nGenevieve Armistead Grimmett __ North Myrtle Beach, SC Andrew Vernon Tanner Johnsonville, SC \r\nDeena Marie Hallman Chapin, SC Chad Daniel Truesdale Camden, SC \r\n***Melissa Ann Catherine Hansen Newport News, VA Nancy Ellen Trussell Hanahan, SC \r\nAquaculture, Fisheries, and Wildlife Biology \r\nHope Elizabeth Bowles ________ Great Falls, SC Aaron C. Lucas __________ Simpsonville, SC \r\n*Rebecca Almy Cantey Summerville, SC **Gregory Swanson Lynch Harbor Island, SC \r\nJoseph Anthony Caraway Piedmont, SC Elisabeth Allen Massalon Pinopolis, SC \r\nRobert Ervin Coburn II Lake View, SC Kimberly Susan Milam Easley, SC \r\n**Amy Harrell Cribb Moncks Corner, SC Matthew Alan Parks Goose Creek, SC \r\nTravis William Dodson Lexington, SC Erin Courtney Pickens Greenville, SC \r\nJeremy Blake Goings Lexington, SC Rodney Jamel Sherman West Palm Beach, FL \r\nJennifer Lynn Jordan Richmond, VA *Christopher Glenn Smith Westminster, SC \r\nBiochemistry \r\n+***Mary Katherine Brock. _________ Irmo, SC **Julia Michelle Long _________ Bellbrook, OH\u0002Kelcie Doreece Brunson Lake View, SC +**Thomas Drakeford Mullen Graniteville, SC \r\nChristopher Michael Burke Columbia, SC +***Jeremy Michael Parker Easley, SC \r\n+***Faith Marie Coldren Robesonia, PA Chartrisa La~Shan Simpson Clinton, SC \r\n+**Matthew William Diehl Greenville, SC **Christy Ross Sine Fort Mill, SC \r\n*Kelley Elizabeth Hughes Goose Creek, SC +**Joseph Jenkins Thompson Charleston, SC \r\n*Brandon Bryan Loggins Travelers Rest, SC \r\n11 "
    },
    {
        "page_number": "20",
        "text": "Biological Sciences • \r\n+**Linda Sharon Caldwell _______ Summerville, SC **Jessica Welda McCullough _______ Columbia, SC \r\nAllan Bradley Cullinan Roanoke, VA **Cheryl Heather McDaniel Greenville, SC \r\n***Jason Jordan Davis Greenville, SC Cedrick Brown McDonald Lancaster, SC \r\n**Kimberly Elizabeth Douglas Louisville, KY **James Benjamin McNeely Easley, SC \r\n*Lavaura Qwensha DuBose Rock Hill, SC **Laura Ann McPhail Abbeville, SC \r\nBenjamin Reynolds Elliott Columbia, SC Emily Marie Michi Mt Pleasant, SC \r\nLeslie Erin Fowler Mountain Rest, SC **Craig Lee Milburn Myrtle Beach, SC \r\nCrystal Louise Franklin Georgetown, SC Poya Moshtaghi Moghadam Charleston, SC \r\n**Angela Marie Frick Little Mountain, SC +**Allison Whitney Moses Sumter, SC \r\n**R. Donlan Frye, Jr. Greenville, SC Jennifer Robin Owings Greenville, SC \r\nMerry Lee Getsinger Anderson, SC Ashlee Elizabeth Painter Greenville, SC \r\nLaShanda Mari Glenn Union, SC James Edgar Pennell II Anderson, SC \r\nDominicque Blanche Gray Lancaster, SC +*Adam Gregory Przybyla Sumter, SC \r\nKoneeski Gregg Darlington, SC *Matthew Donald Quillen Dover, DE \r\nJennifer Kate Heffron Dublin, OH David Brent Rankin, Jr. North Augusta, SC \r\n+**Robert Sowell Hegler, Jr. Kershaw, SC ***William Christopher Risher Myrtle Beach, SC \r\n*Katrina Renee Herring Lexington, SC **Erika Ashley Schreiber Greenville, SC \r\nOtis Ishmel Holloman Bishopville, SC Charles Rudolph Simpson Anderson, SC \r\nRhett Jefferson Hutchins Columbia, SC +**Jason M. Snelgrove Richland, SC \r\n*Rebecca Kate Johnston Orangeburg, SC *Sarah Christine Stroud Greenwood, SC \r\n***Rachel Ellis Jones Summerville, SC *Lisa Marie Vaughan Union, SC \r\n*John Alexander Kennedy, Jr. Greenville, SC ***Claudia Kristine Vissage Mountain Rest, SC \r\nPeter Bryden Kite Marshfield, MA Kristin Nicole Wagner Gainesville, GA \r\nMarketta Phenique Ladson Charleston, SC **Mark Nathan Webb Travelers Rest, SC \r\nChristina Katherine Lee Anderson, SC Lindsay Cate Wellman Keller, TX \r\nDerek Leffel Lee Manning, SC +***Karen Leanne Wickliffe Greenville, SC \r\nJohnisha Betonya Lockhart Pageland, SC \r\nCrop and Soil Environmental Science \r\nRobert Maxwell Anderson _______ Charleston, SC Sean Christian Hoelscher _______ Georgetown, SC \r\nCasey Loraine Callahan Travelers Rest, SC \r\nEnvironmental and Natural Resources \r\nCharles Dana Moberg III ________ Goat Island, SC Nathan Andrew Quinn ___________ York, SC \r\nFood Science \r\nHeather Renee Beem _________ Vancouver, WA Stacie Lynne Bullock __________ Augusta, GA \r\n*Lacy Heather Blanchard Rock Hill, SC *Karen Lynn Graczyk Columbia, SC \r\nKari Elizabeth Bolt Simpsonville, SC \r\nForest Resource Management \r\n*David Berry Andrews IV _______ New London, NH Brian Patrick Lacey __________ Arlington, VA \r\nWilliam Curtis Chapman Newberry, SC William B. Lominick, Jr. Newberry, SC \r\nZachariah John-Pierce Featherston Cowpens, SC Matthew Thomas Myers Springfield, OH \r\nMichael Chastain Freeland Greenville, SC Herbert Angus Nicholson Darlington, SC \r\nBrian Samuel Frierson Hopkins, SC Molly Jean Sanford Youngsville, PA \r\nDavid Gene Gabrielli II Summerville, SC Justin Derrick Scott Allendale, SC \r\n+**Dallas Wilson Glass Birmingham, AL +**Sarah Lindley Small Greenville, NC \r\nWilliam Palmer Golson Bluffton, SC Jason Wyman Wall Fairfax, SC \r\nTony Brian Hardee Conway, SC William B. Warren Newberry, SC \r\nBenjamin Lanham Holmes Saluda, SC Micah Whittington Whiteside Marietta, GA \r\nRobert Craig Hooks Dublin, GA \r\nHorticulture \r\nAaron Michael Eichman ________ Piedmont, SC *Jessica LeeAnn Mitchell _________ Seneca, SC \r\nAaron Patrick English Clemson, SC Christopher Ross Smith Spartanburg, SC \r\n**Gwendolyn Slaton Fleitstra Pendleton, SC *Robert Weston Tripp, Jr. Piedmont, SC \r\n*Michael Jeremy Hutcheson Aiken, SC \r\nMicrobiology \r\n*Ryan Carroll Alexander __________ York, SC +*Robert Kane McCall __________ Seneca, SC \r\nJacob Fischer Barnes Annapolis, MD +**Julianne Newcomer Dallastown, PA \r\nVerdale Nathaniel Jermon Benson Pendleton, SC Shane Burr Patterson Troopsburg, NY \r\nJoseph Carroll Brown Greer, SC Adam Joseph Perkins Wethersfield, CT \r\nJulie Martin Clark Easley, SC Douglas D. Schmidt Greensboro, NC \r\n**Sean Tristen Lawrence Cook Lugoff, SC Richard David Sentelle Aiken, SC \r\nRainey Lynn Fair Wagener, SC Andrea Denise Smith Tallassee, AL \r\n**Lesslie Anna Graves Central, SC Brian Patrick Wahl Summerville, SC \r\nClinton Albert Hartz Deposit, NY +*Glenmore Garrett Wilson III Knoxville, TN \r\n+*Edwin Manley, Jr. Lexington, SC **La'Marcus Tejuan Wingate Cheraw, 3C \r\n+**Jeanine Ann Masington Marlton, NJ Nicole Marie Yannacone Surfside Beach, SC \r\n12 "
    },
    {
        "page_number": "21",
        "text": "Packaging Science \r\nRyan Paul Arnick _________ West Columbia, SC Michael Everett Lewis, Jr. ________ Anderson, SC \r\n**Aubrey-Anna Delong Beemer Orangeburg, SC Jonathan Andrew Liebenrood Latta, SC \r\n**Thomas Leslie Berry Columbia, SC David Forrest Long Johnston, SC \r\nDarrell R. Box Westminster, SC Travis Wade McKie North Augusta, SC \r\n*Steven Gordon Collins, Jr. Taylors, SC Ahmad Roshaud Mitchell Orangeburg, SC \r\nBrent Patrick Cotton Summerville, SC Phillip Blake Nuckols North Augusta, SC \r\nRussell Fleming Darley Summerville, SC Stephen Andrew Price West Columbia, SC \r\nWilliam Franklin Ferguson, Jr. Kershaw, SC Robyn Hope Roof Conway, SC \r\nBrett Bradshaw Kraeling Central, SC *Michael Thomas Trant Simpsonville, SC \r\nPlant Pathology \r\n+***Joshua Samuel Ash Summerville, SC \r\nPre-professional Studies \r\n***Cynthia Ellen Caughman ______ Batesburg, SC *Erin Joyce Looney __________ Columbia, SC \r\n**Kristi Lyn Duke Westminster, SC Jennifer Anne Patala Charleston, SC \r\n**Sarah E. Ellis Pawley's Island, SC Crystal Denise Phillips Iva, SC \r\n*Jessica Blair Frishberg Orangeburg, SC *Laura Katherine Reeves Simpsonville, SC \r\n**Sarah Margaret Holcombe Easley, SC *Sara Ivy Romansky Anderson, SC \r\n*Lisa Marie Knott Columbia, SC ***LeeAnn Marie Stock Charleston, SC \r\nJoshua Christian Long Anderson, SC \r\nTurfgrass \r\nCraig Stephen Madara _________ Sewickley, PA Grayson Patrick Madden ________ Greenville, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nJANICE CERVELLI SCHACH, Dean \r\nBACHELOR OF FINE ARTS \r\nBenjamin Ryan Baker __________ Seneca, SC Tiffany Danielle Leonardi ________ Piedmont, SC \r\n***Mary Katherine Brock Irmo, SC *Malisha Ann Martin T arnassee, SC \r\nYu-Ting Chiu Spartanburg, SC Erin Colleen Ryan Middletown, OH \r\n*Kimberly Renee Dick Pendleton, SC *Jane Ann Nica Sweeny Columbia, SC \r\n*Jennifer Denise Dickinson Lakeland, FL Rebecca Thomas Tillinghast River Forest, IL \r\nLisa Michelle Donald Greenville, SC Jon David Wical Irmo, SC \r\nJackie Aldon Foster, Jr. Piedmont, SC \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\nArlethea Elizabeth J. Blackwell ______ Greenville, SC *Hannah Jo Keese _________ Westminster, SC \r\n*Geoffrey Shane Brandwood Fort Mill, SC **Jennifer Lynne Lenore McGee Pacolet, SC \r\n**Lan-Yin Chen Taipei, Taiwan Adam Scott Ormsbee Pritchardville, SC \r\nStuart Thomas Cook East Hampton, NY George Paul Pennell Greenville, SC \r\nLauren Sutler Davis Sumter, SC *Mark Phillip Sartain Forsyth, IL \r\nAdrian Donald Henson Matthews, NC Jason Russell Smith Summerville, SC \r\nCarissa Marie Hood Central, SC *Nathan Adam Tidd Simpsonville, SC \r\nMorgan Suzanne Hutchinson Allison Park, PA Paul Andrew Woodward Clemson, SC \r\n*Amanda Susan Justice Fair Play, SC \r\nBACHELOR OF ARTS \r\nDesign \r\nWilliam Bums Allison _________ Greenville, SC James Boyce Pressly III _________ Greenville, SC \r\nIsabel Catherine Brash La Romaine, Trinidad Ryan August Reilly Mineral, VA \r\nWilliam Henry Bryant IV Atlanta, GA *Arny Marie Ropp Irmo, SC \r\nRobert Norris Buckley, Jr. Greenville, SC ***Fred Gray Shealy III Flat Rock, NC \r\nAmanda Dawn Cochrum Inman, SC Po Ching Tin Charleston, SC \r\n**Kelley Frei Lahr Charleston, SC Jenny Gettys Williams Rock Hill, SC \r\nEnglish \r\nDanielle Denise Alston _________ Columbia, SC +**Avery Meredith Houser _______ Houston, TX \r\nRyan Michael Beaudoin Worcester, MA *Adair Mullis Johnson Cheraw, SC \r\nLeslie Rae Bohannon Mt Pleasant, SC *Courtney Nicole Larry Southlake, TX \r\nMichael Charles Brown Simpsonville, SC *Melissa Beth Lehman Rock Hill, SC \r\nConstance Natalie Burris Cheraw, SC Makeyda Erenett Livingston Prosperity, SC \r\nJanice Arlene Byrd Branchville, SC *Bridget Ann McDonough Orange, CT \r\nChrisandra Lynn Childs Pickens, SC Andrea Elizabeth Messervy Alpharetta, GA \r\n*June Mi Choi Albany, GA April Joy Moore Union, SC \r\nCheri May Cook Asheville, NC Elizabeth Stewart Munson Chestertown, MD \r\nCorey Jayne Daniel Myrtle Beach, SC Michelle Christine Newell Greenville, SC \r\nEva Kristine Davidson Easley, SC Kathryn Haley Rakes Alexandria, VA \r\nJason Daniel Evans Easley, SC Neil Andrew Reddy Spring, TX \r\nJohn Jordan Gatling Columbia, SC *Elizabeth Chamblee Renedo Columbia, SC \r\nKathryn Anne Golden Delran, NJ **Renee Valerie Riley Cazenovia, NY \r\nAbbey Rae Hartman Ocean View, NJ Sarah Kathryn Stewart Greenville, SC \r\n*Janice Holmes Sumter, SC Mark Daniel Sursavage Columbia, SC \r\n13 "
    },
    {
        "page_number": "22",
        "text": "English (continued) • \r\n+*Lauren Christine Teffeau _______ Glen Mills, PA Rebecca Ellen Vissage ________ Mountain Rest, SC \r\n**Anna Kathryn Vaughn Greenville, SC \r\nHistory \r\nDequilla Chantee Cruell __________ Easley, SC +**David Richard Price, Jr. _______ Greenville, SC \r\nSusan Erica Graham Closter, NJ *Martin Samuel Price Greer, SC \r\nShauna Lynn Hemingway Loris, SC +*John Edward Robinson Chester, SC \r\nMatthew Alexander Holland Endicott, NY *Sarah Katherine Scarcelli-Blank Tampa, FL \r\nVirginia Lynn Huffman Greenville, SC *Margaret Grayson Scott Greenville, SC \r\n*Melissa Elizabeth King Scottsdale, AZ Paul Ryan Smith Lawrenceville, GA \r\nMark Nathan Lacy Anderson, SC Julia Cristina Solomons Estill, SC \r\nRichard Lee Mahaffey, Jr. Greenville, SC *Matthew David Theodore Summerville, SC \r\nGary Avery Nichols Bridgeton, NJ +*Lauren Evelyn Virgo North Augusta, SC \r\nOtis Westbrook Pickett Charleston, SC Robert Shaw Wilson, Jr. Sumter, SC \r\nJames Michael Powell Walhalla, SC \r\nLanguage and International Trade \r\n*Stephanie Anne Black ________ Charleston, SC Matthew Jerome Nicoletta ________ Lexington, SC \r\nJill Elizabeth Borowski Cincinnati, OH Jose Antonio Nieves, Jr. Greenville, SC \r\nMichael Alan Clinch Rock Hill, SC Stephanie Olivero Smithtown, NY \r\n***Elizabeth Lynne Day Lancaster, PA **Jennifer Lynn Pepin Lawrenceville, GA \r\n**Suzanne Elizabeth Golay Lexington, SC ***Rebecca Anne Petrush Florence, SC \r\nNeal Walker Hanlin Warrenville, SC **Trevor Holt Pittman Spartanburg, SC \r\n**Samantha Ellen Hoit Tampa, FL *Jill Kathryn Reilly Marietta, GA \r\n*Carrie Angela Kerechanin Greenville, SC +**Mary Amanda Shaw Central, SC \r\n*Sarah Elizabeth Keyes Cincinnati, OH Lauren Stephanie Taylor Taylors, SC \r\n*Laura Michelle Maynard Orlando, FL ***Rebecca Branham Wright Mt Pleasant, SC \r\nWilliam Edward McCain Denmark, SC Michael Everington York Rock Hill, SC \r\nHeather Lee Mills Anderson, SC \r\nModern Languages \r\nJaiye Aquinn Andrews _________ Atlanta, GA *Kelley Elizabeth Hughes _______ Goose Creek, SC \r\n*Shannon Michele Barnebee Greenville, SC **Angela Rae Manning Simpsonville, SC \r\nDonna Anne Bowen Charleston, SC **Elizabeth Light Murphy Midlothian, VA \r\nErin Elizabeth Caldwell Pageland, SC Matthew Jerome Nicoletta Lexington, SC \r\n*Mary Catherine Crews Lexington, SC *Jodi Lynne Rosenfeld Greenville, SC \r\nNadiya Kinyatta Edwards Hartsville, SC Dawn Michelle Salley Asheville, NC \r\nMatthew Addison Hopper Charlotte, NC \r\nPhilosophy \r\nMichael Christopher Coffman ___ Fort Walton Beach, FL **Thomas Columbus Smalls II _______ Varnville, SC \r\nPavol Kamas Bratislava, Slovakia \r\nProduction Studies in Performing Arts \r\nHunter Louis Wright Knoxville, TN \r\nSpeech and Communication Studies \r\nAlexandra Maria Alahouzos ______ Washington, DC Edward F. Irick IV ___________ Greenville, SC \r\nAshley Susan Anderson Lexington, SC Parma Marie Irvin Seneca, SC \r\nJacqueline Patricia Barry Attleboro, MA Edward Adam Kaylor Mt Pleasant, SC \r\nAmber Danielle Brandon Alpharetta, GA David Goodwin Kopp, Jr. Athens, GA \r\nAmber Lee Branton Columbia, SC Lindsay Thomas Lane King William, VA \r\n*James Oliver Brawley Clemson, SC Paige Michelle Livingston Charleston, SC \r\n**Megan Swit Brown Alpharetta, GA Lindsay Susan Mapes Middletown, OH \r\nKristi Elaine Burnsed Crescent City, FL Todd Dexter Matthews Trenton, NJ \r\n***Jessica Lauryn Bush Greenville, SC Mary-Graham McCullough Cameron, SC \r\nLisa Joy Carbone Wayne, NJ Mailen Todd Mc Williams Seneca, SC \r\nLetha Marie Clanton Greeneville, TN Julie Elizabeth Merrill Spartanburg, SC \r\nKatharine Rae Collins Vero Beach, FL Sabreena Kaye Meyers Hilton Head Island, SC \r\nNicholas Manning Conger Slingerlands, NY Jennifer Kaye Mimms Bishopville, SC \r\nJulie Catherine Cook Charleston, SC Polly Jo Monson Greenville, SC \r\nRyan Curtis Copeland Beaufort, SC **Emily Catherine Moore Columbia, SC \r\nSarah Elizabeth Covelli St Charles, IL Dang-Khoa Vu Nguyen Charleston, SC \r\n*Joshua Lee Crawford Anderson, SC Laura Elizabeth Olsen Brockport, NY \r\nStephen Lee Culp Winston-Salem, NC Christopher Simms O'Neal Charleston, SC \r\n**Whitney Duree Dickert Pomaria, SC Katherine McCrae Ozburn Fort Mill, SC \r\n***Kambridge Christian Emde Simpsonville, SC Elizabeth Marie Parrish Camden, SC \r\nOliver Toure Francis Columbia, SC Heyward Guess Pearson III Greenville, SC \r\nDaniel Ryan Freiwald Walpole, MA Ashley Rae Pickel Lexington, SC \r\nTonya Alysha Gaines Greenwood, SC James Robert Poole Raleigh, NC \r\nTerry Lee Green, Jr. Anderson, SC Dallis Blaire Rawls Temple Hills, MD \r\n*David Russell Habersberger Carthage, TN Michael Eric Rodgers Batesburg, SC \r\n*Amy Jeanette Hamm Simpsonville, SC *Aimee Taylor Ryan Arlington, TX \r\nAnne Crane Hassold Greenville, SC *Victoria Lynn Sassano Greenville, SC \r\nJamie Natasha Hill Anderson, SC Whitney Ann Scheiner Baltimore, MD \r\nAndrew Phillips Hogue Columbia, SC Stacy Lynn Skelton · Greenville, SC \r\nAmy Lauren Hough New Holland, PA **Ilse Anne Snipes Columbia, SC \r\nSara Greer Howard Orlando, FL Philip Bryant Stone Great Falls, VA \r\n14 "
    },
    {
        "page_number": "23",
        "text": "Speech and Communication Studies (continued) \r\nShelley Elizabeth Swannack _______ Fort Bragg, NC Leslie Anne Webb ___________ Roanoke, VA \r\nElizabeth Stewart Swink Effingham, SC Ellen Elizabeth Webber Woodbridge, VA \r\nShelby Dawn T amres Reisterstown, MD Amy Gracelyn Welch Surfside Beach, SC \r\nJustin Ryan Tanner Dillon, SC Kevin Carl White Jonestown, PA \r\nErin Hamilton Taylor Columbia, SC Sarah Ann Wong Lexington, KY \r\nTorina Lenise Truesdale Lancaster, SC Jamie Lin Woodbrey Portland, ME \r\nDOUBLE MAJOR \r\nComputer Science and English \r\n**Jacob William Postle Buffalo, NY \r\nEnglish and History \r\n***Robert Oliver Garrison Elder ______ Wichita, KS Conor Francis Linehan __________ Fairport, NY \r\nEnglish and Philosophy \r\n**Peter Rogers Stone _________ Chester, SC \r\nEnglish and Spanish \r\n+***David Edwin Hood ________ Greer, SC \r\nEnglish and Speech and Communication Studies \r\nMelissa Michelle Santilli Metuchen, NJ \r\nHistory and Philosophy \r\n**Danyelle Ella-Marie Trexler Lisbon Falls, ME \r\nHistory and Political Science \r\n+**Christopher Michael Ramsey Easley, SC \r\nHistory and Production Studies in Performing Arts \r\nKent Elliott Brown Marietta, GA \r\nHistory and Secondary Education \r\nBrandon Timothy Blackwell Earles Grove, SC \r\nPolitical Science and Speech and Communication Studies \r\n*Katie Elizabeth Walter Rock Hill, SC \r\nSpanish and Speech and Communication Studies \r\nAdam West Lee ______________ Irmo, SC Erin Elizabeth Walley ________ Lawrenceville, GA \r\n**Ashley O'Brien Rockwell Greenwood, SC \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\n*Paul Stephen Beattie __________ Clayton, NY Lynn Leslie McLean III _________ Gastonia, NC \r\nTracy Eugene-Smith Bishop Lexington, SC Clifton Lee McMackin Lancaster, SC \r\nChristopher Steven Brookshire Tega Cay, SC Micah Julian Metcalf Wellford, SC \r\nPhillip Stewart Burnett Powdersville, SC ***Robert John Norris, Jr. Greenville, SC \r\nBrett Thomas Caldwell Richmond, VA Eric David Reeves Charleston, SC \r\nJeffrey Ryan Christanell Duluth, GA Phillip Arthur Rhoads Ill Greer, SC \r\nTimothy Justin Crumley Greenville, SC Elizabeth Lauren Schuler Charleston, SC \r\nKevin Patrick Davis Isle Of Palms, SC Gregory Lloyd Schultes Sewell, NJ \r\nRaymond Edward Duncan III Union, SC Pinkney Alonzo Staton IV Greenville, SC \r\nDaryl Colin Erskine Easley, SC Brandon Lee Thomas Marietta, GA \r\nTimothy Joseph Grandy Clemson, SC Benjamin Thomas Trussell Hanahan, SC \r\nAllen Richard Hawkins Anderson, SC Hans Peter Weinmueller Easley, SC \r\nBradley Davis Holeman Orangeburg, SC Annie Elizabeth Whiting Columbia, SC \r\nJoseph Anthony Holmes Conway, SC Allison Rae Wilkinson Aiken, SC \r\n*Amanda Susan Justice Fair Play, SC *Timothy Brian Willson Omaha, NE \r\nDesign \r\n**William Garry Algiere, Jr. ________ Easley, SC Elizabeth Payne McCabe ________ Knoxville, TN \r\n*Kathryn Elizabeth Allen Easley, SC Valerie Laine McClure Columbia, SC \r\n*Kenneth Allan Babinchak Charleston, SC **Andrew Seth McDowell Inman, SC \r\nJoshua David Bagwell Town ville, SC *Amber Cherise Odvody Lincoln, NE \r\n*Curt Hjalmar Berg Ill North Augusta, SC Morgan Howard Parsons Chattanooga, TN \r\n**Aaron Blake Bowman Elizabethton, TN Mildred Kathleen Powell Greenville, SC \r\n***Meghan Marie Clemmens Aiken, SC Shalena Rahsaan Rance College Park, GA \r\nAndrew David Crook Hartsville, SC *Claire Copeland Reddeck Lake City, SC \r\n+*Isaiah Dunlap Hopkins, SC *Thad Carroll Rhoden Chapin, SC \r\nMatthew McKay Gambrell McClellanville, SC Austin Mitchell Rhodes Charleston, SC \r\n+***Julie Roberts Garst Heath Springs, SC William Michael Ritchie North Augusta, SC \r\nLindsey Kay Georges Greer, SC Jennifer Lynn Rogers Anderson, SC \r\n*Lindsey Kathlene Holland Stella, NC Stephen Frederick Roth Madison, NJ \r\nWilliam Eml Ives Nokesville, VA *Benjamin Harris Settle Spartanburg, SC \r\nJnn<nhan fafo.:ard Lowder Lexington, SC *Peyton Withers Shumate Tampa, FL \r\n:\\kih) i\\Lnsumoto Tokyo, Japan Melanie Teresa Smith Spartanburg, SC \r\n15 "
    },
    {
        "page_number": "24",
        "text": "Design (continued) \r\nRobert Andrew Thompson _______ Spartanburg, SC Michael Gillespie Ward ________ Columbia, SC \r\nDavid Jonathan Vliet Belvidere, NJ Bobbie Jo Wilder Graniteville, SC \r\nEloise Virginia Wall Central, SC Kelly Rebecca Williamson St Petersburg, FL \r\n*Benjamin Martin Ward Fort Mill, SC \r\nCOLLEGE OF BUSINESS AND BERA VIORAL SCIENCE \r\nJERRY EUGENE TRAPNELL, Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\n***Jonathan Mark Blumenstein _____ Greenwood, SC Lindsay Elizabeth Watts _______ Charlottesville, VA \r\nChristopher Simms O'Neal Charleston, SC Brandt Frederick Zimmerman Purcellville, VA \r\n**Christina LouAnne Redmon Fort Mill, SC \r\nPolitical Science \r\nStephen Jay Aaron, Jr. Greer, SC John Matthew King ________ .,--_ Kingsport, TN \r\n*Amanda Marie Anderson Edgefield, SC Katie Erin Koenen Herndon, VA \r\nClinton Thomas Barry ·Williamston, SC **Huong Thien Thanh Lam Myrtle Beach, SC \r\nAmanda Hope Becker New Orleans, LA Adam West Lee Irmo, SC \r\nVictor Alan Brannon, Jr. Greenwood, SC Christina Venetta Leventis Sumter, SC \r\nCharlie Dallas Butler, Jr. West Columbia, SC Kevin Gordon McDonald Sea Isle City, NJ \r\nVictor Nicholas Carlson Johnston, SC Julie Anne Miskelly Hickory Grove, SC \r\nCecilia Jeannette Carroll _Watkinsville, GA Albert Moseley, Jr. Sumter, SC \r\nWesley Adair Covington Norway, SC ***Timothy Joseph Pasken Lakeland, FL \r\n*Elizabeth Joanne Davis __ --· __ Spartanburg, SC Claude Arthur Poole II Tipp City, OH \r\nLindsay Marie Davis __ Columbia, SC Elizabeth Caughman Rauch Lexington, SC \r\nDaniell Vincent Dedels · Powell, OH *Katharine Rebecca Saggiotes Wayne, PA \r\n**Thomas Eugene DeM/ne III North Augusta, SC **Jerrilea Kae Smith Dillon, SC \r\nMolly Paige Derrick Batesburg, SC \r\n**Brien Rose Dev~ Columbus, OH \r\n***Ryan Scott Solomon Charleston, SC \r\nNathan William Spice Cleveland, OH \r\nMelissa Diane DjcKson Greenville, SC Robert Samuel Stewart Lansdale, PA \r\nRobert Samup: Dunaway III Anderson, SC James A. Stramaski, Jr. Saltsburg, PA \r\nLaura Christlne Dunn Lexington, KY +*Andrea Janelle Stroud Danville, VA \r\nTerry Lee Green, Jr. Anderson, SC *Matthew David Theodore Summerville, SC \r\nSarah Joann Hammond Camden, SC Kate Camille Visk Spartanburg, SC \r\nJessica Felicia Hunt Conway, SC Andrea Nichole Williams Windham, ME \r\nPsychology \r\nAmanda Hogan Barnes __________ Clinton, SC Kerri Ann Kender __________ Ridgewood, NY \r\n**Mary Michael Bonfanti Baton Rouge, LA ***Melissa Kay Kinder Pendleton, SC \r\nLaura Francis Bryant Darlington, SC Adrienne Marie Langbauer Midland, MI \r\nMatthew Aaron Cavin Columbia, SC Toby Allison Long Hagerstown, MD \r\nAmanda Ellen Craig Greer, SC Lauren Marie Marocco Little Falls, NY \r\nJason Michael Craig Taylors, SC Tania Beth Mazur Clemson, SC \r\n+**Jessica Lynn Diebel Ponte Vedra Beach, FL *Robert Lee McKie IV North Augusta, SC \r\nDaniel Anthony DiMarzio North Canton, OH ***Scott Paul Mirabile New Orleans, LA \r\n*Katherine McManus Dorsey Atlanta, GA *Mariko Starr Mitchell Myrtle Beach, SC \r\n**Kia Lorraine Douglas Columbia, SC Ato I. Modibo Beltsville, MD \r\nEnglish Elizabeth Edwards Columbia, SC +**Thomas Hazen Perlet Ashton, MD \r\n***Michelle Leanne English Simpsonville, SC Sara Margaret Ratchford Gastonia, NC \r\n*Rachael Maura Erfurt Rockville, MD *Kelly Leigh Riddle Greenville, SC \r\nCarrie Elizabeth Fam Florence, SC William Michael Rodes Irmo, SC \r\n**Kaycee Wynette Filyaw Lake City, SC Casey Lauren Sanders Spartanburg, SC \r\n*Kimberly Ann Gagliardi Trumbull, CT *Marianna Landon Sartin Rock Hill, SC \r\n***Juliet Camille Galton Myrtle Beach, SC Amanda Beth Schaffstall York, PA \r\nQuinn Elizabeth Garahan Rock Hill, SC Kristina Lynn Singletary Goose Creek, SC \r\nSara Lauren Gianino Palm City, FL Stacey Denae Sobotka T urnersville, NJ \r\nRonika Ashani Gore York, SC *Candace Renee Threat Bethlehem, GA \r\nKimby Michelle Graves Hemingway, SC Stephanie Heather Warshaw Stone Mountain, GA \r\n**Gena Roxanne Guerzon Summerville, SC * Azian Benai Washington Orangeburg, SC \r\nKatherine Denise Johnson Greenville, SC +***Kathleen Allston Willet Rock Hill, SC \r\nSociology \r\nSusannah Marie Burke ___________ Miami, FL *Leigh Anne Hix ____________ Woodruff, SC \r\n*Lauren Grace Cameron Midlothian, VA **Billy J. Lewis San Diego, CA \r\nJames Vinson Cerqua Six Mile, SC Jeffrey Daniel Martin Seneca, SC \r\nNancy Lee Clawson Hemingway, SC Tracy Lynne McDonald Flower Mound, TX \r\nMary Elizabeth Ford Central, SC Nichole Leigh Miner Greer, SC \r\nAustin Wyatt Frieman Haverford, PA *Patricia Diane Mullinax Greenville, SC \r\nKrystal Veleka Gambrell Anderson, SC Jason Dale Murphy Salem, SC \r\nTameka Getay Graham · Lake City, SC *Jennifer Lynn Murr Beaufort, SC \r\nDarrien Bernard Harrison Orangeburg, SC Shannon Lynn Nelso~ Charleston, SC \r\nVanessa Lynne Hartley Charlotte, NC Sherri Lynn Owen Clemson, SC \r\n**Marissa Ellen Heslin Lilburn, GA *Kristen Anne Roessner Manasquan, NJ \r\n16 \r\n• "
    },
    {
        "page_number": "25",
        "text": "I \r\nSociology (continued) \r\n*Jennifer Gamble Setzler _________ Kingstree, SC Misti Dawn Stegall ------------ Easley, SC \r\nLauren Beth Smith Greenville, SC Nancie Elizabeth Stover Camden, SC \r\nDOUBLE MAJOR \r\nEconomics and Philosophy \r\n*Bryan Douglas Buckley ________ Easley, SC \r\nEconomics and Political Science \r\nChristopher Ryan Johnson Albany, NY \r\nEconomics and Spanish \r\n**Marshall Hayes Sanders Brentwood, TN \r\nEnglish and Political Science \r\nKimairis Leah T oogood Centreville, VA \r\n· History and Political Science \r\nMatthew John McCoy Westminster, SC \r\nPolitical Science and Psychology \r\nNoel Robert Coakley _________ Marshfield, MA **Sarah Louise Hinnant ________ Winnsboro, SC \r\nPolitical Science and Spanish \r\n*Amy Marie Cosgrove ______ Ponte Vedra Beach, FL ***Lauren Elizabeth Fascett _________ Irmo, SC \r\nPolitical Science and Speech and Communication Studies \r\nJohn Wayne Crolley Myrtle Beach, SC \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nCheryl Lynne Ascenzo _________ Cumming, GA *Matthew Paul Mrosek _________ Rock Hill, SC \r\nLeigh Connor Berry Mt Pleasant, SC Dale Lamer Percival Rock Hill, SC \r\nAmanda Marie Bishop Jonesboro, GA **Stacy Danielle Peterson Holly Hill, SC \r\nDouglas David Bunch Isle Of Palms, SC Stephan M. Price Tamassee, SC \r\nSandra JoAnne Carswell Landrum, SC Angela Denise Reid Walhalla, SC \r\n*Travis James Cave Hopkins, SC **Julie Anne Rogers Williamston, SC \r\nSteven Gregory Cochran Bristol, TN Rashad Marquette Rogers Bishopville, SC \r\nMehrdad Compani Roswell, GA Catherine Charlotte Sams Anderson, SC \r\n+**Melanie Renee Edwards Lexington, SC Courtney Allyson Schaub Columbia, MD \r\n+***Amanda Katheryn Folk Lexington, SC Laura Leigh Smith Chesnee, SC \r\nRoscoe Haynes, Jr. Moncks Comer, SC **Dara Lane Southard Rock Hill, SC \r\n***Joseph Eugene Heatherly Jonesville, SC **Mary McMeekin Stevenson Lancaster, SC \r\nCarolyn Ruth Laura Wellington, FL *Kimberly Anne Urban Conway, SC \r\n*Dawn Rose Markovics Pittsburgh, PA *Laura Elizabeth Vaughan Union, SC \r\n**Karen Elizabeth McKinney Easley, SC +**Christina Marie Yotz Geneva, IL \r\nDonna Sharee Mishoe Columbia, SC **Russell Edward Young Honea Path, SC \r\nEconomics \r\nJonathan Ryan Aikin ________ Virginia Beach, VA Douglas Jay Johnson __________ Pittsburgh, PA \r\n*James Rufus Bratton III Florence, SC Philip Robert Lalle Paoli, PA \r\nPaul Bryan Burnett Spartanburg, SC Ryan Collins O'Sullivan Moore, SC \r\n*Ellen Elizabeth Coble Columbia, SC Kirk Huggins Rogers Florence, SC \r\n+*Ryan Monroe Coogler Cupertino, CA Christopher Joseph Romano Atlanta, GA \r\nMarshall Gregory Darley Lilburn, GA Viola Clare Simpson Southbury, CT \r\nAbigail Case Dennison Manchester, CT Scott Edward Stefanowicz Westford, MA \r\nJonathon Owens Folds Lilburn, GA Christopher James Vassil Harleysville, PA \r\nMatthew James Gordon North Augusta, SC David Alan Westerlund, Jr. Westminster, CO \r\nPatrick Thomas Hitpas Andover, NJ Bruce Roger Williams III Enterprise, AL \r\n*Brent John Hutcheson Fountain Inn, SC Gerald Glen Wilson, Jr. Spartanburg, SC \r\nThomas Jay Ingle Aiken, SC ***Jessica Zinna Ottsville, PA \r\nPatrick Lane Jennings North Potomac, MD \r\nFinancial Management \r\nJoseph Michael Bever -------- Vancouver, WA *Stephanie,Leigh Delisle Floyd ______ Clinton, SC \r\nThomas Chappell Boozer, Jr. Columbia, SC *Meredith Lynn Fowler Dallas, TX \r\nKevin James Braddock Point Pleasant Beach, NJ Ellen Cutlip Frame Orange Park, FL \r\n*Melissa Charlea Syracuse Brown ·Powdersville, SC Paul Gustave Gelardi Centerport, NY \r\nTodd Franklin Cartee Liberty, SC Amin Lamonte George St Thomas, Virgin Islands \r\nChristian Patrick Chambers Cayce, SC *David Scott George Mauldin, SC \r\nDavid Andrew Chambers Washington, PA Henry W. Harper Walhalla, SC \r\n*James Allen Church Greenville, SC Ryan Edward Higgens North Attleboro, MA \r\nKimberly Page Coan Spartanburg, SC Brian Denis Holtmeier Wyoming, OH \r\nLeslie Elizabeth Compton McClellanville, SC Jamie Lynn Howard Villa Rica, GA \r\nLee Patrick Crowther Clemson, SC +*Brian Daniel Huber Lexington, SC \r\n*Amanda Jean Curtis Chesterfield, SC Coy Vemett Jones III Greer, SC \r\n*Jessica Nicole Dean Snellville, GA Jeremy Allen Jutzeler Charleston, SC \r\nMatthew Gregory Evans Springfield, VA Christopher Louis Kaplan Greenville, SC \r\n17 "
    },
    {
        "page_number": "26",
        "text": "• Financial Management (continued) \r\n*Caroline Elizabeth Kesler Roswell, GA Thomas Christopher Pipich Pittsburgh, PA \r\nKevin Andrew Kilgore Mauldin, SC Barclay Dean Reiser Dawsonville, GA \r\nDavid Oren Kochba Great Falls, VA Travis Lamar Roberts Folkston, GA \r\nMatthew Houseal Koon North Augusta, SC Jennifer Moira Shlesinger Marietta, GA \r\n***Lauren Kimball Kraft Madbury, NH Matthew Campbell Sides Fort Mill, SC \r\nHeather Jean Lavanish Sumter, SC Tobe Sizemore III Greenville, SC \r\n**Jodi Christen Laws Greenville, SC Michael Madden Skelton New Fairfield, CT \r\nJesse Lee Lempesis Charleston, SC Daniel George Snider Greer, SC \r\nAnsel Brent Lovell Myrtle Beach, SC **Jennifer Lynne Stewart Spring, TX \r\n*John Timothy Merrell Walhalla, SC **Jessica Marie Stoots Kingsport, TN \r\nMeredith Carol Millender Greenwood, SC William Bradley Talkington Austin, TX \r\nJoshua McKendree Mitchell Batesburg, SC Bradley Nicholson Vaughan Greenville, SC \r\n+*Elizabeth Abigail Moore Kenosha, WI Virginia Gene Vogel Lansdale, PA \r\nCasey Louise Nickles Greenwood, SC *John Movius Warren III Easley, SC \r\nJoshua Micah Owen Simpsonville, SC *Rachel Elizabeth Weightman Burlington, VT \r\nBhavesh Jayanti Patel Rock Hill, SC Melissa Renee Williams North Charleston, SC \r\nJustin David Patrick Barrington, RI +***Stacey Marie Williams Memphis, TN \r\n***Justin Lee Perdelwitz Simpsonville, SC Joshua Andrew Wright Darlington, SC \r\nGraphic Communications \r\n*Catherine Melissa Atkinson Marion, SC *Susan Elizabeth Johnson Kingsport, TN \r\nStacey Quinn Brower Clemson, SC Moriah Elizabeth Kanoy Goose Creek, SC \r\nVina Isip Bunao Clemson, SC Melinda Jane Macky North Augusta, SC \r\nErika Michelle Castro Columbia, SC *Andy Nicholas Markl Lexington, SC \r\n*Katherine Dilworth Clarke Columbia, SC *Brian Wayne Matthews West Columbia, SC \r\nJohn Mark Cliver Mt Airy, NC +*Sarah Elizabeth Parsons Moncks Comer, SC \r\nFarrell Michele Finstad Yuba City, CA Jeffrey F. Pavao Annapolis, MD \r\nJeffrey Lee Hall, Jr. Jonesboro, GA Rebekah Anne Shennan West Columbia, SC \r\n**Nicole Danielle Hanfland West Columbia, SC William Lunsford Richardson Smith Charlotte, NC \r\nRichard Dennis Harrington II Alpharetta, GA Harry Starr Thompson Charlotte, NC \r\nKenneth Elton Hawkins Beaufort, SC Alan Williams Welchel Greer, SC \r\n+*Dionna Danielle Hendrix Greer, SC Laura Kathleen Weltzien Duluth, GA \r\nBethany Charlene Johnson Conway, SC \r\nIndustrial Management \r\nChristopher Duane Barnes Greenwood, SC Paul Kendall Moore, Jr. Mt Pleasant SC \r\nChristopher Aubrey Daniel Spartanburg, SC Chad Patrick Ridgeway Williamston, SC \r\nDaniel Martin Griffin III Anderson, SC Kevin Ray Tucker Inman, SC \r\nHenry Benjamin Jones, Jr. Mt Pleasant, SC \r\nManagement \r\nEugene Talmadge Abercrombie III Brittan's Neck, SC ***Chrystal Marie Johnson Conway, SC \r\n*Mark Kneisley Ables Charleston, SC Kristin Elise Kelly Greenwood, SC \r\nJulio Antonio Alboni Spartanburg, SC Hoon Kim Greer, SC \r\nElizabeth Julia Barnum Columbia, SC Randolph Eric Knight Hanahan, SC \r\nJames Randolph Benz Boxborough, MA Joseph Nicholas Lane Spartanburg, SC \r\nJonathan Brooks Bishop Greenwood, SC Ryan Joseph Lewis Roswell, GA \r\n*Kathie Lewise Bobbitt Easley, SC Jennie Ann~ Lominack Newberry,' SC \r\nAngela Maria Bocchicchia Sumter, SC Kirsten Marie Madsen Rock Hill, SC \r\nJeffrey Todd Brewer Greer, SC Robert Christopher Marines Portland, OR \r\n*Mary Abernethy Brewer Greensboro, NC Andrea Lisa Martin Rockville, MD \r\nJack Ross Brewst~r III Duluth, GA Carolyn Jeanne Mason Greenville, SC \r\nJenny Marie Brinkman Harrisonburg, VA **Jessica Ann McCloy Florence, SC \r\nDana Catherine Brown Columbia, SC Lauren Courtney McCormick Rock Hill, SC \r\nJennifer Diane Brown Annapolis, MD David Hood Mitchell III York, SC \r\nRansom Lewis Bryan I II Edgefield, SC Joseph Bart Morelli Mauldin, SC \r\nEdward James Carnes Aiken, SC +*Johanna Elise Morrison Leonia, NJ \r\n*Qui Ping Chen Pickens, SC Brian David Moynihan Lilburn, GA \r\nPhillip Lyn Craft Anderson, SC Matthew Jay Needel Belmont, MA \r\nRobert Edward De Vaux IV Marietta, GA James Robert Nettles Spartanburg, SC \r\n*Benson Hall Driggers Hartsville, SC Jonathan Matthew Newman Brielle, NJ \r\nThomas James Ennion, Jr. Billerica, MA **Matthew Allen Norman Vienna, VA \r\n***Marlon Pangan Errazo Charleston, SC David Anthony Ogunwo Arlington, VA \r\n*Michael Paul Fitzpatrick Chantilly, VA Robb Patton Parsons Hendersonville, NC \r\nLee Adam Fretts Scottdale, PA Bhavesh Jayanti Patel Rock Hill, SC \r\nElizabeth Lorraine Gavin Aiken, SC ***Kristen Leanne Pawlowicz St Louis, MO \r\n*Samuel Allan Gillooly Maryville, TN Ian Joseph Piekutowski Clemson, SC \r\nJacob Jackson Graff Traverse City, MI Trisha Elaine Pilgrim Six Mile, SC \r\nChristopher Allen Groover Alpharetta, GA *Harriet Chisolm Poe Greenville, SC \r\nZachary Glenn Harris Hermitage, TN Philip Marlon Powell Walhalla, SC \r\nCharles William Hipp, Jr. St Matthews, SC (Degree awarded posthumously) \r\nRobert Walker Holt Greensboro, NC Tory Scott Raushenberger Greenville, SC \r\nWeston Michael Hopkins Bennettsville, SC *Jessica Rae Reeve Wayne, PA \r\n*Lachelle Monique Howell Cross, SC *Jason Wesley Reynolds Hartsville, SC \r\nAndrew Scott Johnson Sandwich, MA Matthew Vance Robinson Greenville, SC \r\nBrian Edward Johnson Kingstree, SC Mark Benjamin Schmidt Greenville, SC \r\n18 "
    },
    {
        "page_number": "27",
        "text": "Management (continued) \r\nJoy My Vong --..,....-----------Charleston, SC \r\nDawn Michelle Weise Stone Mountain, GA \r\nEdward Antonio Scott __________ Eastover, SC \r\nAndrea Helen Sheinkopf Atlanta, GA \r\nLeah Kathryn Shell Montrose, AL Matthew Brandon Weitz Easton, PA \r\n*Seth David Shores Heath Springs, SC *Meredith Leigh Wells Anderson, SC \r\nEric Patrick Sloan Milton, FL Aimee Mattea Whitlock Liberty, SC \r\nMatthew Bryan Smathers Canton, NC John Mark Wilkins Blacksburg, SC \r\n*Milena Nicolaeva Stanoycheva Sofia, Bulgaria Krystal Marie Williams Rio, WV \r\nCraig Michael Suppin Marlton, NJ *Amanda Leigh Windham Easley, SC \r\nJohn Joseph Tighe IV Charlotte, NC Adam Christian Witt Warrenton, VA \r\nSteven Andrew Tolar Anderson, SC Mark Andrew Witt Columbia, SC \r\n**Amy Leigh Tolley Bristol, VA +***Jessica Zinna Ottsville, PA \r\nBradley David Toy Greer, SC \r\nMarketing \r\n*Miranda Renee Abee __________ Hickory, NC Jessica Delaine Gilstrap __________ Easley, SC \r\nJoshua David Adams Arlington, TX Dean Anthony Givens Columbia, SC \r\nRonald Kevin Alexander Pickens, SC Jeremy K. Greene Fairfax, VA \r\nAdrianne Beth Ament Wausau, WI Ashlea Elizabeth Hall Abbeville, SC \r\nGregory Charles Angel Severna Park, MD *Amanda Anne Hammon Sumter, SC \r\n*Bryan Patrick Anton Philadelphia, PA Charles Elliot Harper Quincy, FL \r\nEdward Joseph Arecco Columbia, SC *Karen Elaina Harrill Columbia, SC \r\nEmily Harrison Arrington Greenville, SC Tara Leigh Hawkins Anderson, SC \r\nClair Javis Austin Clemson, SC Justin Cleveland Henderson Greenwood, SC \r\nKimberly Rogers Bachelder Hilton Head Island, SC Tamara Lilliann Hess Bluffton, SC \r\nJustin G. Batt Bryan, OH *Paul Frederick Hill III Acton, MA \r\nEric Alexander Bent Poolesville, MD **Mary Hannah Hopkins Pendleton, SC \r\nJessica Blair Betcher Boulder, CO *Andrew Lamar Howard Walhalla, SC \r\nJeffrey Stephen Bilyk Bayport, NY Robert Lewis Howell IV Greer, SC \r\nSara Christine Bowers Greenville, SC Kent Anthony Hrubala Ellington, CT \r\nChristopher James Bowman Atlanta, GA · Anna Marie Irwin Laurens, SC \r\nChristopher Myers Brown Charleston, SC **Megan Nicole Kellos Greenville, SC \r\n**Farrell Hutto Bull Holly Hill, SC William Clay Kennington Charlotte, NC \r\nCarole Lee Butler Conway, SC Julie Lynn Killen Wyoming, OH \r\nErin Ashley Caldwell Columbia, SC Adam Michael Klotzbach Fairfield, OH \r\nRobyn Lindsey Caldwell Charleston, SC Matthew Lee Knarr Savannah, GA \r\nBenjamin Elias Caram Lexington, MA Matthew Justin Knight Mauldin, SC \r\nChad Christopher Carlson Greenville, SC Meredith Ruth Knight Charleston, SC \r\nAmy Todd Carmichael Roanoke, VA Shawn Thomas Knight Hilton Head Island, SC \r\nNathan Corey Chadwick North Attleboro, MA Lindsay Judith Kramer Lexington, SC \r\nHeather Marie Chisum Beaufort, SC Morgan Nicole Latimer Middletown, OH \r\n*Meghann Elizabeth Clifford Charlotte, NC Chad Thomas Laxton Fountain Inn, SC \r\nCarlos Reshod Coleman Gaffney, SC *Catharine Goodman Lee Mt Pleasant, SC \r\nEvan Zebadiah Cook Anderson, SC Natalie Rae Leuck Burlington, NC \r\nRobert J. Cook III Clover, SC Erin Michelle Lewis Dover, DE \r\nStacey Anne Coonan Greenville, SC Robert John Lombardi Dublin, OH \r\nMcKenzie Britt Cooper Lexington, SC Dennis Carlisle Looney, Jr. Anderson, SC \r\nJulie Elizabeth Copan Fairfax Station, VA Shawn Joseph Lynch Foxboro, MA \r\nChristopher Gerhard Copple Rock Hill, SC Marcia K. Martin Millstone, NJ \r\nJohn Louis Cote III Myrtle Beach, SC German Elberto Martinez Columbia, South America \r\nLauren Elizabeth Cox Fort Mill, SC +*Amanda Ellen Mathey Painted Post, NY \r\nWilliam Edward Crawford Starr, SC *Richard Edward McBride, Jr. Tabernacle, NJ \r\nAbasi Shakir Crouch Simpsonville, SC Ashley Danielle McCoy Seneca, SC \r\nClaire LaDene Crowder Spartanburg, SC ***Earl O'Neil McGoy III Myrtle Beach, SC \r\n+*Thomas Robert Cuff Silver Spring, MD Amanda Lela McDuffie Iva, SC \r\nJustin Heath Davis Orangeburg, SC Amanda Palmer McGinn Clemson, SC \r\n*Brianne Marie Dear Greenville, SC Jamee Joers McQuown Fairfax Station, VA \r\nKitty Larissa Diefenbach Savannah, GA Colleen Elizabeth McSherry Milford, CT \r\nWilliam Reid Durham Greenville, SC Scott Henry Meece Easley, SC \r\nSteven Phillip Eason, Jr. Charleston, SC Andrew Jonathan Meek Pittsford, NY \r\nAndrea Lynne Eckenrode Elizabethtown, PA Lauren Condon Meyer Charleston, SC \r\nNichole Marie Fanning Norway, SC Alison Marie Mielke Lancaster, SC \r\n*Kate Elizabeth Ferguson Marietta, GA Kimberly Rebecca Miller Easley, SC \r\nKelly Anne Fitzgerald Annapolis, MD Jared Richards Moise Arlington, TX \r\nMichael Barry Flahive Westford, MA *Brenda Kay Moore Anderson, SC \r\nChrisoula Leslie Floyd Laurens, SC Matthew Edward Moore Greenville, SC \r\n*Katherine Anne Foster Lilburn, GA Daniel Patrick Moors Charleston, SC \r\n**Michelle Lee Fracalossi Baltimore, MD Joshua Murdoch Muirhead North Charleston, SC \r\nTravis Lee Free Fountain Inn, SC Shannon Devon Muldrow Florence, SC \r\nLauren Elizabeth Furr Columbia, SC Laura Elizabeth Murphy Roswell, GA \r\nLeslie Greer Gardner Hartsville, SC Tomas Nagys Mazeikiai, Lithuania \r\nRichard Lartigue Garick, Jr. Orangeburg, SC Crisha Angela Nalley · Easley, SC \r\n*William Ryan Gasque Murrell's Inlet, SC John Wesley Newton Charlotte, NC \r\nJohn Casey Gavin Marietta, GA Lori Allison O'Callaghan Atlanta, GA \r\nJennifer Knipe Geer Clemson, SC ***Ryan Matthew Orendorf Franklin, TN \r\nMary Allison Gill Timonium, MD Meredith Anne Orr Cheraw, SC \r\nElizabeth Anne Gilliam ·Marietta, GA Nicholas James Paul Alpharetta, GA \r\n19 "
    },
    {
        "page_number": "28",
        "text": "Marketing (continued) • \r\nCortney Ann Pease Fairfax, VA Susan Parker Smith Hilton Head Island, SC \r\nBridget Cassandra Pittman Decatur, GA *Kimberly Michelle Souther Hendersonville, NC \r\nAmanda Kay Pottorff Williamston, SC Jamie Coleman Taylor Monkton, MD \r\nJohn Nick Poulos Miami, FL Jennifer Joy Thomas North Augusta, SC \r\n**Melanie Erin Pulver LaGrange, GA Charles lmpey Thompson IV Isle Of Palms, SC \r\n**Zachary Thomas Rich Lambertville, NJ Damian Joseph Thome New Ellenton, SC \r\nDavid Zachary Richardson Winston,Salem, NC Andrew B. Wade Eastham, MA \r\nStephanie Eugenia Richio Cape Elizabeth, ME David Campbell Waller Greenville, SC \r\nMatthew Brian Ritter Spartanburg, SC **Heather Alexa Warner Seneca, SC \r\nChristopher Tyler Rogers Easley, SC Morgan Leigh Weatherford Lugoff, SC \r\nSteven Mitchell Rogers Greenville, SC Courtney Ann Weaver Greenwood, SC \r\nBrandon Pate Rollins Florence, SC Jared Wesley Whitehead Rock Hill, SC \r\nKyle Nicholas Rozek Simpsonville, SC **Amanda Aline Williams Alpharetta, GA \r\nWilliam Fitzgerald Rutherford IV Columbia, SC Ellen Nicholson Williams Laurens, SC \r\nDusty Ryan Saine Newton, NC Kristin Lee Williams Mt Pleasant, SC \r\nCaroline Grey Shelley Pawley's Island, SC Carter Marie Willis Columbia, SC \r\n*Michael Brent Shuler, Jr. Mt Pleasant, SC Elizabeth McClenaghan Wilson Greenville, SC \r\nJeremy Moore Shyatt Clemson, SC Scott Wing Clemson, SC \r\nLeeAnne V. Sieck Y onges Island, SC Kyle Gates Winslow Kingston, NH \r\nBrooke Renee Simmons Summerville, SC *Adam David Witty Orlando, FL \r\n**Allison Elizabeth Simons Holly Hill, SC John Blackbum Woelfel Clemson, SC \r\nAshawnti Miquel Smith Honea Path, SC Alice Elizabeth Woods Greenville, SC \r\nLeosha Toren Smith Liberty, SC Pamela Kay Zarrilli Montclair, NJ \r\nPolitical Science \r\nCristina Marie Casillo Blythewood, SC Jeremy Craig Hodge Spartanburg, SC \r\nVictoria Claire Foster Norcross, GA *Brent John Hutcheson Fountain Inn, SC \r\nGlenn Whitfield Harvin Marietta, GA \r\nPsychology \r\n***Justin Douglas Amburgey Middletown, OH +*Caroline Davis Knox Charlotte, NC \r\n***Marcus W. Anderson Myrtle Beach, SC Lori Michelle Langford Hilton Head Island, SC \r\nAudrey Claire Bennett Greenville, SC Catherine Lindsay Lee Orange Park, FL \r\n***Carla Marie Berry Matthews, NC ***Erin Leigh Lindsay Edgefield, SC \r\nNorbert Jason Borke Simpsonville, SC Siobhan Bernice Lindsey Thomasville, GA \r\nIan Michael Burdett Charleston, WV Mary Catherine Manning Fairfax Station, VA \r\n***Jenna Kirsten Burtch Holland, MI *Susan Elizabeth Martin Chapin, SC \r\n**Sara Elizabeth Carman Rochester, NY Erin Ryanne McCall Greenville, SC \r\n*Randall Lowndes Charpia, Jr. Summerville, SC Jason Tyrone McGee Toccoa, GA \r\nMarcus Joseph Colicelli Newark, NJ **Lindsay Elizabeth Meek Columbia, SC \r\n*Kathryn Leigh Conard Clyde, NC Grant Butler Morgan Greenville, SC \r\nWhitney Ann Cook Dunwoody, GA Katharine Anne Packard Arlington, VA \r\n***Casey Brooke Cottrill Blacksburg, VA +**Kristy Marie Seigfried Shickshinny, PA \r\nJulia Marie Cunningham Columbia, SC Matthew Derek Senn Columbia, SC \r\nHillary Elizabeth Dann Mauldin, SC Alicia Lee Stribling Town ville, SC \r\nKatrina Michelle Davis Seneca, SC Joshua Lussan Summers Beaufort, SC \r\nAnnie Catherine Donohue Villanova, PA Susan Elizabeth Sutherland Asheville, NC \r\n***Sarah Austin Eaves Sumter, SC James Robert Tan is Lawrenceville, GA \r\nCourtney Lynn Ellis Edmonds, WA Sara Ann Trickey Charleston, SC \r\n**Nicholas Andrew Farr Greenville, SC Laura Ann Trimble Hickory, NC \r\nDerek Cromley Forrest North Augusta, SC +***Hanan Dalya Trotman Decatur, GA \r\nMelany Nicole Franklin Greenville, SC Joseph Ryker Walling Speedwell, VA \r\nJill Elizabeth Funderburk Lancaster, SC *Melissa Mershon Warthen Vidalia, GA \r\nKatherine Marie Grubbs Alpharetta, GA +**Nicole Angela Weatherby Leetsdale, PA \r\n*Robert William Isenhower III Spartanburg, SC Lisa Denise Westlake Alta Loma, CA \r\n*Emily Marie Jackson Monroe, NC +**Leanne McLeod Whaley Durham, NC \r\n*Kathryn Ann Jacokes Sevema Park, MD Sarah Ellen Wise Winston,Salem, NC \r\nTimothy Alexander Jannik North Augusta, SC \r\nSociology \r\nGregory Thomas Coutu Anderson, SC Ashleigh Jacqueline McDaniel Irmo, SC \r\nQuinetta La'Shae Hall Charlotte, NC Amanda Leigh McDonald Travelers Rest, SC \r\nAnna Laura Hare Anderson, SC Brandi Leigh Parrish Aiken, SC \r\nEvan James Landreth Pendleton, SC Laura Suzanne Windham Florence, SC \r\nSarah Beth Mahady Newnan, GA \r\n20 "
    },
    {
        "page_number": "29",
        "text": "COLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF ARTS \r\nChemistry \r\nJoshua Michael Gwirtz _________ Pittsgrove, NJ ***Indrek P. Meyer _________ Middletown, OH \r\nComputer Science \r\nMarvin Jermel Douglas ________ Rock Hill, SC **Zachariah James West _______ Simpsonville, SC \r\nHarold Jorge Garcia Springfield, VA \r\nGeology \r\nMark Vanley Ryland _______ Richmond, VA \r\nMathematical Sciences \r\n+***Jonathan William Bayless ______ Knoxville, TN +***Benjamin Clayton Sloop ______ Orangeburg, SC \r\n**Traci Ann Hedetniemi Clemson, SC \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering \r\nDevon Beatrice Beaty ----------Chester, SC **Kristine Anne O'Connor ________ Raleigh, NC \r\nKristy Lynn Conwell Greer, SC Sarah Ann Seigler Augusta, GA \r\nCheryl Teresa Gomillion Aiken, SC **Jason Thurman Stewart Easley, SC \r\nJanie Shontavia Jackson Aiken, SC William Caldwell Wier Barnwell, SC \r\nBrandy Layne King Chapin, SC Ian Douglas Wilson Blue Ridge, SC \r\n*Crystal Dawn Myers Bennettsville, SC \r\nCeramic Engineering \r\n*Stacia Lynn Barrow ________ Goose Creek, SC *Zachary Steven Klipowicz ________ Tega Cay, SC \r\nSteven Chad Bateman Lexington, SC Erik Kennedy Larson Westfield, NJ \r\nRaymond Alan Gary Charleston, SC Andrew John McDonald Whitesboro, NY \r\nJennifer Rene Gunter West Columbia, SC Christopher George McDuffie Dillon, SC \r\n***Jeffrey Brett Hardesty Clarksville, MD *Robert Jeffrey Reynolds Greenville, SC \r\nWallace Dean Hughes, Jr. Walhalla, SC **Charles Alexander Wensley Rock Hill, SC \r\nChemical Engineering \r\nHilary Bryan Anderson ________ Spartanburg, SC Jon Kyle Logue ____________ Hatboro, PA \r\nJulia Elizabeth Beach Spartanburg, SC Audrey Lanier Lytle Inman, SC \r\nDavid Christopher Beck, Jr. Birmingham, AL **Angela Rae Manning Simpsonville, SC \r\nJustin Robert Bouknight Columbia, SC Jennifer Ann Masters Fair Play, SC \r\n*Eric Michael Brannen Chapin, SC Christopher Ian McDonald Lugoff, SC \r\nWilliam Edward Brown Aiken, SC *Daniel Joseph Messervy Mt Pleasant, SC \r\n*Jean Marie Bryan Greenwood, SC Clyde Marcus Moak II Summerville, SC \r\nJohn M. Burgess Argentia, Newfoundland Kessia Tamese Nadira Moore Edgefield, SC \r\nJoshua Stewart Carpenter Lacey's Spring, AL Gerald Jay Murphy Columbia, SC \r\nShawn Stafford Carter Laurens, SC Amber Eve Myers Bennettsville, SC \r\nJared Lee Clark Piedmont, SC Steven Robert Newcombe Clemson, SC \r\nTimothy Michael Covell Goose Creek, SC Christopher David Norman Richmond, VA \r\n**Robert Atkinson Darby III Mt Pleasant, SC *Laura Margaret Phipps Roanoke, VA \r\nAllison Nicole Derrick Batesburg, SC *Rebecca Lynne Presley Bristol, TN \r\nRachel L. Donica Florence, SC *Christopher Michael Rigdon Charleston, SC \r\nAnayo Chinedu Ezenekwe Mauldin, SC Azadeh Samadi~Dezfouli Clemson, SC \r\nEdward William Fritz, Jr. Fort Mill, SC Samuel Keith Seal, Jr. Greensboro, NC \r\nJonathan Glenn Garrick Greenville, SC Cortney Lynn Seamon Canonsburg, PA \r\n*Jason Robert Gaudet Peabody, MA **Christopher Andrew Shuler Columbia, SC \r\n*Leo Angelo Gumapas North Charleston, SC *Lindsay Teal Sims Florence, SC \r\nJulie Anne Henry Wilmington, DE +*Jason Lee Stone Piedmont, SC \r\nMark Edward Jernigan Goose Creek, SC Jason Robert Vitali Florence, SC \r\n*Lindsey Brooks Jerrim Duluth, GA *Christopher David Von Ins Rock Hill, SC \r\n**Nathan Gregory Kenney Sidney, ME *Robert Anthony Walker Greer, SC \r\nAdam Nicholas King Mt Pleasant, SC *Thea Joy Warringer Summerville, SC \r\nDavid Robert William Kuhnell Summerville, SC Cyrus Alexander Zarraby Sandia Park, NM \r\nLeonard David Lipscomb Greenville, SC \r\nChemistry \r\nJoan Rose Breitenbruck ________ Winter Park, FL ***Elizabeth Anne Hughes _______ Knoxville,lfN \r\nMeredith Leigh Daniels Anderson, SC *Jonathan Walton Marsh Walhalla, SC \r\n**Joseph Randall Esterley Sumter, SC Laura Michelle Osborn Liberty, SC \r\nShenise Shevonn Euland Charleston, SC *Jessica Clark Wellman Keller, TX \r\n*Stephen Daniel Hudson York, SC \r\nCivil Engineering \r\nKevin John Anderson __________ Duluth, GA **Jonathan David Denton _______ Kingsport, TN \r\n*Benjamin Matthew Blake Gainesville, FL Jonathan Matthew Edlinski Goose Creek, SC \r\nAndrew Minnich Bradshaw Poolesville, MD Tony Cameron Edwards Mullins, SC \r\nKarl Brennecke Buchholz Columbia, SC Stephen Van Ellis Gaffney, SC \r\n*Justin Kent Crain Travelers Rest, SC William Jarrell Evans Darlington, SC \r\n21 "
    },
    {
        "page_number": "30",
        "text": "Civil Engineering (continued) • \r\nWilliam Talmadge Fowler III ______ Lexington, SC *Andrew Charles Richardson _______ Lexington, SC \r\n*Christopher Andrew Gay Bluffton, SC **Clayton William Richter Simpsonville, SC \r\nJason George Georgiades Greenville, SC Andrew Morris Rogers Union, SC \r\n*J. D. Maxwell Glynn Seattle, WA ***James Thomas Rogers Lexington, SC \r\nMerideth Kristin Gunter Suwanee, GA *Kenneth Eugene Rogers II Summerville, SC \r\nDavid Stephen Klausman Columbia, SC M. Brad Sanderson Columbia, SC \r\nLaShean Lawson Summerton, SC Jonathan Michael Simpson, Jr. Ninety Six, SC \r\n**Kelly Marie Lester Clifton, VA **Joshua Stephen Stamm Spartanburg, SC \r\n*Aaron Robert Lewis Dayton, OH Joshua Edward Stewart Aiken, SC \r\n**Misty Michelle Lippard Salisbury, NC Carl Christian Thodesen Oslo, Norway \r\nJohn William Lybrand IV Greenwood, SC Douglas Oliverio Torres Georgetown, SC \r\n*Angela Faye Mahaffey Greer, SC Christopher Aaron Trent Easley, SC \r\nTimothy Blake Mayberry Chapin, SC Adam Christopher Way Columbia, SC \r\nOctober Lynn McConnell Greenville, SC \r\n***Luke Michael Miller Sugar Land, TX \r\nCharles Theodore Moon, Jr. Moncks Comer, SC \r\n**Joshua David Werts Chapin, SC \r\nMatthew James West Marietta, GA \r\n**Meredith Burke Womble Spartanburg, SC \r\nJonathan Christopher Nett Greenville, SC Jacob Mathew Wuenschel Kingsville, OH \r\n+**David Newell Powell Clemmons, NC \r\nComputer Engineering \r\nZachary Leland Anderson ________ Greenville, SC Nilam Natvar Patel ___________ Conway, SC \r\n*Jason Carter Barnwell Clemson, SC Rapeepom Payattakool Easley, SC \r\n*Charles Austin Brookie Mauldin, SC Elvis William Percentie Harbour Island, Bahamas \r\n**Charles Andrew Chester Sweetwater, TN Thomas Michael Polon Fort Mill, SC \r\n*Brian Robert Crounse Ballston Lake, NY Janet Patrice Pope Aiken, SC \r\nPatrick Kenyon Day Dresden, ME +**Jemmie Robert Rand Mobile, AL \r\nHemal Kishor Desai Spartanburg, SC Chimere Denique Ravenel Awendaw, SC \r\nJames Arthur Ray Fowler III Simpsonville, SC Matthew Ronald Read Gaffney, SC \r\nDaniel Ryan Galloway Greenwood, SC Mark Remi Greenville, SC \r\nSebastian Gerau Dresden, Germany +***Peter Timothy Rickenbach Simpsonville, SC \r\n*David Leon Hanisch, Jr. Sumter, SC Christy Ann Season Birmingham, AL \r\nDouglas Russell Harris Goose Creek, SC Joshua Joseph Silsby North Adams, MA \r\nJonathan Paul Heh Pittsburgh, PA Marcus L. Smith Dillon, SC \r\n*Gary Lee Hoenshel, Jr. Aiken, SC ***Brian Joseph Stringari Vineland, NJ \r\nJames Richard Holcombe Anderson, SC +***Charles Henry Swannack III Fort Bragg, NC \r\n***Timothy Justin Luck Cheraw, SC Timothy Clark Thompson, Jr. Honea Path, SC \r\n***Allen Cramer March III Myrtle Beach, SC Kimberly Lane Truesdale Kershaw, SC \r\n**Gabriel Seth Page Fountain Inn, SC +**Brian James Wolf Columbia, SC \r\n**Louis Wai On Pang Queens, NY Chris Roger Wozniak Warner Robins, GA \r\nComputer Information Systems \r\n***James Steven Bauman ________ Greenville, SC *Angelo Constantine Mitsopoulos _____ Lake Forest, IL \r\nKevin Walter Clark Chapin, SC Christopher Charles Moore Blacksburg, SC \r\n*George Brendon Clonts Conway, SC Matea E. Morris Greenwood, SC \r\nKrystal LaTrisha Davis Hemingway, SC Vladimir Paulen Clemson, SC \r\nKyle William Frank Wolfeboro, NH Matthew Jeremy Rowland Anderson, SC \r\n*Jessica Herron Bethesda, MD Derek Donald Thomas Clemson, SC \r\n+**John Timothy Kivus Auburn, ME Philip Wayne Townsend Central, SC \r\n***Carol Ann Lawson Clemson, SC Christopher James Troisi Greer, SC \r\nJohn McCord Lindsey Conway, SC Joy My Vong Charleston, SC \r\nSacajawea Eilleen Mitchell Allendale, SC \r\nComputer Science \r\n*Neil James Adcox ___________ Williston, SC Erica Kolin Lee _____________ Seneca, SC \r\nMichelle Leigh Brady Homer, NY *John Gregory Lewis, Jr. Pickens, SC \r\n+**Eric Paul Caldwell Lexington, SC ***John Wesley Forester McPherson Knoxville, TN \r\nTyler Patrick Cayce Marietta, GA Eric Fitzgerald Miller Clinton, SC \r\n+***Cedric Jerome Ching Anderson, SC Michael Henry Moore Potomac, MD \r\nChristopher Lee Coker Easley, SC Patrick Strickland Murphy Anderson, SC \r\nSamuel Thomas Esswein Gainesville, VA Andrew Allen Po-e Summerville, SC \r\nTimothy Scott Finnie Clemson, SC Bradley Scott Porter Charleston, SC \r\nSean Edward Glenn Greenville, SC ***Judson Albert Powers Birmingham, AL \r\nWilliam Anders Glenn Clemson, SC William Nathan Quarles Fort Lauderdale, FL \r\n*Christopher Paul Harper Greenville, SC *Stanley Terrell Sims Columbia, SC \r\nThomas T. Hashem III Glastonbury, CT +***Margaret Elizabeth Staton Rock Hill, SC \r\n*Vu Anh Hoang Greenville, SC Lauren O'Neal Sullivan North Augusta, SC \r\n*Norman Alan Johnson, Jr. Hampton, SC **Craig David Thomas Maryville, TN \r\nChristopher Eugene Kelly Montgomery, NJ Joy My Vong Charleston, SC \r\nFrancis Tan Krueger Greenville, SC *Stephen Adrian Watson Columbia, MD \r\nElectrical Engineering \r\nJohn Julian Abbott, Jr. __________ Sumter, SC Kimberly Jo Foxx __________ Fall Branch, TN \r\nJason Maxie Byrd Landrum, SC Jerome Fenimore Gathers, Jr. Columbia, SC \r\nMichael Adam Coker Summerville, SC *Erin Leslie Greenfield Maryville, TN \r\n*William Davis Creel Florence, SC Jerry Michael Groover, Jr. Mt Pleasant, SC \r\n*Matthew Calbraith Crisler Mt Pleasant, SC *Charly Hermanson Columbia, SC \r\nCamette Yvette Dukes Greeleyville, SC Jason Donald Hicks Indian Mills, NJ \r\n22 "
    },
    {
        "page_number": "31",
        "text": "Electrical Engineering (continued) \r\n*Stephanie Bond Hudgens ________ Clinton, SC James Dustin Robinson _________ ,_ Cordova, SC \r\nIris Denae Johnson Nichols, SC +***James Allen Simons Boulder, CO \r\nTerry Ray Jones, Jr. Mobile, AL Braden Christopher Stanis Duncan, SC \r\n*Jason Michael Keith Springfield, VA Anthony Michael Staton Hendersonville, NC \r\nBradford William Larson Wayland, MA *Gabriel Joseph Stout Fayetteville, NC \r\nAndrew Emanuel Marshall, Jr. Columbia, SC +***Michael Yusong Tan Rock Hill, SC \r\nJerry Hughes Martin II Latta, SC Carlen Lamar Wallace Barnwell, SC \r\n+***William Chu,Hyon McMahan Springfield, VA *Matthew Carl Wensley Rock Hill, SC \r\nBenjamin Ryan Morris Greenville1 SC Jennifer Lynn Wolfe Boiling Springs, SC \r\nWilliam Ray Morris Westminster, SC Ryan Matthew Yocco Hilton Head Island, SC \r\nNicklas Robert Remeta North Myrtle Beach, SC Santiago Ciro Zambrano Mauldin, SC \r\n*Brian Philip Robertson Liberty, SC \r\nGeology \r\nJeffrey Thomas Atteberry _______ Cincinnati, OH +**Christopher Wilson Hepler ______ Clemson, SC \r\nDaniel Keith George Moncks Corner, SC \r\nIndustrial Engineering \r\nChenoa Wakenda Adams ________ Hopkins, SC *Jason William McKinney ______ Plum Branch, SC \r\n**Michelle Sheen Chang Kingsport, TN Joseph Samir Mikhail Greer, SC \r\nMartie Gail Hudson Georgetown, SC Kelly Suzanne Nix Lexington, SC \r\n**Ryan Mark Hutchins Marlton, NJ Bryce Van Phuong Myrtle Beach, SC \r\n***Kristin Louise Kelley Snellville, GA Aaron Soto Clover, SC \r\n**Christine Suzanne Lamine Knoxville, TN Jerome R. Steininger Long Island, NY \r\nEuston Levern Lewis, Jr. Longs, SC John David Turrentine Greenville, SC \r\n+*Samuel Alexander Long, Jr. Columbia, SC Brian Curtis Woods Gadsden, SC \r\nMartha Ann McCracken Greenwood, SC Daniel Carl Zeh North Augusta, SC \r\nMathematical Sciences \r\n**Casey Christopher Allen ________ Prospect, CT +***Susan Adelia Perrone _________ Tampa, FL \r\nVarian J. Cook Easley, SC ***Andrea Renee Roose Rock Hill, SC \r\n***Jimena Lamanda Davis Mullins, SC Mary Ann Sinclair Sidney, ME \r\n+***Kimberly Lynn Kern Tampa, FL Misty Marie Waters Seneca, SC \r\nBrandon Nathaniel Lyles Columbia, SC \r\nMechanical Engineering \r\nDavid Roy Alexander ________ Goose Creek, SC *Stephen Joseph Koza--------- Thornton, PA \r\nBrian Macleod Appleton Wauwatosa, WI Joseph David Laps Scio, OH \r\nChristine Anne Ballard Middletown, NJ Robert Cecil Lawson Spartanburg, SC \r\nJoe Timothy Brown Conyers, GA Paul Casey Ledford Travelers Rest, SC \r\nWilliam Christopher Brown Batesburg, SC Richard Alan Low Brighton, MI \r\n*Brian Joseph Burger Monroe, MI Michael Casey McDermott North Augusta, SC \r\n*Jared Andraus Cammon Decatur, GA Phillip Alan McMaster Glen Ellyn, IL \r\nAndrew Wade Clements Mishawaka, IN Justin Norris Mitchell Blythewood, SC \r\nKenneth Wade Clinkscales Easley, SC Samer Tamer Moukalled Beirut, Lebanon \r\n*Brian Matthew Creighton Bethel Park, PA Susan Elaine Neal Fort Mill, SC \r\nKevin Michael Cross Sunset Hills, MO +***David Robert Noble Maiden, NC \r\nRyan Shaun Dennis Oakboro, NC Jonathan Austin Nutter Beavercreek, OH \r\n+**Angela Suzanne Dunham Chestertown, MD Sean Lenord Rosier Easley, SC \r\nDavid Thomas Elenz Gaylord, MI Robert Matthew Ruehlmann Greenville, SC \r\nJoshua Kane Ellenburg . Liberty, SC **Douglas Royce Shannon, Jr. Chester, SC \r\nWilliam Ernest Gaither, Jr. Fort Mill, SC Marc Rene Speck Spartanburg, SC \r\n**Kyle Andrew Gilbert Pickens, SC William Lee Summerville, Jr. Bullock Creek, SC \r\n*Joseph William Gramc Gibsonia, PA *Jessica Ann Taylor Olney, MD \r\nBrian Wayne Hacker Apopka, FL Brian Walker Thompson Alpharetta, GA \r\nJason Thomas Harrell Centerville, MA **Leslie Rae Tucker Mauldin, SC \r\n+**Leigh Ann Harrison Anderson, SC +**Adam Richard Weeks Cincinnati, OH \r\nEric Brandon Johnson Denver, CO Heather Lynn Yeakle Belleville, MI \r\n***Robert Hill King Gainesville, FL \r\nPhysics \r\nCharles Kennon Bradley _________ Gaffney, SC +***Judson Albert Powers _______ Birmingham, AL \r\nScott Michael Cantrell Pickens, SC +**Sarah Jean Stanhope South Kingston, RI \r\n**Colin Campbell Harris III Venice, FL \r\nPolymer and Textile Chemistry \r\nSyed Talha Binali __________ Karachi, Pakistan Jennifer Adams Kellett---------- Easley, SC \r\nJason Allen Cumbee Spartanburg, SC +**Olin Thompson Mefford IV Florence, AL \r\nAdeel lnam Clemson, SC LaToya Monique Williams Estill, SC \r\n*Muhammad Kamran Iqbal Karachi, Pakistan \r\nTextile Management \r\nStephanie Marie Cardell _______ Myrtle Beach, SC Robert Joseph Pavliska ________ Mt Pleasant, SC \r\nLatasha Denise McFadden Lake City, SC ***Holly Caroline Roper Fort Mill, SC \r\nMuhammad Kash if Muzamal Karachi, Pakistan Stacey Ann Smyth Flemington, NJ \r\nTextile Science \r\nKristen Ann Calabrese _________ Mauldin, SC \r\n23 "
    },
    {
        "page_number": "32",
        "text": "COLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nLAWRENCE ROBERT ALLEN, Dean \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\n**Kristen Danielle Bagwell _________ Seneca, SC Jamie Leeann Lane __________ Greenville, SC \r\n**Courtney Louise Baker Williston, SC Hannah Laura Long Anderson, SC \r\nElizabeth Mclendon Beacham Greenville, SC *Lauren Michelle Martin Greenville, SC \r\nNancy Elizabeth Black Edgemoor, SC ***Jessica Allison McDevitt Mattice Isle Of Palms, SC \r\n*Amber Louise Bradley Lexington, SC Keenan Elizabeth Moore Camden, SC \r\n**Becky Lynn Bryant Manning, SC *Carrie Gwin Morey Orlando, FL \r\n**Lara Regina Clemons Hartsville, SC **Amanda Marie Mortenson Columbia, SC \r\n**Heidi Regina Donald Fort Mill, SC Hunter McCranie Norris Spartanburg, SC \r\nWendy Carol Eaton Pelzer, SC +***Brenna Fae Osborn Greenville, SC \r\nKyana Rashida Elder Atlanta, GA *Jan ice Corinne Patterson Asbury Park, NJ \r\nSandra Melissa Ford Easley, SC **Jennifer Suzanne Powell Lexington, SC \r\nAimee Desiree Fox West brook, ME *Rebecca Amanda Raines Great Falls, SC \r\nSonya Shenique Garner Greenwood, SC *Shana Dale Roof Rock Hill, SC \r\nPritchet Kay Gibbs Yonges Island, SC *Erin Kathleen Russell Holly Hill, SC \r\nSarah Helen Horton Camden, SC *Michelle Leigh Sestito Florence, SC \r\nAllison Powell Jackson Irmo, SC *Bonnie Elizabeth Silva Lexington, SC \r\n*Delanie Shay Jobson Murrell's Inlet, SC **Karen Ann Sloan Charleston, SC \r\n***Abigail Lee Keister Chapin, SC Kristen Callahan Stuart Greenville, SC \r\n*Kathleen Clarke Kirkman Tampa, FL *Mary Duncan Trammell Clinton, SC \r\n*Natalie Lynn Kocher Greenville, SC *Natalie Faith Trammell Greenville, SC \r\n**Heather Kathleen Koestline Columbia, SC Jennifer Leigh Wilson Seaville, NJ \r\nElementary Education \r\nKathryn Aileen Alexander ________ Pendleton, SC Melanie Rose Johnson ___________ Easley, SC \r\n**Laura Grace Andrews Spartanburg, SC Holly Kathleen Kusterer Gaffney, SC \r\nMeridith Lee Barton Anderson, SC Karen Rebekkah Leonard Miami Shores, FL \r\nBrittany June Bell Columbia, SC *Laura Harmon Lindsey Greenville, SC \r\nTiffany Jeanne Bell Smithfield, VA **Amy Michelle Lister Greenville, SC \r\nCatherine Elizabeth Blaney Columbia, SC Stephanie Monique Major Marion, SC \r\n**Felicia Marlene Brown North, SC **Kristen Lianne March Fort Walton Beach, FL \r\n+**Julie Lynn Burgess Batesburg, SC **Katie Ann Marklow Vernon, VT \r\nDaphne Marie Burnes Beaufort, SC *Elizabeth Hamer Matthews Union, SC \r\nTavares Jovan Bussey Edgefield, SC *Brooke Nicole Mayfield Greenwood, SC \r\n***Amanda LaBrie Charest York, SC Jennifer Ann McClintock Greenville, SC \r\n*Chavon Sharee Coleman Beaufort, SC Alexandrea Lynn Molnar Edgewater Park, NJ \r\nAlithea Shavaun Comer Fair Play, SC *Stephanie Amanda Myers Prosperity, SC \r\nJennifer Lynn Conover Clemson, SC Amanda Burdette Newton Belton, SC \r\n*Megan Britt Davis Clover, SC Suzanne Lee Oliver San Francisco, CA \r\nJacob Harris Dean Clemson, SC ***Kelly Sue Osimo Westminster, SC \r\n***Amanda Marie Dickenson North Augusta, SC **Ezekiel Lane Parson Seneca, SC \r\n*Emily Jordan Dover Spartanburg, SC *Sara-Beth Michelle Rush Aiken, SC \r\n**Kimberly Griggs Dover Easley, SC Katherine Elizabeth Saylors Anderson, SC \r\n*April Dawn Ellison Pickens, SC ***Tina Reid Scott Pendleton, SC \r\nCasey Dawn Ellison Anderson, SC **Emily Margaret Short Irmo, SC \r\nJessica Haley Fields Clemson, SC *Shelley Lorene Stewart Mt Pleasant, SC \r\n***Donnis Marie Finet Anderson, SC Molly Barrett Stinnett Travelers Rest, SC \r\nKatherine Colleen Gibbons Greenville, SC **Holli Lynn Thompson Walhalla, SC \r\nRobin Anne Griffin Lexington, SC Sarah Gabrielle Vaughn Rock Hill, SC \r\n*April Hope Hargette Powdersville, SC Anne Claire Veazey Greenville, SC \r\n**AlinaJill Hendricks Easley, SC Emily Teresa Wankmuller Fair Haven, NJ \r\n**Andrea Leigh Herman Clemson, SC *Danielle Lisbeth Wilkinson Anderson, SC \r\n***Jennifer Marie Hilligas Charleston, SC Emily Ann Williams Ijamsville, MD \r\n*Mary Logan Iseman Columbia, SC *Susan Margaret Wilson Bedford, NH \r\nSarah Nicole Isenbarger Simpsonville, SC Kelly M. Wingert Mountaindale, NY \r\nJohn Robert Jackson Columbia, SC \r\nSecondary Education \r\nRichard Bryan Barrineau __________ Sumter, SC Meredith Duncan Kirtland _________ Miami, FL \r\n*Brooke Ashley Batson Greenville, SC +**Kelly Lynn Lyons Berlin, CT \r\n*Jessica Elizabeth Bickes Alpharetta, GA Joelle Michelle Marchegiano Whippany, NJ \r\n+**Joseph Thomas Branyon III Andrews, SC ***Patti Lynn McKenzie Lake City, SC \r\n*Erica Lee Brown Greer, SC Bryan Leslie Merrick Sumter, SC \r\nJoseph Drew Chappell Fountain Inn, SC Veronica Lee Nessler Ancon, Panama \r\n**Sarah Ann Coleman Orangeburg, SC Lindsey Elizabeth Osborn Louisville, KY \r\n*Angie Elizabeth Conn Muscle Shoals, AL *Shelby Nicole Patterson Columbia, SC \r\nLaura Lynnette Duvall Westminster, SC **Tamika Kimtrell Patterson Stone Mountain, GA \r\n+***Julie Anne Ferris Snellville, GA April Michelle Epps Powers Clemson, SC \r\nSusan Hope Garmendia Mt Pleasant, SC +*Laura Wynne Prendergast Roswell, GA \r\nAmy Rebecca Greer Mauldin, SC ***Marie Katherine Psaras Mt Pleasant, SC \r\nLinsy Duffie Howell Columbia, SC *Richard Neal Ramsey Collierville, TN \r\n*Chad Lamar James Westminster, SC Heather Nicole Sanders Rosman, NC \r\n**Kimberly Dyan Johnson Easley, SC *Jeffrey Bradford Scott Columbia, SC \r\n24 \r\n• "
    },
    {
        "page_number": "33",
        "text": "Secondary Education (continued) \r\nJennifer Anne Sellers ___________ Belton, SC *Jonathan David Whitfield ________ Anderson, SC \r\n*Heather Marie Walls Anderson, SC +**Michael Alan Work Lilburn, GA \r\n*Tricia Lee White York, SC \r\nSpecial Education \r\nJoshua Lynn Blake ____________ Easley, SC +**Keri Jennifer Larrison--------- Naples, FL \r\n*Jessica Kay Lazear Blanton Piedmont, SC Jessica Pitman McCraw Taylors, SC \r\nRachael Erin Caswell Anderson, SC +**Sara Jennings McDaniel Batesburg, SC \r\nBetsy Jean Clark Lilburn, GA Stefanie Ann Patrick Pickens, SC \r\nKimberly Ranique Coleman Easley, SC *Corey Elizabeth Sherman Aiken, SC \r\n*Nicholas Shawn Davis Anderson, SC *Amanda Mae Thompson Campobello, SC \r\nTerrie Nicole Harper Pelzer, SC +**Lindsay Anne Thompson Irmo, SC \r\nTori Himelick Hayes Simpsonville, SC ***Cristin Anne Vignola Kennett Square, PA \r\nDOUBLE MAJOR \r\nPhilosophy and Secondary Education \r\n*Brian Joseph Roach Williamston, SC \r\nPolitical Science and Secondary Education \r\nTimothy Paul Baker Greer, SC \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\nAbby Alexander ___________ Columbia, SC *Lee Anne Lineberry _________ Greensboro, NC \r\nSara Elizabeth Alford Mullins, SC Kristen Elizabeth McConkey Mullins, SC \r\n*Brian Newton Boland Elloree, SC Sarah Kathleen Murphy Arlington, TX \r\n+***Melissa Hiers Bull Chapin, SC Eric Jermaine New McCormick, SC \r\n*Kimberly Anne Cicio Oakton, VA **Katherine Anne Niebauer Naples, FL \r\n**Eric Shealy Cockrell Batesburg, SC *Meredith Robbins Palmer Orangeburg, SC \r\nNicholas Blake Collins Summerville, SC Erin Elizabeth Parks Aiken, SC \r\nTina Elise Davis Easley, SC Ashley Hall Porter Easley, SC \r\nEmma Margaret Decot Sandwich, MA Britt Wilson Sherman Mathias, WV \r\nAshly Janel Edwards Charlotte, NC Ashley Rebecca Smith Pelzer, SC \r\nWilliam Jackson Griffeth Greenville, SC Maurice Smith Little Rock, SC \r\nJ. Baylis Griffith Summerville, SC Lisa Lynn Sowell Anderson, SC \r\nAshley Brooke Hancock Piedmont, SC +*Allison Leigh Tate Gastonia, NC \r\n**Laura Kathryn Hartzog Orangeburg, SC **Kristi Lynn Toothman Greer, SC \r\nMelanie Sarah King Wrentham, MA Gregory Lamont Walker, Jr. Sumter, SC \r\nEmily Ann Langstaff Hartsville, SC Temple Elizabeth Walker Ninety Six, SC \r\n***Brooke Abigail Launius Dayton, OH *Sheryl Ashlee Watts Sarasota, FL \r\n*Callie Camille Leonard Charleston, SC Elizabeth Brooke Wright Hilton Head Island, SC \r\nMathematics Teaching \r\n**Jennifer Lynn Burdette ________ Pasadena, MD +**Maureen Erin McHugh ________ Columbia, SC \r\nJohn Michael Caruthers Sunset, SC Bradley Matthew Patterson Taylors, SC \r\n*Teah Katherine Delco Myrtle Beach, SC Charles Kirkland Smoak Ill Columbia, SC \r\n***Christopher Edward Holtzendorff Mt Pleasant, SC Seth Daniel Young Lexington, SC \r\nNursing \r\nStacy Michelle Aldridge _________ Lancaster, SC *Amy Denise Hart ___________ Fair Play, SC \r\nAndrea Carroll Allen Anderson, SC Krystal Dawn Haynie Anderson, SC \r\nDanielle Denise Bagley Sarasota, FL *Leigh Collier Heintze Seneca, SC \r\nAnna Lillian Baughman Greenville, SC Erin Leigh Herndon Mt Pleasant, SC \r\n*Charissa Jean-Marie Beaulieu South Windsor, CT Charmeon T akina Hines Florence, SC \r\nJulia Bell Boswell North Myrtle Beach, SC *Sarah Kathryn Hood New Bern, NC \r\n*Angela Leigh Brown Florence, SC *Audrey Yvette Huston Spartanburg, SC \r\nNicollette Leigh Burgess Minneapolis, MN **Ashley Marie Jackson Taylors, SC \r\n*April Nicole Cagle Williston, SC Jamie Lee Johnson Summerville, SC \r\nElizabeth Ann Carr Summerville, SC Susan Nicole Kennemur Chester, SC \r\nKelly Marie Cassidy Cheraw, SC Kristin Ward Kilgus Orangeburg, SC \r\nMeredith Leigh Caudle Springfield, VA Linda Marie Kincade Charleston, SC \r\nAmy Elizabeth Chasteen Durham, NC Melanie Nicole Kitchings Aiken, SC \r\n**Rebecca Elizabeth Collins Mansfield, OH John Edward Knauff, Jr. Lexington, SC \r\n**Ronande Berryl Creebsburg Suriname, South America +*Shannon Marie-Jude Luhn Cincinnati, OH \r\nStephanie Paige Crowley Atlanta, GA Kristin Leigh Maffucci Manasquan, NJ \r\nJessica Leigh Cumbee Orangeburg, SC Anneka Louise Maguigan Dunwoody, GA \r\nAlison Nicole Driver Belton, SC Hester Christine Manigault Moncks Comer, SC \r\nNatalie Marie Edwards Walhalla, SC Emily Renee Masengill Greenville, SC \r\n*Kimberly Paige Enfield Lilburn, GA *Jennifer Irene Maynard Dillon, SC \r\nSara Kinsey Evans Orangeburg, SC Anna Elizabeth Merrick Rock Hill, SC \r\nBethany Rae Funk Hartsville, SC +*Kristin Angela Merritt Roswell, GA \r\n*Elizabeth Ashley Gillespie Seneca, SC Amber Nicole Miles Florence, SC \r\nCrystal Renee Grate Anderson, SC Erin Katy Mitchell Murrell's Inlet, SC \r\nDawn Marie Gurley Charleston, SC Jennifer Marie Paglia Columbia, SC \r\nSusan Renee Hare Saluda, SC ***Kristen Suzanne Parker Florence, SC \r\nMeredith Rebecca Harmon Chesterfield, SC Kristy Lou Partee Snellville, GA \r\n25 "
    },
    {
        "page_number": "34",
        "text": "Nursing (continued) \r\n+*Mary Frances Patterson _________ Wyoming, OH ***Leigh Suzanne Shoemaker _______ Greenville, SC \r\nKeila Ann Porter Six Mile, SC Katherine Lynn Sickinger Greenville, SC \r\nSteven Nicholas Powell Simpsonville, SC **Nicole Eastham Slack Columbia, SC \r\nErin Annlie Pratt Charleston, SC ***Bridget Ferguson Stratton Lavonia, GA \r\nNealy Lynn Purvis Summerville, SC Kelly Leigh Taylor Easley, SC \r\nMollie Richardson Respass Prosperity, SC Kelly Elizabeth Turbeville Lake City, SC \r\nTessa Bowers Roberts Great Falls, SC Michelle Marie Underwood Simpsonville, SC \r\n*Jessica Lynn Roorda York, SC Kelli Elizabeth Walden Hilton Head Island, SC \r\nCharlotte Rebecca Rowell Blythewood, SC Tara Michelle Wasson Piedmont, SC \r\nLinda Sue Schutt Johnson City, TN *Aimee Leigh White Anderson, SC \r\nAndrea Elizabeth Schwab Annapolis, MD **Tracy Lynn Williams Johnston, SC \r\nSena Selvela Seats Salem, SC Melissa Anita Wilson Rock Hill, SC \r\nCourtney Allison Sergeant Exton, PA *Jennifer Marie Wingard Columbia, SC \r\nKaris Lyndsay Sharpe Pickens, SC \r\nParks, Recreation, and Tourism Management \r\nSara Elizabeth Anderson _______ North Granby, CT Susan Michele Koons ___________ McLean, VA \r\nElizabeth Casey Atkinson Orangeburg, SC *Carl Calef Kotz Clemson, SC \r\nJonathan Michael Blackwell Ladson, SC **Emily Aldrich Kuivila Dublin, OH \r\nTimothy Kevin Bratt East Palmyra, NY Esmonde O'Brien Levy Sumter, SC \r\nAnna Elizabeth Busha Westminster, SC Bryant Ashely McNeal Swansea, SC \r\nJeffrey Wayne Carter Goose Creek, SC Jared Stewart Merrell Avon, NY \r\nJefandi Lakeisha Cato Ellenwood, GA **Sara Katherine Merritt Boiling Springs, SC \r\nJessie Morgan Dayton Westport, NY Christopher John Miller Hodges, SC \r\nChristen Leigh Dilleshaw Columbia, SC Jason Daniel Nase Brooksville, FL \r\nAmy Nicole Drawdy Seneca, SC Brandi Nicole Roe Columbia, SC \r\nWilliam Benjamin Duncan Greenville, SC John Baylis Ross, Jr. Anderson, SC \r\nEverett Carl Ernst III Columbia, SC Leslie Ann Seigler Rock Hill, SC \r\n+*Courtenay Moore Evans Georgetown, SC Lori Melissa Shaw Columbia, SC \r\n*Judith Rebecca Gaines Chattanooga, TN Eric Walter Sikes Easley, SC \r\nLloyd A. Gillespie III Ponte Vedra Beach, FL Kimberly June Stokes Lyman, SC \r\nJeffrey Wayne Ginn Belton, SC Christopher Lewis Talbott Charleston, SC \r\n*Andrew Logan Haddock Myrtle Beach, SC Lauren Caroline Taylor Charleston, SC \r\nKatherine Lindsay Hoffmann Greenville, SC Martin Thomas Timms Winnsboro, SC \r\nJessa Lea Huckaby Williamsburg, VA Todd Nathan Vieau Charleston, SC \r\nElizabeth Ann Jamieson Kiawah Island, SC *Lindsay Renee Watson Greenville, SC \r\nAmanda Katherine Johnson West Columbia, SC John Anthony Wilson Seneca, SC \r\nScience Teaching \r\nJeremy Joseph Carrick __________ Fort Mill, SC Paul Lee Padgett ___________ Lexington, SC \r\n**Amy Harrell Cribb Moncks Comer, SC Christopher Ryan Preisig Inman, SC \r\nJason William Meany Liverpool, NY \r\nTechnology and Human Resource Development \r\nSan Antonio Coriolindus Crosby ______ Anderson, SC *Jonathan Lynn Lineberger __________ y ork, SC \r\nWilliam Patrick Dermott East Greenbush, NY *Justin Lamar Long Seneca, SC \r\n*Jeremy Vaughn Ernst Batesburg, SC Carisa Noel Miller Athens, ME \r\nRodney Odell Feaster Chester, SC *Thomas Andrew Rich Anderson, SC \r\nTrevor Samuel Garrick Bishopville, SC ***Erica Leigh Stewart Powdersville, SC \r\nJerald Jermaine Howard Huger, SC Brent Landry Stover Roanoke, VA \r\nDesmond Undrea Johnson Greenville, SC Braxton Ky Juan Williams Greensboro, NC \r\n*Cum laude: A grade point ratio of 3.40 to 3.69 \r\n**Magna cum laude: A grade point ratio of 3. 70 to 3.89 \r\n***Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\n+Departmental Honors: The graduates so designated have completed an enriched program of study designed by their departments with the approval of the Calhoun \r\nCollege Honors Program. To earn Departmental Honors students must complete an honors thesis and/or other upper division honors courses, while maintaining an \r\noverall grade-point ratio of 3.40 or higher. Departmental Honors graduates appear in the line of march wearing the Calhoun College Honors Medallion on an orange \r\nand purple ribbon. This medallion is made possible by an endowment established by Mrs. Katherine Inabinet Vickery of Columbia, South Carolina, to honor the \r\nmemory of her husband and Clemson graduate, the late B. C. Inabinet. \r\nStudents wearing the white stoles over their gowns are graduating with a 3.0 or better grade point average. Those who are members of University recognized \r\nhonorary societies may have the names of those societies embroidered on one side of the stole with the University seal embroidered on the other side. \r\n26 \r\n• "
    },
    {
        "page_number": "35",
        "text": "Awards \r\nNORRIS MEDAL \r\nFirst awarded at Clemson University in 1908, the Norris Medal was established under the terms of the \r\nwill of the Honorable 0. K. Norris, a life trustee of this institution. The medal is given each year to the \r\ngraduating student who, on the basis of exceptional scholastic achievement and leadership ability, is judged \r\nby the University Scholarships and Awards Committee to be the best all-around student. \r\nAll recipients of the Norris Medal have their names affixed to a bronze plaque mounted at the front \r\nentrance of Sikes Hall. \r\nRECIPIENT OF THE NORRIS MEDAL \r\nANGELO CONST ANTI NE MITSOPOULOS \r\nLake Forest, IL \r\nALGERNON SYDNEY SULLIVAN AWARD \r\nThe Sullivan Award is given annually to individuals who possess the characteristics of heart, mind, and \r\nconduct as evince a spirit of love for and helpfulness to other men and women. These humanitarian \r\nqualities are exhibited in the following recipients. \r\nRECIPIENT OF THE ALGERNON SYDNEY SULLIVAN CITIZEN AW ARD \r\nDR. CARL E. THOMPSON \r\nClemson, SC \r\nRECIPIENTS OF THE ALGERNON SYDNEY SUL LIV AN STUDENT AW ARD \r\nMARY KATHERINE BROCK \r\nIrmo, SC \r\nJAMES THOMAS ROGERS \r\nLexington, SC \r\nALUMNI MASTER TEACHER AWARD \r\nThis award is presented by the Clemson Alu1nni Association for distinguished achievements in \r\nclassroom teaching. The faculty recipient is selected hy the Student Alumni Council from nominations \r\nsubmitted by students. A bronze plaque is presented permanently to the recipient and the award carries \r\nwith it a stipend of twenty-five hundred dollars. \r\nRECIPIENT OF THE ALUMNI MASTER TEACHER AW ARD \r\nWILLIAM AL TON BRANT \r\nFACULTY SCHOLARSHIP AWARD \r\nEstablished at Clemson University in 1959, this award is made annually by the faculty of Clemson \r\nUniversity to the member of the graduating class who has the highest scholastic achievement. All \r\ngraduates who have completed the requirements for the bachelor's degree since the last commencement \r\nexercise and who have completed at Clemson at least 75 percent of the work required for graduation shall \r\nbe eligible for consideration. \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AWARD \r\nCARLA MARIE BERRY \r\nMatthews, NC \r\nJENNA KIRSTEN BURTCH \r\nHolland, Ml \r\nCASEY BROOKE COTTRILL \r\nBlacksburg, VA \r\nJIMENA LAMANDA DAVIS \r\nMullins, SC \r\nMARLON PANGAN ERRAZO \r\nCharleston, SC \r\nJULIE ROBERTS GARST \r\nHeath Spring ·, SC \r\nJEFFREY BRETT HARDESTY \r\nClarksville, MD \r\nELIZABETH ANNE HUCHES \r\nKnoxville , TN \r\nEARL O'NEIL MCCOY III \r\nMyrtle Beach, SC \r\nBRENNA FAE OSBORN \r\nCireem·ilk. SC \r\nTIMOTHY JOSEPH PASKEN \r\nLikeland, FL \r\nJUSTIN LEE PERDELWITZ \r\nSimpsonville, SC \r\nREBECCA ANNE PETRUSH \r\nFlorence, SC \r\nANDREA RENEE ROOSE \r\nRock Hill, SC \r\nFRED GRAY SHEALY III \r\nFlat Rock, NC \r\nJAMES ALLEN SIMONS \r\nBoulder, CO \r\nMARGARET ELIZA BETH ST A TON \r\nRock Hill, SC \r\nBRIAN JOSEPH STRINCARI \r\nVineland, NJ \r\nMICHAEL YUSONG TAN \r\nRock Hill, SC "
    },
    {
        "page_number": "36",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green Clemson (1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\nins ti tu ti on. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the \r\nRoyal School of Mines in Paris (1828-1832). His early profession was that of a \r\nmining engineer; however, circumstances diverted his interests into politics \r\nand the life of a southern planter, and he soon became an enthusiastic advocate \r\nof scientific agriculture. He had a career as a diplomat (charge d'affaires to \r\nBelgium, 1844-1852) and served as the first Superintendent of Agricultural \r\nAffairs in Washington ( 1860). As a scientist he published numerous articles in \r\nthe fields of mining, chemistry and agriculture. His varied activities included \r\nhis assistance in the founding of the Maryland Agricultural College, his support· \r\nof the Morrill Act, his leadership in South Carolina after the Civil War, and \r\nhis part in founding Clemson University. \r\nThomas Clemson was the son.-in.-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two four.-year \r\ncurricula, supplemented by two two.-year preparatory courses. Today the \r\nUniversity has six major academic units .. These are the College of Agriculture, \r\nForestry, and Life Sciences, the College of Architecture, Arts, and Humanities, \r\nthe College of Business and Behavioral Science, the College of Engineering \r\nand Science, the College of Health, Education, and Human Development, and \r\nthe Graduate School. \r\nClemson University is accredited by the Commission on Colleges of the \r\nSouthern Association of Colleges and Schools ( 1866 Southern Lane, Decatur, \r\nGeorgia 30033.-4097; telephone number 404.-679.-4501) to award the Bachelor's, \r\nMaster's, Education Specialist, and Doctor's degrees. Various curricula are \r\naccredited by the AACSB International (Association to Advance Collegiate \r\nSchools of Business), Accredi ta ti on Board for Engineering and Technology, \r\nAmerican Council for Construction Education, American Society of \r\nLandscape Architects, Computing Science Accreditation Board, National \r\nArchitectural Accrediting Board, National Association of Industrial \r\nTechnology, National Association of Schools of Art and Design, National \r\nCouncil for Accreditation of Teacher Education, National League for Nursing, \r\nNRPA/AALR Council on Accreditation, Planning Accreditation Board, and \r\nSociety of American Foresters. \r\nClemson is a land.-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is \r\nalso heavily committed to a varied program of public service, including the \r\nwork of agricultural extension which has professional personnel located in each \r\nof the State's counties. \r\n• "
    },
    {
        "page_number": "37",
        "text": "CLEMSON ALMA MATER \r\nFarmer and McGarity/arr. Freeman \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of great conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "38",
        "text": "Note: Candidates appearing in this program are not certified graduates. Likewise, \r\nacademic honors designations are based upon performance prior to final grades. Both \r\ncertification of graduation and honors designations must come from the Registrar of \r\nthe University. \r\n********** \r\nFirst Aid A First Aid Station is located at the North entrance. \r\nEvacuation System Littlejohn Coliseum is equipped with a fire alarm evacuation \r\nsystem. In the event of activation, as noted by sustained horns and strobe lights, \r\nplease proceed to the closest available exit. Remain outside the building until fire \r\nofficials deem the building safe to re~enter. \r\nNo Smoking Smoking is prohibited in the seating area of Littlejohn Coliseum. \r\nCigarette receptacles are provided around the outer concourse. \r\n• "
    }
]