[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n12-22-2005\r\nClemson Commencement Program, December\r\n2005\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, December 2005\" (2005). Clemson Commencement Programs. 139.\r\nhttps://tigerprints.clemson.edu/comm_programs/139"
    },
    {
        "page_number": "2",
        "text": "Graduation Exercises \r\nDecember 22, 2005 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "CEREMONIAL MUSIC \r\nPrelude \r\nImpulse - Directed by Dr. Dan Rash, Director of Choral Activities \r\nDr. Chris Mathews, Assistant Director of Choral Activities \r\nI. National Anthem \r\nWords by Francis Scott Key/arr. Dan Rash \r\nII. Mr. Jones \r\nCounting Crows/arr. Jared Buchanan and Ritchie Swiger \r\nIII. Michelle \r\nLennon/McCartney/arr. Nick Loder \r\nIV. Kyrie \r\nRichard Page/arr. Chris Mathews \r\nV. Ode to Clemson \r\nComposed by Hugh H. McGarity/arr. David A. Conley \r\nProcessional \r\nTraditional Marches and Trumpet Tunes \r\nMr. Frank W. Breazeale, Class of '68, Organist \r\nInterlude \r\nPastoral Air with Variations - Franz X. A. Murschhauser \r\nMr. Frank W. Breazeale, Class of '68, Organist \r\nClosing \r\nClemson University Alma Mater \r\nMusic by Hugh H. McGarity and Robert Farmer \r\nWords by A. C. Corcoran/arr. Ed Freeman \r\nImpulse \r\nStage Party Exit \r\nFestival Postlude - Domenico Zipoli \r\nMr. Frank W. Breazeale, Class of '68, Organist \r\nMembers of Impulse \r\nJared Buchanan \r\nKyle DeMent \r\nJustin Evans \r\nJohn Flowers \r\nRyan Foster \r\nTravis Jeffcoat \r\nDrew Kise \r\nNick Loder \r\nDaniel Morgan \r\nJohn Olson \r\nDavid Oyler \r\nMatt Richardson \r\nRichie Swiger \r\nMike Trammell \r\nJohn Ziska \r\nCongratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for individual \r\ngraduates. Such expressions frequently detract from the recognition due the next \r\ngraduate in line. Your cooperation is respectfully requested. "
    },
    {
        "page_number": "4",
        "text": "Graduation \r\nThursday, December 22, 2005 \r\n11:00 A.M. Littlejohn Coliseum \r\nORDER OF CEREMONIES \r\n(Please remain standing for the processional, posting of colors, and invocation .) \r\nPosting of Colors \r\nPershing Rifles \r\nCasey V. Manning Robert A. Preston \r\nRivers N . Plowden Andrew F. Smith \r\nInvocation \r\nAshley Joy Skelton, Student Representative \r\nIntroduction of Trustees \r\nPresident James F. Barker \r\nRecognition of the Deans of the Colleges \r\nVice President for Academic Affairs and Provost \r\nDoris R. Helms \r\nConferring of Honorary Degree \r\nPresident James F. Barker \r\nReflections \r\nThomas E. Barton, Jr. \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident James F. Barker \r\nRecognition and Presentation of Awards \r\nC lass of '39 Award for Excellence \r\nFaculty Scholarship Award \r\nMr. Frank Breazeale, O rganist \r\nImpu lse \r\nDr. Subhash Anand, University Marshal "
    },
    {
        "page_number": "5",
        "text": "BOARD OF TRUSTEES \r\nLeon J. Hendrix, Jr., Chairman __________ Kiawah Island \r\nJ. J. Britton, Vice Chairman Sumter \r\nBill L. Amick Batesburg-Leesville \r\nLawrence M. Gressette, Jr. Columbia \r\nThomas C. Lynch, Jr. Clemson \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee Greenville \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick III Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nRobert L. Peeler Lexington \r\nWilliam C. Smith, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nTrustees Emeriti \r\nLouis P. Batson, Jr. ________________ Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW . G. DesChamps, Jr. Bishopville \r\nHarold D. Kingsmore Aiken \r\nPaul W. McAlister Laurens \r\nD. Leslie Tindal Pinewood \r\nAllen P. Wood Florence \r\nExecutive Secretary to the Board of Trustees \r\nChalmers Eugene Troutman III \r\nADMINISTRATIVE OFFICERS \r\nJames F. Barker __________________ President \r\nDoris R. Helms Vice President for Academic Affairs and Provost \r\nA. Neill Cameron, Jr. Vice President for Advancement \r\nSteven E. Copeland Interim Chief Business Officer \r\nAlmeda R. Jacks Vice President for Student Affairs \r\nJohn W. Kelly Vice President for Public Service and Agriculture \r\nLawrence Nichols II Chief Human Resources Officer \r\nTerry Don Phillips Director of Athletics \r\nChristian E. G. Przirembel Vice President for Research \r\nand Economic Development \r\nClayton D. Steadman _____________ General Counsel "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nTHOMAS E. BARTON, JR. \r\nDOCTOR OF HUMANITIES \r\nThrough the leadership of Thomas E. Barton Jr., South Carolina's technical colleges have \r\nbecome recognizeJ as the gateway tu the American Jream - the learning resource needed \r\ntu sustain the state's economic viability and pro<luctivity. \r\nAs president of Greenville Technical College since the institution's founding in 1962, he \r\nplays a key role in moving South Carolina to the new knowledge-based society of the 21\" \r\ncentury. \r\nDr. Barton graduated from Clemson in 1953 with a Bachelor of Science degree and \r\nreceived his Ed.D. in higher education administration from Duke University in 1972. He \r\nbecame president of Greenville Tech after serving in the public schools of South Carolina \r\nand Georgia as teacher, coach and school superintendent for nine years. \r\nThe third largest higher education institution in South Carolina, Greenville Tech is a \r\ncomprehensive technical college offering university transfer and technical programs to \r\napproximately 57,000 students annually. The college is the largest of the state's 16 \r\ntechnical colleges and has an annual operating budget of $70 million, a physical plant \r\nvalued at more than $100 million and approximately 1,200 faculty and staff members. \r\nDr. Barton is recognized as a national leader in creating access to the learning that citizens \r\nneed to participate productively in their communities and in the economy. He secured \r\nproperty and funding to expand Greenville Tech into a four-campus system to serve the \r\nmost rapidly developing sectors of the county. He was also instrumental in establishing the \r\nUniversity Center of Greenville, the largest multi-institutional center for higher \r\neducation in the Southeast, and in launching the Greenville Education Network, a \r\ndistance-learning initiative. \r\nFor his commitment to making appropriate higher education available to all who can \r\nbenefit from it, Dr. Barton has received many prestigious honors and awards. He was named \r\nto the \"Blue Chipper's List\" of the top 50 chief executive officers in community colleges by \r\nthe University of Texas at Austin in 1988 anJ received the Thomas J. Peters Award for \r\nLeadership Excellence in the Community College in 1989. He received the Whitney M. \r\nYoung Jr. Humanitarian Award from the Greenville Urban League in 1994. Named \r\nBusiness Person of the Year by Greenville Magazine in 1995, Dr. Barton has been chosen \r\nas one of the 50 most influential residents of Greenville by the publication every year \r\nsince 1997. He was also named one of the top 25 leaders in the community by The \r\nGreenville News in 2000, 2001 and 2002. \r\nHe was awarded honorary doctorates from Winthrop University in 2002 and from the \r\nUniversity of South Carolina in 2004. Dr. Barton received the state's highest award for a \r\ncivilian, the Order of the Palmetto, in 2003. He was also presented the Order of the \r\nPoinsettia and named the No. I Citizen of Greenville in 2003. \r\nActive in community affairs, Dr. Barton has served on the governing boards of the Greater \r\nGreenville Chamber of Commerce, Textile Hall Corp., the Historic Greenville \r\nFoundation, BB&T and the YMCA. He is a commissioner for the Southern Association of \r\nColleges and Schools and has served on the board of directors of the Donaldson Air Force \r\nBase Museum and the S.C. Technical College Presidents' Council. He has served on the \r\nExecutive Committee for Friends of the Greenville Hospital System and on the Governor's \r\nTask Force on Education in South Carolina. \r\nTom Barton was an outstanding student athlete on Coach Frank Howard's 1951 Orange \r\nBowl and 1952 Gator Bowl teams. He was named to the All State, All South and All \r\nAmerican football teams in 1953 and was later drafted by the Pittsburgh Steelers. For his \r\nathletic prowess, Dr. Barron was elected to the S.C. Athletic Hall of Fame and the \r\nClemson University Athletic Hall of Fame in 1987. \r\nIt is a most significant occasion when Clemson University recognizes and honors one of its \r\nown sons with the presentation of an honorary doctorate for eminent achievements and \r\nmeritorious contributions to higher education. It is a distinct privilege to honor Thomas E. \r\nBarton Jr. with the presentation of the honorary degree, Doctor of Humanities. "
    },
    {
        "page_number": "7",
        "text": "THE ACADEMIC PROCESSION \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, \r\na senior faculty member, with the college baton, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the \r\nAmerican Council on Education, are as follows: \r\nCollege \r\nAgriculture, Forestry, and Life \r\nSc iences \r\nArchitecture, Arcs, and \r\nHumanities \r\nBusiness and Behavioral Science \r\nEngineering and Science \r\nHealth, Education, and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and Orange \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitecture \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sc iences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocial Sciences \r\nLibrary \r\nAcademic Support \r\nInstruction \r\nCollegiate faculty follow their marshal in order of academic rank wearing academic \r\ncostumes of medieval origin. Those who have received their degrees from institutions outside \r\nthe United States wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions are \r\nspecified by a uniform code maintained by the American Council on Education. Caps a re \r\nblack and are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels \r\nusually of metallic thread; other degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet \r\nbars. While most gowns are black with black velvet, one variation is to replace black velvet \r\nwith velvet in the discipline color. A second variation is a colored gown usually of the \r\nuniversity's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awarding \r\ninstitution. First, degree level is signified by the size of the hood with bachelors' smallest, \r\nmasters' larger, and doctors' quite large and of a different shape. Clemson does not award \r\nhoods to bachelors. The width of the velvet trim also conveys the degree. Secondly, the \r\ndegree is indicated by the color of the trim edging the hood to form the throat over the gown. \r\nThe most frequently seen is dark blue, which designates the doctor of philosophy (Ph.D.) \r\ndegree. Finally, the color of the hood's lining specifies the awarding institution. The colors \r\nare displayed in combinations that are drawn from heraldry. Notice that the Clemson \r\nUniversity hood is lined with purple through which is an orange chevron (a \"V\"). Although \r\nmany combinations are duplicated by dozens of institutions, Clemson is presently the only \r\ninstitution with that registered combination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiastical, or military \r\nregalia as set forth by their professions with the President of C lemson University wearing a \r\npurple gown with four velvet bars piped in gold and the University seal embroidered on the \r\npanels. The Trustees wear a similar gown with three velvet bars piped in gold for doctorates \r\nand an embroidered palmetto tree on each sleeve for those who do not hold doctorates. Hoods \r\nare either from Clemson or from the awarding school. They are preceded by the University \r\nMarshal. C lad in a gown of office in gold and purple, the marshal wears no hood and bears \r\nthe University mace. At the ceremony's close, the faculty do not exit as a part of the \r\nrecessional but are dismissed, along with students and guests, when the marshal leaves the \r\ncoliseum. "
    },
    {
        "page_number": "8",
        "text": "THE UNIVERSITY REGALIA \r\nThe University mace is the symbolic representation of the whole of C lemson \r\nUniversity and must be present at any convocation where the University, \r\nthrough its delegated members, is acting officially. At any official convocation \r\nsuch as commencement, the University Marshal, carrying the mace, precedes \r\nthe President into the assembly. The mace rests before the President's chair or \r\nspeaker's stand throughout the ceremony, and its removal from the assembly at \r\nthe close of a convocation is symbolic of the official withdrawal of the \r\nUniversity and, thus, the close of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial \r\nmaces carried by heads of state and church in the Middle Ages. Its basic \r\nclublike shape, however, is much more ancient, probably going back to man's \r\nprehistory. It is made of walnut wood and silver, with the seal of the University \r\nin gold and the University colors represented by insets of carnelian (orange) \r\nand amethyst (purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the \r\noffice of president by the governing body of the University. Only the \r\nUniversity President may wear it, and while wearing it he speaks for the whole \r\nbody of the institution. Clemson's chain and seal are made of silver and gold, \r\nand carnelian and amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of \r\noffice\" which were carried by the senior members of departments of state or \r\nchurch. They display the seal of the University and the symbolic color of the \r\ndiscipline to which the college belongs. Clemson's batons are made of walnut \r\nwood and silver with the various disciplines inset with enamel. \r\nThe University rega lia were designed and executed by Mr. Robert Ebendorf. \r\nMr. Ebendorf is twice winner of the Tiffany Award and one of the most \r\nacclaimed goldsmiths of our era. The enamel plaques for the batons were \r\nexecuted by the late Professor Marshall C. Bell, and the lapidary work was \r\nexecuted by the late Mr. C. C. Wilson of Clemson University. "
    },
    {
        "page_number": "9",
        "text": "CANDIDATES FOR THE DOCTOR'S DEGREES \r\n). BRUCE RAFERT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nEntomology \r\nSam,Kyu Kim Pusan, South Korea \r\nB.S., Yonsei University \r\nDissertation: Ecology and Phylogeny of Black Flies (Diptera: Simuliidae) and their Trichornyceces (Zygomycora: Trichomycetes) \r\nSymbiotes \r\nAdvisor: Dr. P. Adler \r\nForest Resources \r\nMegan Amy Goddard Apcos, CA \r\nB.S., University of California; M.S., Clemson University \r\nDissertation: Applications of Geographic Information Systems to Urban Watershed Studies in the South Carolina Piedmont \r\nAdvisor: Dr. C. Post \r\nLouwanda W. Jolley~------.,.-~-------------------------Bostic, NC \r\nB.S., Coastal Carolina University; M.S., Clemson University \r\nDissercarion: The Interactions of Indicator Bacteria and Sediments in Fresh Water Streams \r\nAdvisor: Dr. W. R. English \r\nJayme Linn Waldron ....,..,.----,--,..-;;-,--;--:--:-:-c-;-----------------------Coalcon, WV B.S., West Virginia University; M.S., Marshall University \r\nDissertation: Spatial Ecology of Sympatric Rattlesnakes in the South Carolina Coastal Plain \r\nAdvisor: Dr. J. Lanham \r\nGenetics Michele Hucks Eller ________________________________ Westminster, SC \r\nB.S., Southern Wesleyan University \r\nDissertation: Functional and Genomic Characterization of Genes Associated with Developmental Stress in Soybean: Polyamine \r\nPathway \r\nAdvisor: Dr. H. Knap \r\nThomas Matthew Hitchcock Clemson, SC \r\nB.S., M.A., Bob Jones University \r\nDissertation: Mucagenicicy and Repair of Deaminated DNA Lesions in Prokaryotic and Mammalian Systems \r\nAdvisor: Dr. W. Cao \r\nAlicia Jean Manfre Hagerstown, MD \r\nB.A., Texas Christian University \r\nDissertation: Identification and Characterization of a Knockout of the Arabidopsis thaliana Group 1 LEA, A TEM6 \r\nAdvisor: Dr. W. Marcotte \r\nMicrobiology \r\nDonna Ruth Weinbrenner Wichita, KS \r\nB.S., M.S., Clemson University \r\nDissertation: Characterization of Endovascular Responses to Dense Gas Carbon Dioxide Sterilization of ePTFE and Bisphosphonate \r\nEluting PMCH/PMEH Polymers \r\nAdvisor: Dr. T. Tzeng \r\nPlant and Environmental Sciences \r\nJoaquin Andres Chong ---,;;----,,....,-::-,....,--:---=---:-:--------------------Ponce, China \r\nB.S., University of Puerto Rico; M.S., Michigan State University \r\nDissertation: Modeling Poinsettia Stock Plant Canopies and their Production of Cuttings \r\nAdvisor: Dr. J. Faust \r\nChristopher Lynn Ray_,--______________________________ Pendleton, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Effect of Environment and Planting Dace on Soybean Seed Composition \r\nAdvisor: Dr. E. Shipe \r\nPlant Physiology \r\nKaren Carlson Hall ---,--:-;----:-c-::---=c,----,-.,.-------------------- Bryson City, NC \r\nB.S., Western Carolina University; M.S., Clemson University \r\nDissertation: Ethnobotany with the Eastern Band of Cherokee Indians, Including an Assessment of Change in Medicinal Plant Use \r\nthrough Historical Comparison \r\nAdvisor: Dr. N. Camper "
    },
    {
        "page_number": "10",
        "text": "Zoology \r\nTrnvis Hugh Nation, Jr. Seneca, SC \r\nB.S., Funmm University; M.Ed., Converse College \r\nDissertation: The Influence of Soil C<llcium on Land Snail Diversity in che Blue Ridge Escarpmenc of South C<1rolin<l \r\nAdvisor: Dr. D. Tonkyn \r\nCOLLEGE OF BUSINESS AND BEHAVIORAL SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nApplied Economics \r\nChao Fu~~-~-------------------------------- Chengdu, China \r\nB.A., Sichuan University \r\nDissertation: Efficient Risk Management for Crop Producers: An Application of Target Deviation Mcxlels \r\nAdvisor: Dr. S. Miller \r\nAlex Grecu __________________________________ Calarasi, Noldova \r\nB.A., Babes~Bolyai University \r\nDissertation: Spare the Rod and Ocher Essays in Economics of Education \r\nAdvisor: Dr. C. Lindsay \r\nKarim Gulamhusein_co--.,.-,------------------------------Clemson, SC \r\nB.A., M.A., Simon Fraser University \r\nDissertation: Golden Handshakes: Pay for Failure and Executive Dismissals \r\nAdvisor: Dr. M. Maloney \r\nHaizhen Li --,-::--~-o----c-::--.,,.---~-o----=------,-.,,------------ Beijing, China B.A., Beijing Normal Universicy; M.A., Capical Universicy of Economics and Business \r\nDissercacion: Essays on Educacion and Rural Economic Growth: Evidence from che U.S. South \r\nAdvisor: Dr. M. Henry \r\nCharles Steven Reback _______________________________ Spartanburg, SC \r\nB.S., University of Pennsylvania; M.S., Boston College; M.A., Clemson University \r\nDissertation: Essays in Financial Malfeasance \r\nAdvisor: Dr. R. Sauer \r\nFerdinand Dimaculangan Vinuya Cabiao, Philippines \r\nB.S., University of the Philippines; M.S., Clemson University \r\nDissercation: Technical Efficiency of South Carolina Shrimp Fishery, Exchange Rate Pass~Through of Shrimp Exporcers, and the \r\nEvidence of Market Integration in Shrimp Markets \r\nAdvisor: Dr. M. Hamming \r\nIndustriaVOrganizational Psychology \r\nJohnell 0. Brooks Pickens, SC \r\nB.A., M.S., Clemson University \r\nDissertation: The Actual and Estimated Ability of Younger and Older Drivers to See and Steer in Challenging Visual Conditions: A \r\nTest of the Selective Degradation Hypothesis \r\nAdvisor: Dr. R. Tyrell \r\nManagement \r\nAnthony Joseph Gabriel __________ -,-_____________________ Warren, PA \r\nB.S., Grove City College; M.S., Georgia Institute of Technology \r\nDissercation: Measuring Static Manufacturing Complexity and its Effects under Demand Uncertainty \r\nAdvisor: Dr. L. Fredendall \r\nHoward Charles Ralph, Jr. -:--:--:-.,,.--0---,,-:----:-::-----------------------Liberty, SC B.A., University of Maryland; M.B.A., Clemson University \r\nDissertation: The Influence of Variability on the Performance of a Manufacturing Cell \r\nAdvisor: Dr.]. Patterson \r\nXingxing Zu Shanxi, China \r\nB.E., M.S., Tianjin University \r\nDissertation: A Study of the Impact of Six Sigma on Firm Performance: Theoretical Analysis and Empirical Investigation \r\nAdvisor: Dr. L. Fredendall \r\nManagement Science \r\nKanoktip Nimitkiatklai ___ -:-~.,,.---:-~----------------------Lampang, Thailand \r\nB.S., Chiangmai University; M.S., Case Western Reserve University \r\nDissertation: The Lifetimes of Random Sets \r\nAdvisor: Dr. P. Kiessler \r\n2 "
    },
    {
        "page_number": "11",
        "text": "COLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nBiosystems Engineering \r\nRobert King Pollock ________________________________ Granville, OH \r\nB.A., Hiram College; B.S., University of South Carolina; M.S., Clemson University \r\nDissertation: Heat Transfer Model for a Micro; Hydroponic Greenhouse Chamber \r\nAdvisor: Dr. W. H. Allen \r\nChemical Engineering \r\nBamidele Adisa Ibadan, Nigeria \r\nB.S., University of Lagos \r\nDissertation: Synthesis, Characterization and Modeling of Novel Polymers and Polymer;Templated Mesoporous Materials \r\nAdvisor: Dr. D. Bruce \r\nAmit Yashwant Sankhe Mumbai. India \r\nB.S., University of Mumbai; M.S., Clemson University \r\nDissertation: Novel Routes for Direct Preparation of Surface; Modifying Polyelectrolyte Layers and Patterned Polymer Surfaces \r\nAdvisor: Dr. S. Kilbey II \r\nChemistry \r\nJacquitta Katrina Daniels --------------------------------Quinby, SC B.S.1 Francis Marion University \r\nDissertation: Silver Nanostructures for Biological and Environmental Sensor Applications \r\nAdvisor: Dr. G. Chumanov \r\nLibin Du _____________________________________ Erdos, China \r\nB.E., Tianjin University; M.S., Chinese Academy of Sciences; M.S., Clemson University \r\nDissertation: Chemistry of Fluorinated Hypohalices, Vinyl Ethers, Formates and Other Novel Reactions \r\nAdvisor: Dr. D. DesMarceau \r\nDavid Duane Evanoff, Jr. _______________________________ New Castle, PA \r\nB.S., Westminster College \r\nDissertation: Synthesis and Optical Properties of Metal Nanoparcicles and Nanocomposice Materials \r\nAdvisor: Dr. G. Chumanov \r\nChangqing Lu .---,----,--,c:-----,-=---:---:--,-.,-,,-,-,,----:,--,,---=,----,-,~--------Suxian, China \r\nB.S., East China Institute of Chemical Technology; M.S., Nanjing College of Chemical Engineering \r\nDissertation: Synthesis of Novel Trifluoroethylated-Amino Acids and Peptides \r\nAdvisor: Dr. D. DesMarteau \r\nPamela Piotrowski Medford Lakes, NJ \r\nB.S., Salisbury State University \r\nDissertation: Reparameterization of Covalent Bonding Interactions in the AIREBO Potential and Application co Reaction within \r\nCarbon Nanotubes \r\nAdvisor: Dr. S. Stuart \r\nBryan Keith Sprau! ....,.,...,.--------------------------------St Mary, MO \r\nB.S., University of Missouri \r\nDissertation: Aromatic T rifluorovinyl Ethers: Synch es is, Polymerization and Characterization \r\nAdvisors: Dr. D. Smith, Jr. \r\nDr. D. Perahia \r\nAlbert Eugene Willis Ill ______________________________ Washington, GA \r\nB.S., Georgia Southern University \r\nDissertation: Novel Neomycin Conjugates for Multi-Recognition of Nucleic Acids \r\nAdvisor: Dr. D. Arya \r\nCivil Engineering Bradley James Putman _______________________________ Johnson City, NY \r\nB.S., M.S., Clemson University \r\nDissertation: Quantification of the Effects of Crumb Rubber in CRM Binders \r\nAdvisor: Dr. S. Amirkhanian \r\nElizabeth Scoville San Salvador, El Salvador \r\nB.S., University of Central America; M.E., Virginia Polytechnic Institute \r\nDissertation: Investigation of the Response of Low-Rise-Wood-Frame Roof-Wall System under Combined Uplift and In-plane Shear \r\nLoads \r\nAdvisor: Dr. S. Schiff \r\nYan Sun Yan Tai, China \r\nB.S., M.S., Tongji University \r\nDissertation: Wind Loads on Hurricane Scraps: The Role of Structural Influence Functions in Developing Net Loads on Roof \r\nConnections \r\nAdvisor: Dr. T. Reinhold \r\n3 "
    },
    {
        "page_number": "12",
        "text": "Computer Engineering William Michael Jones, Jr. _______________________________ Conway, SC \r\nB.S., M.S., Clemson University \r\nDissertation: Improving Parallel Job Scheduling Performance in Multi;clusters through Selective Job Coallocacion \r\nAdvisor: Dr. W. Ligon lll \r\nComputer Science \r\nNathan Allen Cournia Dyersburg, TN \r\nB.S., Middle Tennessee Scace Universicy \r\nDissertation: Penumbra Volume Maps for Real; Time Generacion of Perceptually Correcc Safe Shadows on Modern Graphics \r\nHardware \r\nAdvisor: Dr. A. Duchowski \r\nEdward James Doyle ll ________ ________________________ Columbia, MO \r\nB.S., M.S., University ofMinnesoca \r\nOis.5ertation: Equivalence of Refutation Procedures for lntuicioniscic Logic \r\nAdvisor: Dr. D. Scevenson \r\nNeil Wayne Kassel ________________________________ Beavercreek, OH \r\nB.S., Souchern Illinois Universityi M.S., Air Force Institute \r\nDissercacion: An Approach to Automace T esc Cases from Scruccured Use Cases \r\nAdvisor: Dr. B. Malloy \r\nKen Edward Kennedy ________________________________ Attapulgus, GA \r\nB.A., Mercer University \r\nDissertation: CAPS: Clemson Automacic Programming Syscem \r\nAdvisor: Dr. D. Stevenson \r\nHunter Allen Murphy _________________________________ Central, SC \r\nB.S., M.S., Clemson University \r\nDissertacion: Bridging che Gap between lmage;/Model;Based Perceptual Rendering \r\nAdvisor: Dr. A. Duchowski \r\nElectrical Engineering \r\nJian Chen.~~~-~~----------------------------- Hengyang, China \r\nB.S., M.S., Zhejiang University \r\nDissercacion: Visual Servo Control wich a Monocular Camera \r\nAdvisor: Dr. D. Dawson \r\nJason Matthew Keen Gurley, AL \r\nB.S., Clemson Universicy \r\nDissertation: Aperture Coupling and Penecration in Various Configuracions as Modeled by lncegral Equation and Beche Hole \r\nTechniques \r\nAdvisor: Dr. C. Butler \r\nMichael David Lockard Columbia, SC \r\nB.S., M.S., Clemson University \r\nDissercation: Accurate Modeling Techniques for a Genetically Optimized Monopole Antenna Fed by a Tapered Coaxial Line and \r\nLoaded with Shielded Coil Structures \r\nAdvisor: Dr. C. Butler \r\nJabberia Rico Miller ______________ _ _ _________________ Rock Hill, SC \r\nB.S., M.S., Clemson University \r\nDissercation: Fabricacion ofMillimecer Wave lncegraced Circuics in a Polymer Macerial Syscem \r\nAdvisor: Dr. L. Pearson \r\nJason Simpson Skinner _____________ _ __________ _ ____ Temperance Hill, SC \r\nB.S., The Citadel; M.S., Clemson University \r\nDissertation: Adaptive Coding for Mobile Wireless Frequency; Hop Spread;Spectrum Networks \r\nAdvisor: Dr. M. Pursley \r\nMaterials Science and Engineering \r\nGang Cheng~--------~-----------------------Huixian Cicy, China \r\nB.S., Zhengzhou Universityi M.S., Wuhan University \r\nDis.sertation: Structural Studies of Complex Fluids: Block Copolymers and Liquid Crystals \r\nAdvisor: Dr. D. Perahia \r\nPaulo Estevao Lopes.~ ___ ___ _____________ _ _ ____ _ Vila Nova de Faz Coa, Portugal \r\nB.S., Universicy of Porco \r\nDissertation: ln~Situ X;Ray Characcerizacion of Polymer Processing - Mele Spinning of iPP \r\nAdvisor: Dr. W. Penningcon \r\nXiaofeng Tang~-~----~~-~--~-~------------------ Hunan, China \r\nB.S., Central South University of Technology; M.S., Tsinghua University \r\nDissercacion: Synthesis and Propercies ofNa~Co 0• Thermoeleccric Macerials \r\nAdvisor: Dr. T. Trice \r\n4 "
    },
    {
        "page_number": "13",
        "text": "Mathematical Sciences \r\nDariusz Wlodarczyk ___ ~-----------------------------Torun, Poland M.S., Nicholas Copernicus University \r\nDissertation: Synthesis Dynamic Multi-Rigid-Body Contact Problems with Friction \r\nAdvisor: Dr. M. Kostreva \r\nMechanical Engineering \r\nYuna Hu~--.,-,----,-----,----=--~-~-,---,----.,---~~~~---------Samutprakarn, Thailand B.S., Taiyuan Heavy Machinery College; M.S., Beijing Institute of Technology \r\nDissertation: Optimization Design for Additive Manufacturing of Heterogeneous Objects \r\nAdvisor: Dr. G. M. Fadel \r\nJonathan Randolph Alden Maier ____________________________ Chapel Hill, NC \r\nB.S., Georgia Institute of Technology; M.S., Clemson University \r\nDissertation: Foundations of Affordance Based Design \r\nAdvisor: Dr. G. M. Fadel \r\nYi Miao ____________________________________ Shanghai, China \r\nB.E., M.E., Shanghai Jiaotong University \r\nDissertation: Packing Optimization of Engineering Problems \r\nAdvisor: Dr. G. M. Fadel \r\nPhysics \r\nHailemariam Ambaye --------------------------------Ziway, Ethiopia \r\nB.S., M.S., Addis Ababa University \r\nDissertation: Diatomic Molecule Scattering from Metal Surfaces and its Application \r\nAdvisor: Dr. J. Manson \r\nJessica Crist Lair _______________________________ Charlton Heights, WV \r\nB.S., West Virginia Institute of Technology; M.S., Clemson University \r\nDissertation: An Observational Analysis of the Late Light Curves of Type la Supernovae \r\nAdvisor: Dr. M. Leising \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF EDUCATION \r\nCareer and Technology Education \r\nWayne Parks Frady Seneca, SC \r\nB.B.A., University of Georgia; M.H.R.D., Clemson University \r\nDissertation: A Study of High School Students' Career Interest Inventories and Their Relationships to Student Completion of \r\nOccupational Programs \r\nAdvisor: Dr. C. Poston \r\nLiam Henry O'Hara Central, SC \r\nB.A., University of Georgia; M.A.T., University of South Carolina; M.ln.Ed., Clemson University \r\nDissertation: Colorimetric Characterization of Printing Presses Using Targets Compensated for Tonal Value Increase \r\nAdvisor: Dr. S. Ingram \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction \r\nTerrell Tracy -----,---,---,----,------,---,---,----------------------Fountain Inn, SC B.A., University of North Carolina at Chapel Hill; M.A., Boston University \r\nDissertation: Fetching the Future: A Delphi Study on the Future of Education \r\nAdvisor: Dr. V. Ridgeway \r\nEducational Leadership \r\nJason Frederick Cassidy Easley, SC \r\nB.S., Bethany College; M.S., Canisius College \r\nDissertation: Perceived Barriers and Benefits to Addressing Ecological Factors on a Campus with a Dry Alcohol Policy \r\nAdvisor: Dr. P. Havice \r\nSteven Keith Glenn Marion, NC \r\nB.S., Mars Hill College; M.Ed., Clemson University . \r\nDissertation: The Relationship between National Board Certified Teachers and Student Achievement \r\nAdvisor: Dr. J. Flanigan \r\nParks, Recreation, and Tourism Management \r\nJames Merle Gould -------------------------------- Swainsboro, GA B.S., M.S., Georgia Southern University \r\nDissertation: Development of the Serious Leisure Inventory and Measure \r\nAdvisor: Dr. F. McGuire \r\nSajna Suresh Shenoy_-c~-------~-,-----------------------·Cochin, India \r\nB.A., SNOT Women's University; M.T.A., Pondicherry University \r\nDissertation: Food Tourism and the Culinary Tourist \r\nAdvisor: Dr. W. Norman \r\n5 "
    },
    {
        "page_number": "14",
        "text": "GRADUATE SCHOOL \r\nDOCTOR OF PHILOSOPHY \r\nPolicy Studies Jeffery Scott Allen __________________________________ Central, SC \r\nB.S., Michigan State University; M.S., University of South Carolina \r\nDissertation: Policy and Methcxlological Implications of a Coastal Urban Growth Prediction Model \r\nAdvisor: Dr. R. Becker \r\nDavid Christopher Cico Decatur, IN \r\nB.S., Wright State University; M.A., Clemson University \r\nDis.serration: The Elderly and Public Education: The Effect of Migrant Elderly Households on Government Financed Education \r\nSpending at the County Level \r\nAdvisor: Dr. M. Cunningham \r\n6 "
    },
    {
        "page_number": "15",
        "text": "CANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nJ. BRUCE RAFERT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nJessica Lyn Davis __________ Lexington, SC Abbie Lynne Piotrowsky _________ Belton, SC \r\nCharlotte Feltman Jennings Enoree, SC Kristin Michelle Walsh Greenville, SC \r\nMASTER OF FOREST RESOURCES \r\nJason Eule Jennings ~~--------Woodruff, SC Christopher Michael O'Bryan ______ Louisville, KY \r\nThomas Finley McCaskill Sumter, SC \r\nMASTER OF SCIENCE \r\nAgricultural and Applied &onomics \r\nSteven Scott Bolt __________ Orangeburg, SC Erin Linwood Hall _________ Chesterfield, SC \r\nWilliam Cletus Davis Williston, SC \r\nAnimal Physiology \r\nPatrick Joseph Myers ________ Bowman, SC \r\nBiochemistry \r\njerry Lee Thurman, Jr. _______ Fort Myers, FL \r\nEntomology \r\nKristin Denise Cobb ________ Anderson, SC \r\nEnvironmental Toxicology \r\nDina Kristine Spangenberg San Diego, CA \r\nFood, Nutrition, and Culinary Sciences \r\nDavid Richard Howell Florence, SC \r\nForest Resources \r\nDavid Berry Andrews lV _________ Elkins, NH Merideth Paige Grooms _________ Coward, SC \r\nGenetics \r\nCecile Chantal Aube _______ Epernon, France \r\nMicrobiology \r\nGabriel Mitchell McAlister _______ Seneca, SC \r\nPlant and Environmental Sciences \r\nKatherine Ann Ellingson _______ Albert Lea, MN Shail Shantilal Sangoi _________ Clemson, SC \r\nKathleen Ann Kegley Keokee, VA \r\nZoology \r\nHeather Lynne Kozak ________ Vienna, VA \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nMASTER OF ARCHITECTURE Lawrence Joseph Delaney Ill ________ Seneca, SC Michael Burgess Williams ________ Yaldosta, GA \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nSrinath Meenakshi Sundaram ______ Chennai, India Sivaramakrishna Yarrabilli _____ Visakhapatnam, lndia \r\nSirisha Tatineni New Brunswick, NJ \r\nMASTER OF FINE ARTS \r\nVisual Arts \r\nCailin Gibbons.,...,.,_----------. Amherst, MA Amanda Landreth O'Brien ______ ~-,-- Easley, SC \r\nCaroline jean Hall Bloomfield, NY Cassie Lea Robbins Madisonville, TN \r\nMASTER OF ARTS \r\nEnglish \r\nStacey Lynn Beaton __________ Greenville, SC Alicia Melody Dodson __________ Pickens, SC \r\nAmelia R. Borders Anderson, SC \r\n7 "
    },
    {
        "page_number": "16",
        "text": "MASTER OF ARTS \r\nHistory \r\nTimothy Paul Blakeney _ _____ Madison Heights, Ml Sarah Elizabeth Donelson _______ Greenville, SC \r\nThomas Adams Coker, Jr. Greenville, SC Peter Clifford Heffner Taylors, SC \r\nProfessional Communication \r\nMisty Brooke Mohr _________ Simpsonville, SC Lindsey Michelle Robbins _________ Mason, Ml \r\nElizabeth Hope Parham Norris, SC \r\nCOLLEGE OF BUSINESS AND BEHAVIORAL SCIENCE \r\nMASTER OF BUSINESS ADMINISTRATION \r\nScott Raymond Bushey ________ Greenville, SC Milo Stephen Metcalf II ________ Greenwood, SC \r\nTygere Mattea Gibbs Charleston, SC MarciaJoAnn Powell Indianapolis, IN \r\nMichael Lance Gregory Easley, SC James Hamilton Snoddy Greenwood, SC \r\nJoseph Adam Hall Marion, NC C. Justice Tillman Augusta, GA \r\nKevin Brian Jones Simpsonville, SC \r\nMASTER OF PROFESSIONAL ACCOUNTANCY \r\nLeigh Gray Dodson ---------- Six Mile, SC Chad William Reingardt _______ Bennettsville, SC \r\nMichelle Knight Hawkins Anderson, SC Thomas Stephen Yonchak Louisville, GA \r\nPaige Irene Littlejohn Six Mile, SC \r\nMASTER OF PUBLIC ADMINISTRATION (Master of Public Administration is jointly administered by \r\nClemson University and the University of South Carolina.) \r\nBernie Sarfo Annor ________ Silver Spring, MD Martha Ashley Miller --------- Mauldin, SC Carson R. Beene Greenville, SC Stuart Arthur Morris Charlotte, NC \r\nKyle Travis Craigo Easley, SC Jacob Gordon Stoudenmire Columbia, SC \r\nJohn Wayne Crolley Myrtle Beach, SC Olivia Maree Vassey Seneca, SC \r\nWayne E. Gregory, Jr. Charleston, SC Jennifer Beth Wood Greenville, SC \r\nMASTER OF ARTS \r\nEconomics \r\nConstantin Mihai Diaconu ______ Clemson, SC \r\nMASTER OF SCIENCE \r\nApplied Psychology \r\nAshanti Renee Edwards __________ Miami, FL Benjamin Michael Orchard. _______ Richmond, KY \r\nStephanie Renee Fishel Winston-Salem, NC Carrie Elizabeth Robertson Fayetteville, AR \r\nMoira Elizabeth Hanna Greer, SC Laurie Eva-Lyn Wasko Carmel, NY \r\nJonas Paul Johnson Atlanta, GA Brian J. Zickefoose Kansas City, MO \r\nApplied Sociology \r\nAndrea Janelle Stroud _________ Danville, VA Tiffany Marie Wilburn _______ Chagrin Falls, OH \r\nGraphic Communications \r\nWade Austin Beard---------- Andrews, SC Endrias Hailu Zewde ______ Addis Ababa, Ethiopia \r\nErica Frances Black Roswell, GA Ermias Hailu Zewde Addis Ababa, Ethiopia \r\nZachary Thomas Nicholas Seneca, SC \r\nManagement \r\nEric Kenneth Bachmann ________ Tallmadge, OH Sandeep Suryanarayanan ________ Clemson, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCivil Engineering \r\nAdam Robert Hogan-------- Clemson, SC \r\nMASTER OF SCIENCE \r\nBioengineering \r\nJared Andraus Cammon -------- Decatur, GA Laurence Jayet ----------- Cannes, France \r\nChaitra Cheluvaraju Mysore, India James Melvin Lindsey III Conway, SC \r\nEdward William Fritz, Jr. Fort Mill, SC Meghna Sridharan Chennai, India \r\nCheryl Teresa Gomillion Aiken, SC Michael Aaron Vaughn Taylors, SC \r\nBiosystems Engineering \r\nJohn Frederick Hearon, Jr. ______ New Orleans, LA Robert Paul Morrison __________ .Sumter, SC \r\nWill Gregory Henderson, Jr. Ninety Six, SC Bradley Lehman Weeber Seneca, SC \r\nSamuel Douglas Moore, Jr. Williamston, SC \r\n8 "
    },
    {
        "page_number": "17",
        "text": "Chemistry \r\nT ;ua Patrice Elkin Wilmington, NC Jia Hu Chengdu, China \r\nCivil Engineering \r\nMohammad T. Abu-Hijleh Amman, Jordan Saurabh Sudhir Kahre Clemson, SC \r\nOscar Rafael Antommattei Yauco, Puerco Rico Amolprasad Satish Kulkarni Dombivli, India \r\nJipal Pravinchandra Bhalodwala Bharuch, India Can Kundak Istanbul, Turkey \r\nAmanda Hope Blackwell Murrell's Inlet, SC James Heyward Mattox Ill Winnsboro, SC \r\nErin Michelle Brinton Tupelo, MS Melanie Aurore Mercier Paris, Frnnce \r\nNathan Paul Cockfield Greenwood, SC Thomas Andrew Miller Massillon, OH \r\nKathryn Page Copeland Clinton, SC Shubhendu Mohanty Clemson, SC \r\nWilliam Mann Decker Pittsburgh, PA Michael Edward O'Dell Florence, SC \r\nRyan Joseph Dlesk Wheeling, WV Joseph James Piccirilli Rochester, NY \r\nKyle Walker Farley Chapin, SC Leslie Alice Raymond Hanahan, SC \r\nChriscopher Lee Farrar Anderson, SC Nikhil Ramesh Shinde Bhusawal, India \r\nAnthony Peter Frontiero, Jr. Virginia Beach, VA Ethan Koger Sims Charleston, SC \r\nJanet Marie Halasinski Massillon, OH Jennifer Baxley Skinner Marion, 1 SC \r\nViet T rung Huynh Goose Creek, SC Barton Lee Stoll Conway, SC \r\nlmran Mushtaque lnamdar Poona, India Christopher Michael Strang Charleston, SC \r\nRoh it Shrigopal Jagnani Ahmedabad, India Jonathan Donald Williams Cleveland, NC a Hayes Winfred Jones Rock Hill, SC Di Zhang Clemson, SC \r\nComputer Engineering \r\nDaniel Ryan Galloway Greenwood, SC Aleksandar Mitrovic Belgrade, Yugoslavia \r\nCharly Hermanson West Columbia, SC Louis Wai On Pang New York, NY \r\nJoshua Ian Hughes Chesnee, SC Hemanth Siddulugari Anantapur, India \r\nSebastien Lafontant Valley Stream, NY \r\nComputer Science \r\nAbbas Eslami Amirabadi Central, SC Emily Jane Luetkemeier Greenville, SC \r\nNell Jemay Beatty Seneca, SC Ajay Madhavan Clemson, SC \r\nJesse Rosamond Freeman IV Lexington, SC Claude Bertram Marshall Port~of~Spain, Trinidad \r\nNeil Spencer Harmon Anderson, SC John Wesley Forester McPherson Knoxville, TN \r\nJames Lee Huff Augusta, GA Nishanth Reddy Pendluru Bangalore, India \r\nJonathan David Johnson Greenville, SC Sameer Jaywant Potdar Clemson, SC \r\nJitesh Kamat Clemson, SC Aashish Atul Shastri Mumbai, India \r\nAyoob Khan Clemson, SC \r\nElectrical Engineering \r\nAjay Abraham Bangalore, India William Chu Hyon McMahan Springfield, VA \r\nAbhishek Aneja Clemson, SC Karthik Narayanan Madras, India \r\nSri Chandana Devi Bommareddy Hyderabad, India Bragadeeshwaran Natarajan Chennai, India \r\nSteven Wesley Boyd Central, SC Paul Matthew Poppe Piedmont, SC \r\nMatthew Calbraith Crisler Mt Pleasant, SC Pramod Poduri Hyderabad, India \r\nTimothy Taylor Ensminger Anderson, SC Shrinivas Jayant Pundlik Pune, India \r\nPrashanth Y. Govindaraju Mysore, India Sriram Rangarajan Chennai, India \r\nSunil Kumar Guduru Hyderabad, India Krishna Chaitanya Sagiraju Hyderabad, India \r\nVikram Nandakumar Iyengar Clemson, SC Suketu Mahesh Shah Mumbai, India \r\nYi Jiang Chengdu, China Manoj Kumar Sivanandham Chennai, India \r\nDinakar Kondru Vijayawada, India Chellappa Vairavan Chennai, India \r\nShruti Sudhir Mathure Mumbai, India \r\nEnvironmental Engineering and Science \r\nLeo Angelo Gumapas North Charleston, SC David Brent Rankin, Jr. North Augusta, SC \r\nRajiv Prakash Matta Mumbai, India Jie Shen Nantong, China \r\nOlivia Brocato Orr Spartanburg, SC \r\nH ydrogeology \r\nAllison Leigh Craig San Antonio, TX Richard Alan Mayer, Jr. Easley, SC \r\nIndustrial Engineering \r\nSrinivasan Anandan Mumbai, India Pratik Pradyuman Goradia Mumbai, India \r\nElif Derince Tasci Ankara, Turkey Esengul Tayfur Istanbul, Turkey \r\nYu Feng Changchun, China \r\nMaterials Science and Engineering ~ Hari Chandana Bellam Hyderabad, India Kartiki N. Wani Dhule, India \r\nThomas Wade Hawkins Pendleton, SC \r\nMechanical Engineering ~ Saeid Bashash Clemson, SC Jones Ricardo Muller Chapeco, Brazi I \r\nVinod Cherian Bangalore, India Anthony Luke Pesce Columbia, MD \r\nDana Christine Hansen Verdi, NV Paul Adam Sobolewski Arlington Heights, IL \r\nJoseph Husted Houlton, ME Ramaswami Subrahmanian Chennai, India \r\nYongchang Ma Chongqing, China Paul Hunter Wright Greenville, SC \r\nUday Bhaskar Mandhata Kakinada, India \r\n9 "
    },
    {
        "page_number": "18",
        "text": "Physics \r\nPoll)la Nidi<l Allxmi __________ Wellford, SC Debra RcAnn Gibson--------- Hartsvi lle, SC \r\nJllhn Michael Cook Fort Mill, SC Liqiu Zheng Clemson, SC \r\nJasnn Allen Edwards Charlotte, NC Xiaoqian Zhou Shanghai, China \r\nTextiles, Fiber and Polymer Science \r\nSrinivasa Rajanik:mth Varkol ___ Kmimnagar, India \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nAdministration and Supervision \r\n1 \r\nChristopher Lane Chapman ------~~Pelzer, SC Michael L. Noel __________ __, Leesville, LA \r\nSuzanne Cook Hanna Clemmons, NC Toni Roberts Norris Greenville, SC \r\nJada Antionette Kidd Mobile, AL Christie Denise Shealy Pelzer, SC \r\nShakeria G. McCullough Greer, SC Julie Ann Whetston Simpsonville, SC \r\nGary Ruehl Mohr, Jr. Liberty, SC Charles James Winney Schuylerville, NY \r\nMickie Jackson Morton Griffin, GA \r\nMASTER OF ARTS IN TEACHING \r\nMiddle Grades Education \r\nRenee Willingham Gibert Columbia, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nJennifer Ann Aldworth _________ Sea Cliff, NY Ronnie Edward Jenkins Cleveland, TN \r\nPhillip Cullen Arendall Wilmington, DE Mary-Margaret Jordan Central, SC \r\nMary Joy Becker Fridley, MN Reba Renee Kay-Purdessy Seneca, SC \r\nLisa R. Beilharz-Tyler Grand Ledge, Ml Kym Harris Rainey Kennedy Richmond, VA \r\nBridget Donahue Cooley Dracut, MA Joseph M. Lynch Pompton Plains, NJ \r\nJacqueline Aldebaran Crocker Fort Worth, TX Michael William Mamin Billings, MT \r\nTerri Caprice Crumbley Irvington, NJ Huy Quang Pham Anaheim, CA \r\nDavid Lewis Dorrity Greenville, SC Joshua Shannon Propst Fletcher, NC \r\nMargaret Leanne Fuller Greenville, SC Rebecca Ann Radosevich ____ Middleburg Heights, OH \r\nJohn Gabriel Hollingsworth Anderson, SC Henry Thomas Stubbs Westminster, SC \r\nJoseph Charles Hungler Worcester, MA April Nicole Thompson Greensboro, NC \r\nLisa M. Hunter Galway, NY \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nLacresha R. Byrd .~---------~Laurens, SC Emily Louise Thomas. ________ Simpsonville, SC \r\nGinger Knox Griffith Greenville, SC Delores David Wardlaw Pendleton, SC \r\nSheree Johnson Hill Greenwood, SC Katherine Hill Wilburn Spartanburg, SC \r\nMatthew Wilson Phillips Greer, SC \r\nCounselor Education \r\nJanice Nelms Bishop ________ Ware Shoals, SC Curtis Hill .,...,.--..,---------- Anderson, SC \r\nRachel Collins Butler Durham, NC Lindsy Elise Nevetla Columbia, SC \r\nRebecca Callaham Greenville, SC Kathryn Williams Rice Central, SC \r\nAlrinthea Faye Carter Charleston, SC Bradley Davis Rothell Landrum, SC \r\nAutumn L. Cline Simpsonville, SC Crystal Cantrell Sehlke Greer, SC \r\nAnna Tahanee Copeland Inman, SC Patricia King Wooten Mountain Rest, SC \r\nCharles Terrell Davis, Jr. Greenville, SC Jessica Hammett Yates Simpsonville, SC \r\nRhonda Michelle Gambrell Starr, SC Allison Lynn Youn Greenville, SC \r\nDavid Wray Helms Central, SC \r\nElementary Education \r\nMelanie Norryce Biggerstaff _______ Abbeville, SC Sara Kathryn Crawford-------- Abbeville, SC \r\nLeslie Pozo Bradley Anderson, SC \r\nReading \r\nLindsey Erin Bailey --------- Spartanburg, SC Casey Dawn Ellison __________ Anderson, SC \r\nAmy Kathryn Drabik Simpsonville, SC Whitten Leigh Stewart Aiken, SC \r\nSecondary Education \r\nJesse Edward Breneman ________ Greenville, SC Ann Marie lliano ___________ Fort Mill, SC \r\nSpecial Education \r\nDannis Marie Finet ________ Anderson, SC \r\nMASTER OF SCIENCE \r\nNursing \r\nSusan Gail Mc William --------=-Greenville, SC Angela Karen Pye ~--------- Mauldin, SC Norma E. Newsom Fountain Inn, SC Connie Mantle Steed Spartanburg, SC \r\nIO "
    },
    {
        "page_number": "19",
        "text": "Parks, Recreation, and Tourism Management \r\nJennifer L. Lytle Albuquerque, NM \r\nGRADUATE SCHOOL \r\nMASTER OF FINE ARTS \r\nDigital Production Arts \r\nYu~Ting Chiu ___________ Tainan, Taiwan Gaurav Nitin Shenai _________ Glendale, CA \r\nChristopher Gates Doehling Rock Hill, SC Edward Michael Siomacco, Jr. Raleigh, NC \r\nSerenthia Renee Ross Jackson, MS \r\n11 "
    },
    {
        "page_number": "20",
        "text": "CANDIDATES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nCAL VIN LEE SCHOUL TIES, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\n**Erin E. Dougherty __________ Grayson, GA Randall Clyde Lindstrom ________ Palm City, FL \r\nDOUBLE MAJOR \r\nBiology and Spanish \r\nt*Lauren Elizabeth Saulino Philadelphia, PA \r\nBACHELOR OF SCIENCE \r\nAgricultural and Applied Economics \r\nSamuel Jason Perry Saluda, SC \r\nAgricultural Education \r\nJana Michelle Black __________ Bamberg, SC Kyle Patrick Hatcher _________ Anderson, SC \r\nRyan Douglas Gambrell Honea Path, SC Heather Ann Whitmire Brevard, NC \r\nAgricultural Mechanization and Business \r\nMerdith Dane Hanna Manning, SC \r\nAnimal and Veterinary Sciences \r\n**Anna Anita Bagwell _________ Gaffney, SC Nichole lr~ne Massey ---------Leesville, SC \r\n*William Brett Bozeman Ball Ground, GA Bridget Drew McCarthy Trumbull, CT \r\n**Ashlee Michele Brown Greenville, SC Werner David McDannald Fountain Inn, SC \r\n*Brenna Nichole Burkett Walterboro, SC George William Rauton IV Johnston, SC \r\nFeby Elizabeth Cash Wilson, NC Elizaberh Moorer Taylor Horrell Hill, SC \r\n**Rebecca Kay Clarke Camden, SC Julia Myers Warren Blythewood, SC \r\nAnna E. Fuller Birmingham, AL Racheal Elizabeth Wessell Landrum, SC \r\nJames Tony Holtzclaw Greer, SC t**Jena Rene Wickman Spartanburg, SC \r\n*Ellen Baker Locklear Mt Pleasant, SC Grendel Jamal Williams Pendleton, SC \r\nt***Elizabeth Lucienne Marlow Murrell's Inlet, SC \r\nBiochemistry \r\nt***Elise Helene Chiquoine _______ Newark, DE t***Lea Marie Lanni ___________ Irmo, SC \r\nt*Leroy Leon Cooper Johnsonville, SC Adriana Qelemati Sopik, Albania \r\nBiological Sciences \r\nGrace Anne Daniel _________ ~~-Irmo, SC t**Sarah Elizabeth Koerner ____ Signal Mountain, TN \r\nLeigh Ann Davidson Mt Pleasant, SC Melissa Sue Littleton Pendleton, SC \r\nTyler John Davis Princeton, SC t***Allen Ernest Pendarvis, Jr. Charleston, SC \r\nt**Lisa Shawn Durham Greer, SC Jared Charles Richardson Spartanburg, SC \r\nt*James Michael Galloway Summerville, SC t**Daniel Ryan Toms Spartanburg, SC \r\nPhallan Nichole Helmly Moncks Comer, SC Derek Charles Watchorn Spartanburg, SC \r\nMarshall Mclain Jones Tallahassee, FL Bryan Curtis Will Wilkesboro, NC \r\nCrystal Anica Junious;Green Rimini, SC \r\nEnvironmental and Natural Resources \r\nMargaretta Elizabeth Kruesi ______ Isle of Palms, SC *Robert Francis Reynolds ______ Margaretville, NY \r\nGraham Mclean Marsh Camden, SC Sarah Nicole Shelly Easton, MD \r\nMichael Brent Reilley Ridgefield, CT \r\nFood Science \r\nCarolyn Marie Beiter _________ Rockville, MD **Jodie Carroll Briggs _________ Hartwell, GA \r\nForest Resource Management \r\nJonathan Wayne Barker -------~-Seneca, SC *Tonya Lynn Harrington _______ Georgetown, SC \r\nClay Marshall Chaplin Green Pond, SC Christopher Linn McGee Barnwell, SC \r\nJohn Lucas Curry Fountain Inn, SC Luke Alan Penney Lexington, SC \r\nCharles Stephen Erb Fleetwood, PA \r\nHorticulture \r\nJames Paul Allen---------- Belvedere, SC Pickens McCollum Lindsay Clemson, SC \r\nMichael Gavin Berry Ward, SC John Norman Owens Ill Boiling Springs, SC \r\nCharles Rogers Ellis Atlanta, GA Kenneth Lee Ueckert Dallas, TX \r\nDeidre A. Jones Liberty, SC Randolph Aubrey Meade Wadsworth ___ Mt Pleasant, SC \r\nMicrobiology \r\n*Cannon Todd Bixler __________ Laurens, SC Shaun David Fair __________ Charleston, SC \r\n*Christopher Michael Bruno Bartlett, TN t**Megan R. Shive Chapin, SC \r\nJacob Ross Culbertson Greenville, SC \r\n12 "
    },
    {
        "page_number": "21",
        "text": "Packaging Science \r\nJames Sheldon Aakhus ---------..,, Anderson, SC Michael Thomas Shaughnessy Rochester Hills, Ml \r\nAndrew Bradley Clausen Spartanburg, SC Lanier Kirkland Shuler Mr Pleasant, SC \r\nHenry Wright Gaylord Anderson, SC Peter Cowgill Slaton Lilburn, GA \r\nJames Austin Harrison Campobello, SC Edwin Karl Smith II Mullins, SC \r\nJonathan Charles Hughey Simpsonville, SC Chad Austin Snipes Fork, SC \r\nWillene Patrice Johnson Charleston, SC **Christopher James Trant Simpsonville, SC \r\nAndrew Joseph Kessler St Albans, WV Robert Allen Vaughn, Jr. Greenville, SC \r\nRyan Milo Killough Seneca, SC Lynn Elizabeth Yates Rochester, NY \r\nWesley James Melvin Winnsboro, SC **Tiffany Gretchen Zimmermann ____ Wilbraham, MA \r\nErin Elizabeth Raynor Fort Mill, SC \r\nPlant Pathology \r\nLynn A. Luszcz _______ West Yarmouth, MA \r\nPre·professional Studies \r\nG. W. Allen~~----------,--- Easley, SC Benjamin Gerald Steifle------- Spartanburg, SC \r\n*Tiffany Ann Drake Simpsonville, SC *Bryan Kendall Thomas Greenville, SC \r\nTurfgrass \r\nIan Wesley Daniels ----------,,...,.-Groton, NY Harry Franklin Morgan lll ________ Six Mile, SC \r\nBrian Patrick Dossett Edisto Island, SC \r\nWildlife and Fisheries Biology \r\nVirginia Johnson Bailey ________ Mt Pleasant, SC Daniel Van Madray _~ ________ Hanahan, SC \r\nMatthew James Brown Anderson, SC Clary Alana Price Powell Columbia, SC \r\nThomas Mark Dowtin McCormick, SC William George Sarvis lll Conway, SC \r\n**Chad Russell Grant Seneca, SC Brad Scott Warson Eden, NY \r\nJames Bradley Lane Marion, SC Ryan Matthew Wenzel Ridgeville, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nJANICE CERVELLI SCHACH, Dean \r\nBACHELOR OF FINE ARTS \r\n*Angela Marie Chvarak -------Myrtle Beach, SC *Rebecca Lynn Strickland ______ Goose Creek, SC \r\n*Benjamin Donald Greene Inman, SC Anne Catherine Wyrsch Glenview, IL \r\nRebecca Anne Leidy New York, NY \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\n***Amanda lone Allen __________ Latta, SC *David Allen Krantz--------- Columbia, SC \r\nMichael Robert Anaya Erie, PA *Morgen Leaf Neagle Bonnieville, KY \r\nCorey Jackson Clark Leesville, SC Richard David Rudnicki Conway, SC \r\n*Elizabeth Dixon Fulghum Jacksonville, FL Thomas M. Spong, Jr. Columbia, SC \r\nRalph Joseph Giangrandi lll Columbia, SC \r\nBACHELOR OF ARTS \r\nArchitecture \r\nLynda Renee Alexander _______ Timmonsville, SC Andrew Lawrence King ________ Nashville, TN \r\nAdam Jonathan Berry Lexington, SC Brendon Monte McCall Barnesville, GA \r\nJohn Nicholas Dimling Spartanburg, SC Robert William Price, Jr. Cowpens, SC \r\nBrandon T rawn Kelly Heath Springs, SC Kenneth Blake Wright Greenville, SC \r\nCommunication Studies Connelly Anne Bartle _________ Rock Hill, SC Jennifer Lynn Pettit _________ Simpsonville, SC \r\nEllen Rita DuBois Bennettsville, SC **Elise Renaudec Clemson, SC \r\nElizabeth Lea Edwards Decatur, GA Brandon Lee Rhodes Simpsonville, SC \r\nJohn Thomas Flowers Irmo, SC Vicki Wilson Rhodes Atlanta, GA \r\nJames Livingston Gilbert Hopkins, SC Crystal Aliese Richburg Columbia, SC \r\n*Julie Louise Greene High Point, NC Christopher A Rinebold Irmo, SC \r\n**Nicole Leeanne Grubbs Seneca, SC Jeannie Allison Roper Fort Mill, SC \r\nElizabeth Veronica Harper London, England Alexis C. Smith Charleston, SC \r\nMiriam Elizabeth Henderson Greenwood, SC Laura Elise Sparks Pickens, SC \r\nSuzanne Elaine Herron Charleston, SC Bridget Elizabeth Thompson Lilburn, GA \r\nMaria Lynn Hoffman Greer, SC Ashley Katrice Washington Columbia, SC \r\nChristopher Dexter Mapp, Jr. Wedgefield, SC Jami Harrison Williamson Goose Creek, SC \r\nJose Ivan Martinez Napa, CA Jenifer Yeadon Williamson Goose Creek, SC \r\n*Heather Lynn Monaghan Greenville, SC Patrick Francis Wolak Clemson, SC \r\n**Elizabeth Claire Mulvaney Roanoke, VA *Candice P. Woodward McLean, VA \r\nMegan Nalani Perry Conway, SC \r\nEnglish \r\nBradley Wayne Barnett ________ Anchorage, KY *Melody Gail Fowler __________ Florence, SC \r\nMegan Noel Boyce Baltimore, MD Derek Alan Haller Burke, VA \r\nAlden Lee Burley Virginia Beach, VA t***Jenna Loraine Hamilton Rock Hill, SC \r\nWilliam Richard Cathcart, Jr. Charleston, SC *Christy Diane Hardegree Birmingham, AL \r\nElizabeth Louise Depasquale Newton, MA Walter Justin Aliga Jones Clemson, SC \r\n*Dana Lee Dodds Greenville, SC Julie Ann Major Knoxville, TN \r\n13 "
    },
    {
        "page_number": "22",
        "text": "English (continued) \r\nCatherine Pollard Mann _________ Searcy, AR Brittany Lauren Triplett _________ Bristol, VA \r\nCole Michael Stamm Greenville, SC Jessica Lee Whittaker Piedmont, SC \r\nHistory \r\nHunter Christopher Blouin _______ Greenville, SC Daniel Forrest McMillan ________ _,Lilbum, GA \r\nNickolas Andrew Dalton Rockville, VA Jonathan Dexter Polson Columbia, SC \r\nJohn Francis Dunn Baltimore, MD Brian Dorral Porterfield Swansea, SC \r\nRobert Weston Frisina Elgin, SC t••Daniel Attridge Seibert Midlothian, VA \r\nStephen Jacob Gantt Winnsboro, SC ••Allison Lynn Spangler Greenville, SC \r\nAndrew Scott Gordon Smithfield, VA t*Diana Kay Ulrey Tulsa. OK \r\nFrank Trent Hill Ill Hartsville, SC Geoffrey Lawrence Wendt Seneca, SC \r\nCharles Marshall Ivey IV Greensboro, NC Melodie Skye Wilkerson Fair Play, SC \r\nt•Lindsey Nicole McClain Greenwood, SC Timothy Zane Yarborough Anderson, SC \r\nLanguage and International Trade \r\nJason Kouri Jenkins ---------Charleston, SC Laura Alexandra Ramsey ________ Centreville, VA \r\nMary Estelle Jordan Seneca. SC •Joshua Hugh Umbarger Wedgefield, SC \r\nLudmila Nicoleta Neagu Bistrita, Romania Melissa Ann Vance Lawrenceville, GA \r\nt••William Henry Pouch Ill Greenville, SC Cedric Shaun Zimmer Simpsonville, SC \r\nModern Languages \r\nCaroline Ruth Brown __________ Gaffney, SC Sarah E. Vogus ____________ McHenry, IL \r\nt•••Stacey l.<:>uise Kelly Gilbert, SC \r\nPhilosophy \r\n•••Kathryn Lindsay Russell _______ Yorktown, VA •••William Alan Spink------- Germantown, TN \r\nProduction Studies in Performing Arts \r\nRiggie Claydale Smith, Jr. Greenville, SC \r\nDOUBLE MAJOR \r\nCommunication Studies and History \r\nRichard Conrad Davis Inman Columbia, SC \r\nCommunication Studies and Spanish \r\n*Jaletta Renee Lon.,_ __________ Dacula, GA Alice Anne Murr __________ Arlington, TX \r\nGerman and Language and International Trade \r\nJohn Oliver Havird Piedmont, SC \r\nHistory and Secondary Education \r\nt**Darcy Anne Robards Coover ___ Mt Pleasant, SC \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nAaron Christopher Lewis -------- Oxford, NY William Graham Reynolds-------- Aiken, SC \r\nDonald Laroache Lloyd, Jr. West Columbia, SC John Andrew Villeponteaux Moncks Comer, SC \r\nTravis McNeill Martin Laurens, SC Ryan Tyler White Walterboro, SC \r\n*Christopher David McCall Laurens, SC \r\nDesign \r\nAnthony P. Wohlers ________ Chapin, SC \r\nCOLLEGE OF BUSINESS AND BEHAVIORAL SCIENCE \r\nBRUCE YANDLE, Interim Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nLucas Marc Cyr ___________ Lexington, SC Charles Elwin Moore, Jr. ________ Greenville, SC \r\nRichard I. Horton, Jr. Columbia, SC \r\nPolitical Science \r\nConnelly Anne Bartle _________ Rock Hill, SC Richard Francis Jordan ----------Pelion, SC \r\nWilliam DeMont Boylston Seneca, SC Misty Phillips Nicholson Greenville, SC \r\nThomas Jefferson Brunson 111 Lexington, SC Brandi Alexis Richardson Lancaster, SC \r\nDavid Joseph Fetko Lexington, KY *Nathaniel Bruce Senn Ill Laurens, SC \r\nCharles Marshall Ivey IV Greensboro, NC \r\nPsychology \r\nt•••Jessica Lynn Allen _______ -cc-- Easley, SC t**Christina Lynne Morrison ________ Austin, TX \r\n*Lindsey Anne Avery Simpsonville, SC **Melanie Elizabeth Odom Chester, SC \r\nRyan Andrew Bowers Summerville, SC Daniel James Park Knoxville, TN \r\nHeacher Ann Bowman Spartanburg, SC Kachryn Long Rainero Bristol, VA \r\nAnne Brislin Eiserhardt Charleston, SC Allison Teresa Roden Milford, OH \r\nChloe P. Green Murrell's Inlet, SC Spencer Joseph Tirschek Wyoming, OH \r\nBrett Douglas Jolly Rock Hill, SC \r\n14 "
    },
    {
        "page_number": "23",
        "text": "Sociology \r\nMichael James Collins ________ Commerce, GA Cameron Christine Siler _ ______ ~Gree ille, SC \r\n*Ashley Jayne Jordan Bishopville, SC John Rogers Starr Spartanburg, SC \r\n**Thomas Blaine Pleming Columbia, SC Helena Renee Streater Easley, SC \r\nAbigail Ryan Potts Oak Hill, VA Michael Patrick Thompson Conway, SC \r\nAshley Eileen Rex Myrtle Beach, SC Carrie Nicole Walker Piedmont, SC \r\nKhaili Lynene Sanders Evanston, IL \r\nDOUBLE MAJOR \r\nPsychology and Spanish Heidi Candee Hoff _________ Glencoe, IL \r\nBACHELOR OF SCIENCE \r\nAccounting \r\nWilliam Arnold Clarke, Jr. _______ Lexington, SC Joseph Rashan Lester ________ Myrtle Beach, SC \r\nPhilip Alexander Clayton, Jr. Conway, SC Greggory Cole Mendes Marstons Mills, MA \r\nYvonne Marie Pascuzzi Crites Liberty, SC Lawrence John Oufiero Fairfax Station, VA \r\nMatthew Clark Dennis Taylors, SC *Arthur Richard Petzel llJ Doylestown, PA \r\nMarley Ryan Dominguez Alexandria, VA *Amanda Lynn Propst Columbia, SC \r\nChristopher Marvin Dyches Barnwell, SC Charlee Michelle Robinson Charlotte, NC \r\nt***Charles Bradley Eason Greenville, SC **Daniel Angelo Smith Lawrenceville, GA \r\nHuntington James Elliott Miami, FL Christopher Joseph Spisak Bennettsville, SC \r\nCale J. Husted Baldwin, GA Lindsey Ellen Templeton York, SC \r\nJimmy Oneal Kirby, Jr. Easley, SC Clifton Allan Ward Gray Court, SC \r\nWilliam Charles Koll IV Moncks Corner, SC Allison Marie Wiles Easley, SC \r\nEconomics \r\nAmber Lee Alexander _________ Whitmire, SC Robert Allen Preston __________ Jackson, SC \r\nJeffrey Vincent Butler Burke, VA **Franco L. Repetco Lima, Peru \r\nMatthew Joseph Crawford Abbeville, SC Mark Trent Repokis C lemson, SC \r\nJeffrey Charles Geiger Auburn, ME Cayce Joyce Richter Simpsonville, SC \r\nAdrian Bentley Hankins Jonesborough, TN t***Margie Elizabeth Sharpe Myrtle Beach, SC \r\n*Matthew Joseph Jones Anderson, SC Jason Robert Smith Gaithersburg, MD \r\nNisha Kumari Prasad Columbia, SC \r\nFinancial Management \r\n*Malissa Lyne Baker _________ Rock Hill, SC Henry Kelly Kneece _________ Spartanburg, SC \r\nChristopher Lee Boland Atlanta, GA Kelly Marie McCarty Simpsonville, SC \r\nSteven Campbell Dickson Aiken, SC *Rhett Wilton Mitchell IIJ Hartsville, SC \r\nCharles Edward Ducworth Anderson, SC Stephen Alan Moss Greer, SC \r\nKenneth Leon Elam North Augusta, SC Marshall Pickens Murphy Anderson, SC \r\nSteven Wayne Ford Lilburn, GA Ray Allen Owens, Jr. Greenville, SC \r\nRobin Moore Garren Fountain Inn, SC Jessica Catherine Peacock Mt Pleasant, SC \r\nWilliam Travis Harper Columbia, SC William Paul Pitts Orangeburg, SC \r\n*Laura Howard Haselden C lover, SC *Charles Alton Roberts, Jr. Lawrenceville, GA \r\nAdam Roger Haskett Easley, SC Brett Rahner Rogers Belvedere, SC \r\nJohn Phillip Hewett Mt Pleasant, SC **Andrew Clayton Seymore Easley, SC \r\nNathaniel David Hookman Knoxville, TN Scott Edward Shackouls Houston, TX \r\nJason Lawrence Hoot Alpharetta, GA Ryan Neil Smithson Columbia, SC \r\nThomas Dodd Hulsey Round 0, SC Jonathan Bridgforth Tarver Startex, SC \r\nKendra Nicole James Columbia, SC Patrick Carter Thomasson Fort Mill, SC \r\nGraphic Communications \r\nLaura J. Allen _ ___________ Anderson, SC Lindsay Blair Hunnicutt _______ Simpsonville, SC \r\nJonathan A. Beavers Landisville, PA **Katie Renee Hyman Conway, SC \r\nBrevard Boykin Bell, Jr. Camden, SC Adrienne Monique Jamison Vance, SC \r\nKimberly Jean Bierie Acworth, GA Leigh Anna Kluttz Charlotte, NC \r\nSarah Nell Boyce Aiken, SC Julie Kathleen McKellar Hartsville, SC \r\nVictoria Anne Causey Mc Pleasant, SC Jennifer Cole Money Hartsville, SC \r\nJared Peter Chamberlain Atlanta, GA Catherine Leigh Nelson Greer, SC \r\nt**Rebecca Ann Copelan Columbia, SC James Renwick Odum Aiken, SC \r\nCraig Edward Crosby Greenville, SC *Rebecca Lynne Park Hilton Head Island, SC \r\nAllison Grace Davis Lexington, SC William Daniel Scales Greenville, SC \r\nJenny-Lee Dennis Dalzell, SC *Ashley Ann Schuermann Mt Pleasant, SC \r\nTara Lindsey Duggan Burke, VA Rebecca Leigh Shulick Richmond, VA \r\nClair Marieke Farrell New Orleans, LA ••Andrew Blakeney Smith Hartsville, SC \r\nJanice Elizabeth Gillespie Orangeburg, SC Leila Nan Transou Gaffney, SC \r\nJanie Nicole Gossett Simpsonville, SC Brian Stephen Walker Anderson, SC \r\n*Ashley Brooke Harris Columbia, SC *Sarah M. Whitten Florence, SC \r\nAdam Michael Hodgden Simpsonville, SC \r\nIndustrial Management \r\nMcmhew Thom::is Daniel Alpharetta, GA Dustin Michael Vickery -------- Anderson, SC \r\nLawrence William H::ilpin,G::irmley ____ Bartlesville, OK Linda Le Yu Pendleton, SC \r\nJohn Daniel Seay Greer, SC \r\n15 "
    },
    {
        "page_number": "24",
        "text": "Management \r\nLee Joseph Ables~---------..,, Charleston, SC Allston Bochet Lebnd, Jr. ______ McClelbnville, SC \r\nDavid Michael Baker Simpsonville, SC Jason Cain Long Anderson, SC \r\nGeorge Daniel Bates Vienna, VA **Sean Michael McColgan Holland, PA \r\nChad Justin Bay Seneca, SC Charles Taylor Mimms Bishopville, SC \r\nChelsea Olivia Brashear North Augusta, SC Abbie Leigh Murdock Gastonia, NC \r\n*Kristine Branham Britt Blythewood, SC Matthew John Murphy Virginia Beach, VA \r\nScott Allen Bunn Findlay, OH Richard Smith Myrick Ill Atlanta, GA \r\nMark Raymond Collingwood Newark, DE Rivers Nelson Plowden Hopkins, SC \r\nGraeme D. Crowe Easley, SC Timothy Owen Reynolds Seneca, SC \r\nCaroline Brooke Ehlers Hilton Head Island, SC Kenneth Matthew Ridings Seneca, SC \r\nRichard Aubyn Farthing III Summerville, SC Ashley Suzanne Robinson Simpsonville, SC \r\nJoseph Benjamin Fikes Fayetteville, TN Reed Henton Rogers Rock Hill, SC \r\nJames Michael Finnegan Latham, NY David Bryan Rood Anderson, SC \r\nJohn Calhoun Ford Lancaster, SC Brittany Kristin Rush Aiken, SC \r\nLori Kay Foxx Piedmont, SC Stuart Trent Shelby Seneca, SC \r\n*Cynthia Speer Freeman Greenville, SC Andrew F. Smith Taylors, SC \r\n*Bradley Lawrence Gibson Tipp City, OH Marcus Walton Stephens Toccoa, GA \r\nAdam William Goodson Sumter, SC Margaret A. Stewart Simpsonville, SC \r\nTravis Alan Gullickson Spartanburg, SC ***Laura Mitchell Taggart Reston, VA \r\nRobert Kyle Hammock Greer, SC Nathan Aleas Thompson Baltimore, MD \r\nJeremy Ryan Harrelson Johnsonville, SC Beau Evan Tornashitis Lexington, SC \r\nJudith Anne Haynes Taylors, SC Jason Anthony Toomer Fairfax, VA \r\nPeter Kang Hill Columbia, SC *Michael Reed Towery Six Mile, SC \r\nRichard Alan Holcombe Greenville, SC Christopher Patrick Tully Greenville, SC \r\nKelly Parker Holliday West Columbia, SC Silja Ulfarsdottir Hafnarfjordur, Iceland \r\nClay Harris Ingram Wagener, SC Jonathan Michael Walker Anderson, SC \r\nBrian Stuart Jetton Easley, SC Jacob Bryson Wasson Greer, SC \r\nBrian Faires Kennelly Charlotte, NC Cameron Wey Wenzel Snowmass Village, CO \r\nTyler Edward Larkins Greenwood, SC Neal Carson Willis Greenwood, SC \r\nMarketing \r\nKevin Matthew Barnes ________ Port Reading, NJ Michael David Johnson Spartanburg, SC \r\nSteven Douglas Burgin Lafayette, LA Jonathan Austin Jowers Rabun Gap, GA \r\nRichard Andrew Cacciato Pleasantville, NY Charles McClure King Easley, SC \r\nGray Muldrow Cartledge North Augusta, SC Joshua Louis Knoke Greenville, SC \r\nRebecca Lynne Copple Rock Hill, SC Alexander Maurice Koning ___ Oosthuizen, Netherlands \r\nEmily L. Daniel Charleston, SC *Stephen Brian Marshall Sagamore Beach, MA \r\n*Vivian Nicole Dover Fort Mill, SC *Jennifer Leigh McMeekin Irmo, SC \r\nAlicia Grace Dyar Myrtle Beach, SC Robin Victoria Mescher Berwyn, PA \r\n***Abigail Leigh Eaton Queen Anne, MD Nicholas Anthony Mross Sewickley, PA \r\nMichael R. Eckel, Jr. Bexley, OH Melvin Dean Nation, Jr. North Charleston, SC \r\nMichael Gregory Frees Charleston, SC **Sydney K. Olin Meggett, SC \r\nHillary Ann Gabiga Easley, SC Nathan L. Ollestad Kenmore, WA \r\nTimothy Patrick Gaffney Raleigh, NC Jennifer Nicole Redden Pomaria, SC \r\nMatt E. Glenn Greenville, SC Shaundra Ave Rodgers Columbia, SC \r\nEmily Ruth Gowdy Clemson, SC Ashley Brown Roe Charleston, SC \r\nAlexander Hunter Grewe West Union, SC Justin Kyle Scott Myrtle Beach, SC \r\n*Thomas Elliott Hackett Woodstock, CT Stephen John Slingerland ___ Smith Mountain Lake, VA \r\nJessica Dalton Hall Annandale, VA Chelsea Elise Stewart Goose Creek, SC \r\nNicholas Stephen Honko, Jr. Fort Mill, SC **Elizabeth Barton Thome Columbia, SC \r\nRobert Glenn Hopkins, Jr. Clemson, SC ***Elizabeth McKelvey Tiencken ___ Daniel Island, SC \r\nDaniel Edward Hurst Spartanburg, SC Christopher J. Zambataro Brecksville, OH \r\nPolitical Science \r\nJoshua Spencer Thomas Ayers ______ Camden, SC *Megan Elizabeth Mersch----------,-., Edgewood, KY \r\nZachary William Bunker Laconia, NH Karli Lynn Reviello Hillsborough, NJ \r\n***Sarah Elise Deibler Yorktown, VA Jason Andrew Rogers Greenville, SC \r\nt**Lindsay Nicole Green~Barber Laconia, NH **Rebekah Kathleen Stroman Lexington, SC \r\nPsychology \r\nNathaniel D. Couch _________ Greenville, SC ***Kristen Lee McCrary __________ Greer, SC \r\nDavid Glenn Dooley Starr, SC *Samuel Craig Owen Branford, CT \r\nTyler Grant Eppes Palm Coast, FL Quesler Payoute Fort Lauderdale, FL \r\nSamuel Arthur Fuller Rock Hill, SC Felecia Renea Roberts Fayetteville, NC \r\nMary Glenn Keadle Clinton, SC Jonathan Paul Ross Greenville, SC \r\n*Sarah Marie Kennedy Douglasville, GA Amy Mary Scheck Manchester, VT \r\nBridget Renee Kinard Allendale, SC Brett Mitchell Venable Shreveport, LA \r\nRachel Elizabeth Lippard Irmo, SC t***Erin Marie Yount Lilburn, GA \r\nSociology \r\nt*Leroy Leon Cooper ________ Johnsonville, SC Amy Laura Hawkins __________ Belton, SC \r\nJason Michael Goldstein Williamstown, NJ Christy Marie Mills Greer, SC \r\n16 "
    },
    {
        "page_number": "25",
        "text": "COLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINATH, Dean \r\nBACHELOR OF ARTS \r\nChemistry \r\nCaitlin Michelle Andrus ________ Lexingcon, SC Michelle Manongdo Oakes ________ Madison, AL \r\nComputer Science \r\nKivi Diaz Dennis ______ ___ Calhoun Falls, SC Robert Allen Sweatman --------Cordova, SC \r\nGregory Bryan H\"'ris Gaffney, SC \r\nGeology \r\nGarrett Pierce Reed Spartanburg, SC \r\nMathematical Sciences \r\nJamario Donelle Twitty Greenville, SC \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering \r\n(Biosystems Engineering is jointly administered by the College of Agriculture, Forestry, and Life Sciences \r\nand the College of Engineering and Science.) \r\nt***Jocl Matthew Anderson ______ Anderson, SC *Carl Sylvester McGill-------- Spartanburg, SC \r\nBenjamin Windsor Harrison Richmond, VA Melissa Diane McKinney Waldorf, MD \r\nHunter McDonald Hicks IV Roswell, GA Courtney Danielle Smith Westminster, SC \r\nPaul Timothy Maddux Aiken, SC Kendra T. Smith Charleston, SC \r\nChristopher Shawn McAlhany Lexington, SC Kimberly Lynn Smith Charleston, SC \r\nCeramic and Materials Engineering \r\nRita Maria Sanders Sullivan's Island, SC \r\nChemical Engineering \r\nRodney Walcer Curvin ________ Cleveland, TN John Douglas Moffitt __________ Ashland, VA \r\nAlexis Patrice Major Mt Pleasant, SC \r\nChemistry \r\nJessica Elizabeth Morgan De lulio. ______ Fort Mill, SC Caryn Danielle Marmillion _________ lrmo, SC \r\nCivil Engineering \r\nSara A. Adamson ___________ Houston, TX Michael James Kutcher __________ Milford, NJ \r\nKelley Bryan Allison Mooresville, NC *Benjamin James Linyard Statesville, NC \r\nJonathan Smith Atkins Honea Path, SC Brian Mitchell Logan Cottageville, SC \r\nTroy Robert Berkland Irmo, SC Scott Christopher Markley Stone Mountain, GA \r\nt*David Alan Bernard Charlotte, NC **Kyle Milledge Moody Walterboro, SC \r\n*Diana J. Bowers Aiken, SC Eric O'neil Morris Johnsonville, SC \r\nBradley Joseph Boyd Hanahan, SC Martha Reagan Moseley Mt Pleasant, SC \r\nWilliam Tarrant Buchanan Aiken, SC Michael Leonard Mullen, Jr. Stone Mountain, GA \r\nBrian Matthew Curry Rock Hill, SC Sean Patrick Neary Ringoes, NJ \r\nAdam Anthony Dalessandro North Charleston, SC Lisa Nicole Newton Monument, CO \r\nChris James Davis Murfreesboro, TN Jennifer Lynn Oswalt Batesburg, SC \r\nPhillip Paul Dieckmann Lexington, SC Jody Catherine Petit Hollywood, SC \r\nZachery Burris Dukes Johnsonville, SC Kevin M. Phelan Summerville, SC \r\n*Edwin Wilson Edmondson, Jr. Seneca, SC Christopher Michael Porter Columbia, SC \r\n*Lauren Grace Elrod Libertyville, IL John Joseph Ramsey Hickory Grove, SC \r\nWilliam Felder Evans Orangeburg, SC Cy le Joseph Rhoades Hemingway, SC \r\nLarry Tripp Ford Piedmont, SC **James Adam Rich Donalds, SC \r\nMarco Julian Friend Bethlehem, PA Christopher john Rowe Newtown, CT \r\nStephen Brooke Furr Lakeland, FL t***Hudson Davis Shelby Pinehurst, NC \r\nChad Lee Gilbert Blythewood, SC Jonathan Edward Thompson Easley, SC \r\nBrian Lee Green Anderson, SC Nicholas Wayne Wegener Charleston, SC \r\nClay Daniel Greene Anderson, SC Carla Renee White Awendaw, SC \r\n*Brian Grey Johnson West Columbia, SC Jason Alexander White Conway, SC \r\nWilliam Dinkins Kannon Sumter, SC David Wayne Wingard Hartsville, SC \r\nRobert Alan Keidel Concord, NC \r\nComputer Engineering \r\n***Shiran Algai _____________ Greer, SC Brandon Alan Nesbitt _________ Florence, SC \r\nKristopher Ryan Fogle Lodge, SC Bao Quoc Nguyen Myrtle Beach, SC \r\n***Crystal Alicia Jackson Swansea, SC William Douglas Starnes Salley, SC \r\n*Amit Jain New Delhi, India t**William Charles Suski II Hartsville, SC \r\nt***Scott Christopher Kempf Amherst, NH *Stephen Richard Terleski Philadelphia, PA \r\nKarl Lindekugel IV Tyler, TX Nicholas Michael Yanutola Tega Cay, SC \r\nTega Ray McKinney Sumter, SC *Weiri Zheng Rock Hill, SC \r\nMichael Louis Mims Greenville, SC \r\nComputer Information Systems \r\nThomas Joseph Klich _________ Ridgeville, SC Adam David Patten ________ Georgetown, MA \r\nJames R. Lutz Chester Springs, PA Robert Joseph Walter Bamberg, SC \r\nRollie Noel Ostrander Simpsonville, SC Latoya Bettrice Woodberry Johnsonville, SC \r\n17 "
    },
    {
        "page_number": "26",
        "text": "Computer Sdence \r\nBrian Perry Caines __________ Greenville, SC Ian Burton Hollenbaugh _______ Georgetown, SC \r\nt•Harry Cho Cantey Aiken, SC John Gregory Lewis, Jr. Pickens, SC \r\n(Degree awarded posthumously) Yong Rong Na Enoree, SC \r\nAnthony John Cerqueira II Anderson, SC Jason Eric Stephens Anderson, SC \r\nDerek Michael Cook Greenwood, SC Richard Arthur Swails Andrews, SC \r\nEdward David Delulio Clemson, SC Matthew C. Townsend Hartsville, SC \r\n*John Lawrence Fisher Charleston, SC Brad Michael Warneck Manalapan, NJ Patrick Curtis Hoffman _________ Clemson, SC \r\nElectrical Engineering \r\nTroy Wayne Andrews _____ ~~~Westminster, SC Andreas Knibbe_~--------- Anderson, SC \r\n**Brandon Larry Ashley Batesburg-Leesville, SC Martha Julianne Kwoka Johnson City, TN \r\nThomas C. Beaumel Clemson, SC t*Ryan Patrick Longshore Prosperity, SC \r\nVirat Bishnoi Clemson, SC Patrick Matthew McCurdy Lexington, SC \r\nDean Elliott Chanter Vesuvius, VA Alexander McKay III Dillon, SC \r\nLee Beacher Cole Enterprise, AL Bernard Alexander Norwood McColl, SC \r\nMarcus Kernel Collins Atlanta, GA Travis Alan Oswald Greenville, SC \r\nWilliam C. Crosby Rock Hill, SC Tejal Tushar Patel Anderson, SC \r\n*Judson Michael Davis Neeses, SC Divya Rajpaul New Delhi, India \r\n*Christopher Thomas Dunkel Rockford, IL Lionel Jarod Richardson Huger, SC \r\nRichard Michael Fortner Anderson, SC Ronnie Jerome Rickman Pendleton, SC \r\nAaron Bradley Gibbs Summerville, SC Kendra Vandre II Settles Ward, SC \r\nLloyd Dean Gibson Easley, SC **Huy Hoang Tran Rock Hill, SC \r\n*Steven Alexander Grey Castle Rock, CO Van Cao Vu Spartanburg, SC \r\nt•••Vernon Hart Guthrie, Jr. Knoxville, TN Leigha Nachelle Wilson Cincinnati, OH \r\n*Melisse Joy Henry North Charleston, SC Belinda Galloway Windley Manning, SC \r\nEdward George Hoy Watertown, WI Pankaj Yadav Gurgaon, India \r\n*Peter John Jacobsen Edneyville, NC \r\nIndustrial Engineering \r\nKrystal Meredith Banner ________ Beaufort, SC **Colin Neil Mclachlan, Jr. _____ Milledgeville, GA \r\nRicky Anthony Bussey Edgefield, SC Joseph Michael Meaders Greenwood, SC \r\nDaryl Edward Conyers Andrews, SC Jeffrey Lewis Montoney Greer, SC \r\nRiley Stedtman Croft Mt Pleasant, SC John Kenneth Nickels Richmond, VA \r\nJanna Paige Frasher Greenville, SC *Jonathan Edward Nolan Darlington, SC \r\n**Austin Lee Graham Mt Pleasant, SC Jacob Reid Prevost Folly Beach, SC \r\nChristopher Daniel Hardee Surfside Beach, SC James Jeffery Robertson II Greenwood, SC \r\nKevin Scott Hovis Dallas, NC Andrea Calnen Robillard West Springfield, MA \r\nCass Farley Jackson Columbia, SC Jeremy Robert Shamroe Atlanta, GA \r\n*Michael Bernard McDonald IV Waverly, PA Nigel Shepherd Anderson, SC \r\nMark Haden McElreath Clemson, SC *Melissa I. Zelaya Tegucigalpa, Honduras \r\n***Kerry Margaret McGuire Knoxville, TN \r\nMathematical Sciences \r\nt*Joseph Francis Crea ________ Cincinnati, OH **Lori Denise Layne _________ Kingsport, TN \r\nt**Sarah Anne Ehinger Charleston, SC Christine Huong Le Clemson, SC \r\nElizabeth Emerson Rock Hill, SC Andrea Christian Shelton Fort Mill, SC \r\nMechanical Engineering \r\nHenry Bell Adams III ---------Columbia, SC Peter Judson Johnston __________ Dublin, OH \r\nDavid Joshua Aldridge Summerville, SC Sherrell Lamar Kemp Iva, SC \r\nJessica Force Aldridge Chapin, SC Julia Anne Klich Summerville, SC \r\nRobert Justin Archie Lancaster, SC ***Karen Sue Knight Greer, SC \r\nDonna Michelle Armocida Clemson, SC *Lida Paige Ledford Ooltewah, TN \r\nChristian Michael Astorino Mooresville, NC Jessica Ashley Lesniewski North Charleston, SC \r\nMatthew Alan Austin Greer, SC Brian M. Lloyd Fort Lauderdale, FL \r\nBenjamin Thomas Bowles Great Falls, SC John Christopher M. Lowery Knoxville, TN \r\nEdward A. Brake Dover, NH Casey Vaughan Manning Simpsonville, SC \r\nLauren Ashley Browne Moncks Comer, SC Michael John Marino Central, SC \r\nCharles Matthew Bullwinkel Columbia, SC John Worce Martin IV Camden, SC \r\nJames Bradley Chamberlain Greer, SC Patrick Matthew McCurdy Lexington, SC \r\nt**Zachary Ian Charlton Columbia, SC Leslie Wade McWhorter Easley, SC \r\n*Gregory Stephen Childers Greenville, SC Heath Erin Murphy Aiken, SC \r\nMatthew Leslie Clements Greer, SC Anthony Robert Niemczyk Langhorne, PA \r\nMatthew Grant Cooper Knoxville, TN Christopher Collin Noe Columbia, SC \r\n*Joel Michael Cowgill Columbus, OH t***Marisa Kikendall Orr Ocoee, FL \r\nt***Jarnes Alexius Cronin IV Greer, SC Dustin Michael Parsons Summerville, SC \r\nAdam Sheffield Eckard Charleston, SC William Ruffin Paul ling Rome, GA \r\nJames Daniel Edwards Clinton, SC John Raymond Pesavento Folly Beach, SC \r\nDustin Alec Evans Cowpens, SC *Benjamin Nathan Poole Easley, SC \r\nAdam Wilford French Greenville, SC Horacio Benito Repetto III Lima, Peru \r\nDaniel Naaman Gause Florence, SC Gregory S. Schiefer Hickory, NC \r\n**Robert William Gregg Blythewood, SC Megan Amber Schnurr Yan Meter, LA \r\nMatthew Ryan Haines Aiken, SC *Jayson Carl Shelley Columbia, SC \r\nBenjamin Howard Ham Camden, SC Mitch Harry Sill Spartanburg, SC \r\nCcsareo Alberto Hinojos Duncan, SC Jason Hazen Stairs South Windsor, CT \r\nAmy L. Johnson Stuart, FL John Derek Stellwagen Six Mile, SC \r\n18 "
    },
    {
        "page_number": "27",
        "text": "Mechanical Engineering (continued) \r\nKirkland Buist Stiling ~------~-Pinopolis, SC Matthew Thomas Truett _____ ~-~_Conw;ly, SC \r\n*Scott Albert Sutherland Murrell's Inlet, SC Sandra Christine Twilley Chevy Chase View, MD \r\nt**Jonathan Davis Taylor Greer, SC Eugeni Ivanov Tzvetkov Greenville, SC \r\nDavid William Topham Midlothian, VA Carson Benjamin Young Aiken, SC \r\n*Neil D. Travis Atlanta, GA \r\nPhysics \r\nAlicia Marie Bennett Borja _____ Kings Mountain, NC James Travis Haselden ________ Darlington, SC \r\nMatthew Greg Craps Lexington, SC t**Jonathan Davis Taylor Greer, SC \r\nCarole Ann Harper Lugoff, SC \r\nPolymer and Textile Chemistry \r\nTiffani Nicole Johnson Orangeburg, SC \r\nPre~professional Studies \r\n**Christopher Michael Cutshall ----- Aiken, SC \r\nTextile Management \r\nJoseph Parrish Moore __________ Inman, SC Brandon Thomas Ray Trapp _______ Fort Mill, SC \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nLAWRENCE ROBERT ALLEN, Dean \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\nKatharine Rebecca Bradford ______ Alpharetta, GA **Harriet Elvira Spires _________ Edgefield, SC \r\n*Elizabeth Anne Darley Pendleton, SC Meghan Beth Thalman Sumter, SC \r\n*Alexandra C. Filer Windsor, VA Ashley Elaine Welton Clemson, SC \r\nMary Kathryn Herlong Johnston, SC John Robert Wiggins Marion, SC \r\n*Brooke Alanna Hewett Fountain Inn, SC *Meredith Anne Williams Columbia, SC \r\nElementary Education \r\nCarolyn Amanda Babb __________ Moore, SC Brian K. Mance ____________ Alcolu, SC \r\n*Emily Jo Babb Gray Court, SC Allison Ruth Minus Summerville, SC \r\nDebra Adele Crews Lexingtion, SC Paige Nichole Mitchell Clemson, SC \r\n*Anna Elizabeth Crowley Simpsonville, SC Marisa A. Mixon Fort Mill, SC \r\n***Jenifer Elizabeth DeHarr Aiken, SC Jordan Brent Moore Lewes, DE \r\nNikki Marie Durham Westminster, SC Jenna Land Powell Seneca, SC \r\n*Mary Beth Durst Durham, NC ***Brian Andrew Rodgers Central, SC \r\nShannon Colleen Finnegan Lawrenceville, GA **Carla Michelle Rogers Liberty, SC \r\nBenjamin Thomas Fowler Columbia, SC Laura Ann Rukat West Union, SC \r\nAbigail Ann Griffin Greenville, SC Theresa Marie Sanfilippo Greer, SC \r\nJoslyn Heather Heidrich Atlanta, GA *Sesha Mekel Srinivas Charleston, SC \r\nKristin Elizabeth Horvath Greer, SC **Shuntay Stover Heath Springs, SC \r\n***Matthew John Irwin Greer, SC Natalie Michelle Sweeney Mauldin, SC \r\n*Jessica LaMay Jenkins Jefferson, SC **Karherine W. Walker Salem, VA \r\nAndrea Dawn Little Travelers Rest, SC Audrey Natasha White Columbia, SC \r\nSecondary Education \r\nLindsay Louise Bridges _________ Greenville, SC Philip Louis Roberts _________ Washington, GA \r\nDouglas Edward Hendrick Clinton, SC Alice Kaylan Shannon Chester, SC \r\nt***Stacey Louise Kelly Gilbert, SC *Eric John Shulick Naugatuck, CT \r\nJoseph Todd Mancuso Gaffney, SC *Teresa Christine Taylor Easley, SC \r\nDaniel Justin McG\\ohorn Pomaria, SC Crystal F. Urban West Union, SC \r\n**Jamie C. Mussman Greer, SC James Andrew Vandewege Salem, SC \r\nHeather Michelle Renzo Richland, SC Corey Michael Willimon Pickens, SC \r\nSpecial Education \r\nAbbie Lee Forbes _________ Greenville, SC \r\nDOUBLE MAJOR \r\nSecondary Education and Spanish \r\nt***Karen Ashley Culpepper Suwanee, GA \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\nKala Redell Benson __________ Pendleton, SC Ryan Andrew Sidilau ______ Hilton Head Island, SC \r\nTiffany Michelle Canty Piedmont, SC **Lindsay Renae Sigmon Spartanburg, SC \r\nCaroline Andrea Carter Greenville, SC Dana Marie Walker West Union, SC \r\nJesica Daylene Cleveland Jackson, SC Kaylan Elizabeth Winston Goose Creek, SC \r\n*Jaime Lee Kearns Walhalla, SC Celita Michelle Wragg Georgetown, SC \r\nChelsie Ilene Maynard Olmsted Township, OH \r\n19 "
    },
    {
        "page_number": "28",
        "text": "Nursing \r\n*Rebecca Allen Anderson, SC t**Amanda Leigh Koch-------- Roswell, GA \r\n**Michelle Lee Amend Pendleton, SC ***Michelle Lee Walhalla, SC \r\nt*Lindsay Beth Baker Prospect, KY *LaSheika Denise Locke Simpsonville, SC \r\nJacqueline Antionete Beattie Seneca, SC Jessica LaShay Lowe Belton, SC \r\nTracy Elizabeth Briatico Aiken, SC Tiffany Renee McCray Florence, SC \r\nElizabeth Mallory Broadbent Rock Hill, SC Kristen Leigh Mitchell Boca Raton, FL \r\n*Kaitlin Elizabeth Cafferky Downingtown, PA Sadina Renae Moorer Cameron, SC \r\nJames Derrick Calvert Seneca, SC Laura Suzanne Pascal Valdese, NC \r\nSarah Renee Cannon Hendersonville, NC Brittney Lee Petty Greenville, SC \r\nTiffany Michelle Canty Piedmont, SC Darci Marie Rubin Clemson, SC \r\nElizabeth A. Cleavenger Edenton, NC Jessica Hixson Russell Summerville, SC \r\nKelly June Coombs Columbia, SC Sophia Jung Sewell Taegu, South Korea \r\nt*Jessica Lauren Dennis Toledo, OH Jennifer Simpson West Union, SC \r\nt**Melissa Anne Dodgen Irmo, SC •••Tamala C. Smith Walhalla, SC \r\nKate Lynne Downes Venice, FL ***Svetlana Vladimirovna Stukalova,Davis_~~-~-\r\nCharlotte Anne Grover Spartanburg, SC Rostov,Qn,Don, Russia \r\nJennifer Lauren Hergatt Summerville, SC Chantielle Jessica Thurman Central, SC \r\nAndrea Marie Hester Anderson, SC Rachel Marie Townes Conway, SC \r\nSarah Elizabeth Hodges Columbia, SC Jay Aaron Van Ooteghem Seneca, SC \r\nMeghan Elizabeth Grace Hutchinson __ Pawley's Island, SC ***Christopher M. Ward Monroe, NC \r\nCatherine Cecilia Jackson Anderson, SC Ahmon Rashad White Cross, SC \r\n***Elizabeth Colclough Jeffords Orangeburg, SC Jessica Howard White Gilbert, SC \r\nShauna Rae Jones Miami, FL Lillian Waring White Holly Hill, SC \r\nHaley Alice Karr Liberty, SC \r\nParks, Recreation, and Tourism Management \r\nChelsea Lynne Aldrich Camp Pendleton, CA **Michael Wayne Leroy _______ Indian Land, SC \r\nRonald Dean Amick, Jr. Lexington, SC Derek William Martin Aiken, SC \r\nBenjamin Franklin Boyter Waterloo, SC **Allison Parker Mathews Richmond, VA \r\nJoel Curtis Branham Winnsboro, SC *Ashley Brooks McCluney Gaffney, SC \r\n*Polly Elizabeth Burleson Jonesborough, TN Kate Marie McCrary Greer, SC \r\nRichard Corbin Byars Central, SC Philip R. McMurray Clinton, SC \r\nSarah Elizabeth Case Charleston, SC *Susan Ashley Morgan Gaffney, SC \r\nJames Michael Coleman Newberry, SC Eric G. Pancaro West Paterson, NJ \r\nJamie O'neal Cutter Cordova, SC Michael Jonathan Petrisko Largo, FL \r\nThomas Charles Dickinson ____ Olmsted Township, OH Christopher Michael Pirritano Camp Hill, PA \r\nMarquita Cheri Dortch Powder Springs, GA Bethany Anne Pominek Greensburg, PA \r\nDavid Allen Dunham Palmetto, FL *Kristen Mallory Procopio Allen Clemson, SC \r\nMandi Amina Elqadi Anderson, SC Ryan Casey Rushton Johnston, SC \r\n***Sean Matthew Flanagan Anderson, SC Lacey Alana Shafer Lakewood, CO \r\nJamaal Jay Fudge Jacksonville, FL Ernest C. Simpson 11 Iva, SC \r\nJamison Braden Gerhardt Lewisburg, WV **Brian James Soule Salisbury, MD \r\nDerrick Duane Gordon Greenville, SC *Sam Constantine Taras Memphis, TN \r\nRandi Joelle Hinton Baton Rouge, LA Matthew Jordan Vanname Taylors, SC \r\nCatherine Olmert Hipp Greer, SC *Cary Anne Welker Salters, SC \r\nLeonard Scott Kirby Aiken, SC Elizabeth Ann Williams Central, SC \r\nShelby Lauren Kluge North Augusta, SC Brian Ashley Wood Anderson, SC \r\nBradley Carl Leopard Pageland, SC \r\nScience Teaching \r\nAdam Kellington DeWitt ______ Clemson, SC \r\nTechnology and Human Resource Development \r\nCharles D. Bennett ---------- Camden, SC john Tye Heath Hill _________ St George, SC \r\n***Justin Thomas Bond Anderson, SC Andre,Luiz: Duarte Kuhner Central, SC \r\n*Mark Andrew Bonda Aiken, SC Steven Ray Lowe Robinson, IL \r\n**Reginald Tyron Bradley Seneca, SC *Sean Alan McCullough Anderson, SC \r\n**Carl Herbert Campbell Anderson, SC Roosevelt M. Nelson Rembert, SC \r\nClifford Eugene Harrell II Tallahassee, FL Trey Centell Tate Gaffney, SC \r\nKeri Dawn Hayes Easley, SC Reginald Lydell Wallace Columbia, SC \r\nPaul Andrew Hayes Clinton, SC *Kathryn Lynn Whitesel Seneca, SC \r\n*Cum laude: A grade point ratio of 3.40 to 3.69 \r\n••Magna cum laude: A grade point ratio of 3.70 to 3.89 \r\n•••Summa cum laude: A grade point ratio of 3.90 to 4.00 \r\ntCalhoun Honors College: The graduates so designated in the printed graduation program have completed an enriched program of study through the Calhoun Honors \r\nCollege. To earn this distinction, students must maintain an overall grade-point ratio of 3.40 or higher and complete the requirements of General Honors and/or \r\nDepartmental Honors. Students who have earned Departmental Honors appear in the line of march wearing the Calhoun Honors College Medallion on an orange \r\nand purple ribbon. This medallion is made possible by an endowment established by Mrs. Katherine Inabinet Vickery of Columbia, South Carolina, to honor the \r\nmemory of her husband and Clemson graduate, the late B. C. Inabinet. \r\nStudents wearing the white stoles over their gowns are graduating with a 3.00 or better grade-point average. Those who arc members of University recognized \r\nhonorary societies may have the names of those societies embroidered on one side of the stole with the University seal embroidered on the other side. \r\n20 "
    },
    {
        "page_number": "29",
        "text": "AWARDS \r\nTHE CLASS OF '39 A WARD FOR EXCELLENCE \r\nIn 1989 nn the OCC<lsion of the S01h Anniversary of its graduation from Clemson University (then the Clemson \r\nAgricultural College of South Carolina), the Class of 1939 established the Award for Excellence. It is prcsenreJ \r\nannually to a faculty member whose contributions over the imme<liaLdy preceding five~year period are judged by the \r\nfaculty member's peers to represent the highest achievement of service to the University and the Student Body. \r\nRECIPIENT OF THE CLASS OF '39 AW ARD FOR EXCELLENCE FOR 2005 \r\nBenjamin Lee Sill \r\nAlumni Distinguished Professor of Civil Engineering \r\nand \r\nDirector of rhe General Engineering Program \r\n1989 - Dixie Gooch Goswami \r\n1990 - Joel Vincent Brawley, Jr. \r\n1991 - John L. ldol,Jr. \r\n1992 - Raymond C. Turner \r\n1993 - Ashby B. Bodine II \r\n1994 - Cecil Oates Huey, Jr. \r\nPREVIOUS RECIPIENTS \r\nl 995 - Francis Anthony McGuire \r\n1996 - R. bwrcnce LaForge \r\n1997 - Chctlmcrs McNair Butler \r\n1998 - Larry Lee Bctucr \r\n1999 - Judith Mary Melcon \r\n2000 - Clifton Scott Miller Egan \r\n2001 - Jerry Alan Waldvogel \r\n2002 - Alfred P. (Hap) Wheeler \r\n2003 - Douglas Kinly Sturkie Ill \r\n2004 - Art Young \r\nFACULTY SCHOLARSHIP AWARD \r\nEstablished at Clemson University in 1959 1 this award is made annually by the faculty of Clemson University to the \r\nmember of the graduating class who has the highest scholastic achievement. All graduates who have completed the \r\nrequirements for the bachelor 1s degree since the last commencement exercise and who have completed at Clemson at \r\nleast 75 percent of the work required for graduation shall be eligible for consideration. \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AWARD FOR 2005 \r\nJessica Lynn Allen \r\nEasley, SC \r\nJenifer Elizabeth DeHarc \r\nAiken, SC \r\nVernon Hart Guthrie, Jr. \r\nKnoxville, TN \r\nMatthew John Irwin \r\nGreer, SC \r\nKristen Lee McCrary \r\nGreer, SC "
    },
    {
        "page_number": "30",
        "text": "HISTORICAL ST A TEMENT \r\nClemson University is named for Thomas Green Clemson ( 1807-1888), who \r\nleft the bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the \r\nRoyal School of Mines in Paris (1828-1832). His early profession was that of a \r\nmining engineer; however, circumstances diverted his interests into politics \r\nand the life of a southern planter, and he soon became an enthusiastic advocate \r\nof scientific agriculture. He had a career as a diplomat (charge d'affaires to \r\nBelgium, 1844-1852) and served as the first Superintendent of Agricultural \r\nAffairs in Washington (1860). As a scientist he published numerous articles in \r\nthe fields of mining, chemistry and agriculture. His varied activities included \r\nhis assistance in the founding of the Maryland Agricultural College, his support \r\nof the Morrill Act, his leadership in South Carolina after the Civil War, and \r\nhis part in founding Clemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as \r\na national shrine. \r\nThe academic program at Clemson College began in 1893 with an \r\nenrollment of 446. The first \"college prospectus\" announced only two four-year \r\ncurricula, supplemented by two two-year preparatory courses. Today the \r\nUniversity has six major academic units. These are the College of Agriculture, \r\nForestry, and Life Sciences, the College of Architecture, Arts, and Humanities, \r\nthe College of Business and Behavioral Science, the College of Engineering \r\nand Science, the College of Health, Education, and Human Development, and \r\nthe Graduate School. \r\nClemson University is accredited by the Commission on Colleges of the \r\nSouthern Association of Colleges and Schools (1866 Southern Lane, Decatur, \r\nGeorgia 30033-4097; telephone number 404-679-4501) to award the Bachelor's, \r\nMaster's, Education Specialist, and Doctor's degrees. Various curricula are \r\naccredited by the AACSB International (Association to Advance Collegiate \r\nSchools of Business), Accreditation Board for Engineering and Technology, \r\nAmerican Council for Construction Education, American Dietetic \r\nAssociation, American Society of Landscape Architects, Computing Science \r\nAccreditation Board, Council for Accreditation of Counseling and Related \r\nEducation Programs (CACREP), National Architectural Accrediting Board, \r\nNational Association of Schools of Art and Design, National Council for \r\nAccreditation of Teacher Education, National League for Nursing Accrediting \r\nCommission, NRPA/AALR Council on Accreditation, Planning Accreditation \r\nBoard, and Society of American Foresters. \r\nClemson is a land-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and \r\nat five agricultural experiment stations located in the State. The University is \r\nalso heavily committed to a varied program of public service, including the \r\nwork of agricultural extension which has professional personnel located in each \r\nof the State's counties. "
    },
    {
        "page_number": "31",
        "text": "CLEMSON ALMA MATER \r\nFarmer and McGarity/arr. Freeman \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of greater conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "32",
        "text": "Candidates appearing in this program are not certified graduates. Likewise, academic \r\nhonors designations are based upon performance prior to final grades. Both certification of \r\ngraduation and honors designations must come from the Registrar of the University. \r\n********** \r\nFirst Aid-A First Aid Station is located at the North entrance. \r\nEvacuation System-Littlejohn Coliseum is equipped with a fire alarm evacuation system. \r\nIn the event of activation, as noted by sustained horns and Strobe lights, please proceed to \r\nthe closest available exit. Remain outside the building until fire officials deem the building \r\nsafe to re-enter. \r\nNo Smoking-Smoking is prohibited in Littlejohn Coliseum. "
    }
]