[
    {
        "page_number": "1",
        "text": "Clemson University\r\nTigerPrints\r\nClemson Commencement Programs Academic Affairs\r\n5-1-2005\r\nClemson Commencement Program, May 2005\r\nClemson University\r\nFollow this and additional works at: https://tigerprints.clemson.edu/comm_programs\r\nMaterials in this collection may be protected by copyright law (Title 17, U.S. code). Use of these\r\nmaterials beyond the exceptions provided for in the Fair Use and Educational Use clauses of the U.S.\r\nCopyright Law may violate federal law.\r\nFor additional rights information, please contact Kirstin O'Keefe (kokeefe [at] clemson [dot] edu)\r\nFor additional information about the collections, please contact the Special Collections and Archives\r\nby phone at 864.656.3031 or via email at cuscl [at] clemson [dot] edu\r\nThis Article is brought to you for free and open access by the Academic Affairs at TigerPrints. It has been accepted for inclusion in Clemson\r\nCommencement Programs by an authorized administrator of TigerPrints. For more information, please contact kokeefe@clemson.edu.\r\nRecommended Citation\r\nUniversity, Clemson, \"Clemson Commencement Program, May 2005\" (2005). Clemson Commencement Programs. 222.\r\nhttps://tigerprints.clemson.edu/comm_programs/222"
    },
    {
        "page_number": "2",
        "text": "One Hundred Ninth Commencement \r\nMay 13, 2005 \r\nClemson, South Carolina "
    },
    {
        "page_number": "3",
        "text": "CEREMONIAL MUSIC \r\nDEPARTMENT OF PERFORMING ARTS \r\nPrelude \r\nClemson University Symphonic Band \r\nDr. Mark Spede, Conductor \r\nImpulse \r\nDr. Dan Rash, Director of Choral Activities \r\nDr. Christopher Mathews, Assistant Director of Choral Activities \r\nClemson University Symphonic Band \r\nGavorkna Fanfare - Jack Stamp \r\nImpulse \r\nCathedrals - Jay Clifford/arr. Jared Buchanan \r\nMr. Jones - Counting Crows/arr. Jared Buchanan and Ritchie Swiger \r\nClemson University Symphonic Band \r\nTwo Selections from Candide - Leonard Bernstein \r\n1. 'The Best of All Possible Worlds\" \r\n2. \"Glitter and Be Gay\" \r\nImpulse \r\nCan't Fix Grits - Shagtime/arr. Jeff Clinkscales \r\nYou Are - Lionel Ritchie/arr. Jeff Clinkscales \r\nClemson University Symphonic Band \r\nSnow Caps - Richard Saucedo \r\nImpulse \r\nOde to Clemson \r\nWords and Music by Hugh H. McGarity/arr. David A. Conley \r\nProcessional \r\nFlourish for Wind Band - Ralph Vaughn Williams \r\nPomp and Circumstance, Op. 39 - Edward Elgar \r\nNational Anthem - Words by Francis Scott Key/arr. Dan Rash \r\nMusical Interlude \r\nSevens - Samuel R. Haza \r\nClemson University Alma Mater \r\nMusic by Hugh H. McGarity and Robert Farmer \r\nWords by A. C. Corcoran/arr. Ed Freeman \r\nRecessional \r\nFlourish for Wind Band - Ralph Vaughn Williams \r\nTiger Rag - Original Dixieland Jazz Band/arr. Paul Yoder \r\nCongratulatory Applause \r\nYou are requested to refrain from loud expressions of pleasure for individual \r\ngraduates. Such expressions frequently detract from the recognition due the next \r\ngraduate in line. Your cooperation is respectfully requested. "
    },
    {
        "page_number": "4",
        "text": "9:30 A.M. \r\nGraduation \r\nFriday, May 13, 2005 \r\nLittlejohn Coliseum \r\nORDER OF CEREMONIES \r\n2:30 P.M. \r\n(Please remain standing for the processional, posting of colors, and invocation.) \r\nPosting of Colors \r\nClemson Tiger Platoon Color Guard \r\nThomas Duttweiler, Commander \r\nSara Barnett \r\nGary Brown \r\nSean Ferson \r\nNatalie Welch \r\nInvocation \r\nEric C. Lawhorn, Student Representative \r\nReggie Merriweather, Student Representative \r\nIntroduction of Trustees \r\nPresident James F. Barker \r\nConferring of Honorary Degree \r\nPresident James F. Barker \r\nReflections \r\nJohn A. Allison IV (A.M. ceremony) \r\nKyle L. McElveen (P.M. ceremony) \r\nRecognition of the Deans of the Colleges \r\nVice President for Academic Affairs and Provost \r\nDoris R. Helms \r\nConferring of Degrees and Delivery of Diplomas \r\nPresident James F. Barker \r\nRecognition and Presentation of Awards \r\nNorris Medal \r\nAlgernon Sydney Sullivan Award \r\nAlumni Master Teacher Award \r\nFaculty Scholarship Award \r\nSymphonic Band \r\nImpulse \r\nProfessor Michael Morris, University Marshal "
    },
    {
        "page_number": "5",
        "text": "BOARD OF TRUSTEES \r\nLeon J. Hendrix, Jr., Chairman __________ Kiawah Island \r\nJ. J. Britton, Vice Chairman Sumter \r\nBill L. Amick Batesburg-Leesville \r\nLawrence M. Gressette, Jr. Columbia \r\nThomas C. Lynch, Jr. Clemson \r\nLouis B. Lynn Columbia \r\nPatricia H. McAbee Greenwood \r\nLeslie G. McCraw Greenville \r\nE. Smyth McKissick III Greenville \r\nThomas B. McTeer, Jr. Columbia \r\nRobert L. Peeler Lexington \r\nWilliam C. Smith, Jr. Columbia \r\nJoseph D. Swann Greenville \r\nTrustees Emeriti \r\nLouis P. Batson, Jr. ________________ Greenville \r\nFletcher C. Derrick, Jr. Charleston \r\nW. G. DesChamps, Jr. Bishopville \r\nHarold D. Kingsmore Aiken \r\nPaul W. McAlister Laurens \r\nD. Leslie Tindal Pinewood \r\nAllen P. Wood Florence \r\nExecutive Secretary to the Board of Trustees \r\nChalmers Eugene Troutman III \r\nADMINISTRATIVE OFFICERS \r\nJames F. Barker __________________ President \r\nDoris R. Helms Vice President for Academic Affairs and Provost \r\nA. Neill Cameron, Jr. Vice President for Advancement \r\nSteven E. Copeland Interim Chief Business Officer \r\nAlmeda R. Jacks Vice President for Student Affairs \r\nJohn W. Kelly Vice President for Public Service and Agriculture \r\nLawrence Nichols II Chief Human Resources Officer \r\nTerry Don Phillips Director of Athletics \r\nChristian E. G. Przirembel Vice President for Research \r\nand Economic Development \r\nClayton D. Steadman _____________ General Counsel "
    },
    {
        "page_number": "6",
        "text": "HONORARY DEGREE \r\nJOHN A. ALLISON IV \r\nDOCTOR OF HUMANITIES \r\nJohn Allison has a head for business and a heart for humanity. The purpose that drives his \r\nlife's work and his life's passion is a genuine desire to make a better world for the people of \r\nthe South, the nation and beyond. \r\nAs chairman and chief executive officer of BB&T Corporation, Allison leads a financial \r\nenterprise that was born in the late 1800s out of love and distress over the state of the \r\npeople and the times. Notwithstanding the tremendous business success the $100+ billion \r\nfinancial-holding company has enjoyed under Allison, BB&T has never lost sight of its \r\nhumble beginnings or noble purpose. \r\nAllison began his service with BB&T in 1971 and has managed a wide variety of \r\nresponsibilities throughout the bank. He became president of BB&T in 1987 and was \r\nelected chairman and CEO in July 1989. \r\nA native of Charlotte, N.C., Allison is a Phi Beta Kappa graduate of the University of \r\nNorth Carolina at Chapel Hill, where he received a Bachelor of Science degree in \r\nbusiness administration (1971). He received his master's degree in management from Duke \r\nUniversity (1974 ). He is also a graduate of the Stonier Graduate School of Banking at \r\nRutgers University and received honorary doctoral degrees from East Carolina University \r\n(1995) and Mount Olive College (2002). \r\nService to his profession, education and community is a hallmark of Allison's life. He is a \r\nmember of the American Bankers Association and The Financial Services Roundtable. He \r\nserves on the Board of Trustees of Appalachian State University, the Wake Forest \r\nUniversity Baptist Medical Center Board of Visitors, and the Board of Visitors at the Fuqua \r\nSchool of Business at Duke University and the Kenan-Flagler Business School at UNC\u0002Chapel Hill. He also is a member of the boards of directors of The Financial Clearing \r\nHouse, Independent College Fund and the Global TransPark Foundation. \r\nAllison has long been a friend of Clemson. Most notably, he spearheaded a partnership \r\nbetween BB&T and the University that developed from a shared commitment to \r\nimproving the quality of education and the economic environment of the region. With a \r\n$1 million gift to Clemson's John E. Walker Department of Economics, the financial \r\ninstitution has established the BB&T Center for Economic Education and Policy Studies to \r\nhelp people better understand markets in practical and ethical terms. \r\nFor his longtime commitment to public service, Allison was recognized in 1998 with the \r\nEllis Island Medal of Honor. Officially sanctioned by both the U.S. Senate and the U.S. \r\nHouse of Representatives, the Ellis Island Medal of Honor ranks among this country's most \r\nprestigious awards. The award honors not only individuals but also the pluralism and \r\ndemocracy that have enabled our ancestry groups to maintain their identities while \r\nbecoming integral parts of the American way of life. The award epitomizes Allison's deep \r\ncommitment to the preservation of a society that thrives on liberty and reason. \r\nClemson University holds John Allison's remarkable life of service and his support of and \r\ncommitment to education in the highest regard. It is with great honor and pleasure that we \r\nrecognize John Allison with the honorary degree, Doctor of Humanities "
    },
    {
        "page_number": "7",
        "text": "The Academic Procession \r\nThe Academic procession is composed of the faculty, staff, officers, trustees, and honored \r\nguests of the University. Faculty enter by college and each college is preceded by its marshal, a \r\nsenior faculty member, with the college baton, described under University Regalia. \r\nThe college banners are placed on the stage. Each banner is a combination of colors that \r\ndeclare the disciplines taught in that college. These colors, which were established by the \r\nAmerican Council on Education, are as follows: \r\nCollege \r\nAgriculture, Forestry, and Life \r\nSciences \r\nArchitecture, Arts, and \r\nHumanities \r\nBusiness and Behavioral Science \r\nEngineering and Science \r\nHealth, Education, and Human \r\nDevelopment \r\nLibrary \r\nStaff \r\nFaculty Senate \r\nColors \r\nMaize \r\nBrown \r\nGolden Yellow \r\nLilac \r\nBrown \r\nWhite \r\nDark Blue \r\nDrab \r\nCopper \r\nPeacock Blue \r\nCream \r\nOrange \r\nGolden Yellow \r\nLight Blue \r\nApricot \r\nCream \r\nLemon Yellow \r\nPurple and Orange \r\nPurple and White \r\nDiscipline \r\nAgriculture \r\nForestry \r\nLife Sciences \r\nArchitecture \r\nArts \r\nHumanities \r\nPhilosophy \r\nAccounting and Business \r\nEconomics \r\nPublic Administration \r\nSocial Sciences \r\nEngineering \r\nScience \r\nEducation \r\nNursing \r\nSocial Sciences \r\nLibrary \r\nAcademic Support \r\nInstruction \r\nCollegiate faculty follow their marshal in order of academic rank wearing academic costumes \r\nof medieval origin. Those who have received their degrees from institutions outside the United \r\nStates wear costumes specified by the awarding institutions. \r\nThe academic costumes of faculty whose degrees are from United States' institutions are \r\nspecified by a uniform code maintained by the American Council on Education. Caps are black \r\nand are usually mortar boards with tassels. Doctors of Philosophy wear gold tassels usually of \r\nmetallic thread; other degrees wear black or discipline colors. \r\nThe bachelor's gown is simple and black with long, pointed sleeves. Masters' gowns, also \r\nblack, are longer than bachelors. Older gowns have sleeves that terminate at the elbow while \r\nthose since 1960 have sleeves extended to the wrist. Doctors' gowns are full, with bell-like \r\nsleeves. The front is marked by velvet panels and the sleeves are marked by three velvet bars. \r\nWhile most gowns are black with black velvet, one variation is to replace black velvet with velvet \r\nin the discipline color. A second variation is a colored gown usually of the university's colors. \r\nAll hoods specify the level of degree, the type of discipline studied and the awarding \r\ninstitution. First, degree level is signified by the size of the hood with bachelors' smallest, masters' \r\nlarger, and doctors' quite large and of a different shape. Clemson does not award hoods to \r\nbachelors. The width of the velvet trim also conveys the degree. Secondly, the degree is \r\nindicated by the color of the trim edging the hood to form the throat over the gown. The most \r\nfrequently seen is dark blue, which designates the doctor of philosophy (Ph.D.) degree. Finally, \r\nthe color of the hood's lining specifies the awarding institution. The colors are displayed in \r\ncombinations that are drawn from heraldry. Notice that the Clemson University hood is lined \r\nwith purple through which is an orange chevron (a \"V\"). Although many combinations are \r\nduplicated by dozens of institutions, Clemson is presently the only institution with that registered \r\ncombination. \r\nThe officers, trustees, and honored guests wear academic, ecclesiasticat or military regalia as \r\nset forth by their professions with the President of Clemson University wearing a purple gown \r\nwith four velvet bars piped in gold and the University seal embroidered on the panels. The \r\nTrustees wear a similar gown with three velvet bars piped in gold for doctorates and an \r\nembroidered palmetto tree on each sleeve for those who do not hold doctorates. Hoods are either \r\nfrom Clemson or from the awarding school. They are preceded by the University Marshal. Clad \r\nin a gown of office in gold and purple, the marshal wears no hood and bears the University mace. \r\nAt the ceremony's close, the faculty do not exit as a part of the recessional bur are dismissed, \r\nalong with students and guests, when the marshal leaves the coliseum. "
    },
    {
        "page_number": "8",
        "text": "The University Regalia \r\nThe University mace is the symbolic representation of the whole of Clemson \r\nUniversity and must be present at any convocation where the University, through \r\nits delegated members, is acting officially. At any official convocation such as \r\ncommencement, the University Marshal, carrying the mace, precedes the \r\nPresident into the assembly. The mace rests before the President's chair or speaker's \r\nstand throughout the ceremony, and its removal from the assembly at the close of a \r\nconvocation is symbolic of the official withdrawal of the University and, thus, the \r\nclose of the proceedings. \r\nThe decorative design of Clemson's mace is derived from the ceremonial maces \r\ncarried by heads of state and church in the Middle Ages. Its basic clublike shape, \r\nhowever, is much more ancient, probably going back to man's prehistory. It is made \r\nof walnut wood and silver, with the seal of the University in gold and the \r\nUniversity colors represented by insets of carnelian (orange) and amethyst \r\n(purple). Amethyst is also the state stone of South Carolina. \r\nThe Presidential chain and seal is symbolic of the authority vested in the office \r\nof president by the governing body of the University. Only the University \r\nPresident may wear it, and while wearing it he speaks for the whole body of the \r\ninstitution. Clemson's chain and seal are made of silver and gold, and cornelian \r\nand amethyst. \r\nThe batons of the college marshals also descend from medieval \"staffs of office\" \r\nwhich were carried by the senior members of departments of state or church. They \r\ndisplay the seal of the University and the symbolic color of the discipline to which \r\nthe college belongs. Clemson's batons are made of walnut wood and silver with the \r\nvarious disciplines inset with enamel. \r\nThe University regalia were designed and executed by Mr. Robert Ebendorf. Mr. \r\nEbendorf is twice winner of the Tiffany Award and one of the most acclaimed \r\ngoldsmiths of our era. The enamel plaques for the batons were executed by the late \r\nProfessor Marshall C. Bell, and the lapidary work was executed by the late Mr. C. \r\nC. Wilson of Clemson University. "
    },
    {
        "page_number": "9",
        "text": "CANDIDATES FOR THE DOCTOR'S DEGREES \r\n]. BRUCE RAFERT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nDOCTOR OF PHILOSOPHY \r\nApplied Economics \r\nKarim Gulamhuscin ________________________________ Bumaby, Canada \r\nB.A., M.A., Simon Fraser University \r\nDissertation: Golden Handshakes: Pay for Failure anJ Executive Dismissals \r\nAdvisoc Dr. M.T. Maloney \r\nFrank F. Limehouse-~------------------------------- Be<lufort, SC B.S., M.S., Clemson University \r\nDissertation: Three Essays on the Go\\( Industry \r\nAdvisor: Dr. R. E. McCormick \r\nAndrew Philip Weinbach _____________________________ Virginia Beach, VA \r\nB.A., University of South Carolina \r\nDissercation: Gambling and the Poor \r\nAdvisur: Dr. W.R. Dougan \r\nEntomology \r\nldham Sakti Harahap Bogar, Indonesia \r\nB.S., M.S., Bogar Agricultural University \r\nDissercation: Feeding and Agonistic Beh<lvior of Two Native Subtemmc<m Termites, Reticulitermcs fl-wipes (Kollar) and \r\nReticulitcrmes virginicus (Banks) (lsoptcra: Rhinotermitidae) \r\nAdvisor: Dr. E. P. Benson \r\nEnvironmental Toxicology \r\nAdam Cory Ryan Shortsville, NY \r\nB.S., State University of New York - College at Fre<lonia; M.S., Clemson University \r\nDissertation: Influence of Dissolved Organic Matrer Source an<l Chemical Characteristics on the Toxicity of Copper to Daphnia \r\nmagna \r\nAdvisor: Dr. S. ]. Klaine \r\nCarla Nacette Thomas Clarendon, Jamaica \r\nB.S., M.S., University of the West Indies \r\nDissertation: Effects of Brick Air Scrubber By-product on the Physiological Responses of Selected Plant Species and ics Utilization in \r\nLagoon Sludge Treatment \r\nAdv isors: Dr. S. J. Klaine \r\nDr. W. L. Bauerle \r\nFood T cchnology \r\nSteven Craig Brnndon--,-,----------------------------------Clemson, SC \r\nB.S., M.S., Clemson University \r\nDissertation: An lnvesrigzition of Plugging of Parnllel-Pipe Systems \r\nAdvisor: Dr. P. L. Dawson \r\nAubrey Dean Coffee Aclanca. GA \r\nB.S., Johnson & Wales University \r\nDissertation: The Effect of High Oryzanol (6%) Rice Bran Oil on the Flavor Profile of Whole Milk Powder and Yeast-Raised Potato \r\nBread \r\nAdvisor: Dr. J. U. McGregor \r\nForest Resources \r\nRobert Brandon Cromer Pomaria, SC \r\nB.S., University of South Carolina; M.S., Clemson University \r\nDissertation: Relarionships Between T errescrial Vertebrates and Coarse Woody Debris Created by Hurricane Hugo on Coastal South \r\nCarolina Floodplain Forests \r\nAJvisor: Dr. C. A. Gresham \r\nPhillip Eric Wiseman Roanoke, VA \r\nB.S., M.S.; Virginia Polytechnic Institute \r\nDissertation: Fine Root Attributes of Endomycorrhizal Woody Plants and the Application of Endomycorrhizae to Urban Horticulture \r\nAdvisor: Dr. D. L. Hain \r\nWildlife and Fisheries Biology \r\nShawn Paul Young-=-_,,...--,-.,.-=--=---,-,---------------------- Punxsutawney, PA B.S., Northland College; M.S., Clemson University \r\nDis.-;ertcttinn: Ecology of Reservoir Striped Bass \r\nA,d\\·isor: Or. J. J. lsely "
    },
    {
        "page_number": "10",
        "text": "COLLEGE OF BUSINESS AND BEHAVIORAL SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nIndustrial/Organizational Psychology \r\nJatnes Maximi lian Dickinson C lifton, NJ \r\nB.A., Loyola College; M.S., Clemson University \r\nDissertation: Differential Pred iction of Volunteer Outcomes: Refining Our Knowledge of Social Service Participation \r\nAdvisor: Dr. M. Horvath \r\nManagement \r\nDouglas Neal Hales--------------------------------- Atlanta, GA B.S., Brenau College; M.B.A., Kennesaw State Un iversity \r\nDissertation: How Business,to,Business Electronic Commerce Impacts Operating Perform<ince in Individual Firms \r\nAdvisor: Dr. L. D. Fredendall \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nDOCTOR OF PHILOSOPHY \r\nBioengineering \r\nJoshua James Lovekamp _______________________________ Martinez, GA \r\nB.A., University of Georgia; M.S., Clemson University \r\nDissercation: G lycosaminoglycan Function, lnsccibility, and Preservalion in Bioprosthecic Heart Valves \r\nAdvisor: Dr. N. R. Vyavahare \r\nQ ijin Lu ____________________________________ Guangxi, China \r\nB.E., Chengdu University of Science and Technology; M.E., S ichuan Union University \r\nDissertation: Evaluation of Arterial Elascin c.md Collagen Scaffolds for Cardiovascu lar T issue Engineering \r\nAdvisor: Dr. N. R. Vyavahare \r\nChuck Brandon Thomas_,~----------------------------_ Kingsport, TN \r\nB.S., M.S.; U niversity of Tennessee \r\nDissertation: Development of a Composite Bone Graft Substitute for Bone Tissue Engineering Applications \r\nAdv isor: Dr. K. ). L. Burg \r\nT ao Xu Tongren, China \r\nB.S., Beijing Institute of Aeronautics and Astronautics; M.S., Ch ina Institute of Atomic Energy \r\nDissertation: Rapid Fabrication of Electrically Excitable Cell Structures that Exhibit Form an<l Function by the Inkjet Printing \r\nMethod \r\nAdvisor: Dr. T. Boland \r\nChemical Enginet:ring \r\nPeifeng Chen __________________________________ Xiaoyue, China \r\nB.S., Zhengzhou Institute of Technology \r\nDissertation: Ammonium Toxicity and Amino Acid Protection in Chinese Hamster Ovary Cells \r\nAdv isor: Dr. S. W. Harcum \r\nWilliam Frank Edwards, Jr.------------------------------- Easley, SC B.S., Clemson University \r\nDissertation: Fractionation of Carbonaceous Pitches By Molecular Weight Using Dense-Gas Extraction \r\nAdvisor: Dr. M. C. Thies \r\nChristopher Paul O'Brien ________________________________ Bovey, MN \r\nB.S., University of North Dakota \r\nDissertation: Quantum and Molecular Modeling of Polylactidc \r\nAdvisor: Dr. D. A. Bruce \r\nKeisha Bishop Walters ________________________________ Taylors, SC \r\nB.S., t--1.S., Clemson University \r\nDissemnion: Surface Grafting of pH-Responsive Polymer Layers \r\nAdvisor: Dr. D. E. Hirt \r\nXiaolin Wei-,,-,---,..,------------------------------ Nanchang, Ch ina \r\nB.E., M.E., Zhc1hlng University \r\nDisscrtZLtion: Synth1..·sis ,md Charactcrirntion of Moli:cu larly Imprinted Polymer Films \r\nAdvbor: Dr. S. M. Hu:--.on. \r\n2 "
    },
    {
        "page_number": "11",
        "text": "Chemistry \r\nNmgyi Chen Wuhu, Chin<l \r\nB.A., Ant_Jing Teachers College; M.E., Dalbm ln~tillnc ofTcchnl1l11gy \r\nPis...,crtarilm: d-(N-Cmbamoyl)alkylcupratcs: Enantil1- and Diastcrcos1.·lcctivc Reactiot'ls and Applicniuns in Alkaloid Synrhcsis \r\nALkisor: Dr. R. K. Dieter \r\nJiomylmg Jin---------------------------------- Hangzhou, China B.S., Fudan Universicy; M.S., Dalian lnsricute of Technology \r\nDissertation: Studies on Pcrfluorocyclobutyl (PFCB) Ary\\ Ether Polymers: From Fundamentals to Function \r\nAdvisors: Dr. D. W. Smith \r\nDr. S. H. Foulger \r\nLea Wallis Padget<.,,_--------------------------------Clemson, SC \r\nB.S., Clemson University \r\nDissertation: Pynole - Based Cannabinoids \r\nAdvisoro Dr. J. W. Huffman \r\nCivil Engineering \r\nPrapot Kunthong Bangkok, Thailand \r\nB.Eng., Kasetsart University; M.S., Clemson University \r\nOis.5emnion: Efficient Predictor/Multi-Corrector Algorithms Based on High-Order Accurate Time-Discontinuous Ga Jerkin Methods \r\nfor Second-Order Hyperbolic Systems \r\nAdvisor: Dr. S. C. Anand \r\nComputer Engineering \r\nPhilip Hutchinson Cams ________________________________ Chescer, SC \r\nB.S., M.S., Clemson Universiry \r\nDissertation: Achieving Scalability in Parallel File Systems \r\nAdvisor: Dr. W. B. Ligon \r\nComputer Science Zhengnan Shi ___________________________________ Beijing, China \r\nB.S., Beijing Informacion Technology lnscitution; M.S., AppahKhian Scace University \r\nDissert<1tion: Self-Stabilization Protocols, and Distributed Protocols in Mobile Ad Hoc Networks \r\nAdvisor: Dr. W. D. Goddard \r\nEnvironmental Engineering and Science \r\nAnthony Steven Danko Sharon, PA \r\nB.S., Rensselaer Polytechnic Institute; M.S., University of Pittsburgh \r\nDissertation: Use of Vinyl Chloride as a Growth Substrate by Aerobic Bacteria: Pathway Analysis and Involvement of Linear \r\nPlasmids \r\nAdvisor: Dr. D. L. Freedman \r\nlnduscrial Engineering \r\nRuephuwan Chancrasa ----~--~---~--~-------------- Chonburi, Thailand B.E., King Mqngkuc's lnsticuce of Technology; M.E., Chulalongkorn University \r\nDissertation: Decision-Making Approaches for Information Sharing in a Supply Chc:iin \r\nAdvisor: Dr. W. G. Ferrell \r\nVinay Mehendiratra _________________________________ Alwar, India \r\nB.S., Pangab University; M.S., Clemson University \r\nDissertation: Development of Flight Leg Rorustness Index and its Application in Airline Crew \r\nAdvisor: Dr. M. E. Kurz \r\nSangmun Shin Ulsan, South Korea \r\nB.A., Korea University; M.S., Clemson University \r\nDissertation: A New Paradigm for Integrated Bi-Objective Robusc-Tolerance Design Modeling and Optimirntion \r\nAdvisoc Dr. B. R. Cho \r\nMaterials Science and Engineering \r\nPaulo Estevao Lopes ___________________________ Yi la Nova de Foz Coa, Portugal \r\nB.S., University of Oporto \r\nDissercation: In-sicu X-rny Characterizacion of Polymer Processing - Mele Spinning of iPP \r\nAdvisor: Dr. W. T. Pennington \r\nMathematical Sciences Jirapha Limbupasiripom _____________________________ Picsanuloke, Thailand \r\nB.Sc., Sri Nakharinwirot Universicy; M.Sc., Chulalongkorn Universicy; M.S., Clemson University \r\nDissertation: Partial Permucation Decoding for Codes from Designs and Finice Geometries \r\nAdvisor: Dr. J. D. Key \r\nPrasic Limbupasiriporn ______________________________ Nongkhai, Thailand \r\nB.Sc., Sri Nakharinwirot University; M.Sc., Chulalongkorn University; M.S., Clemson University \r\nDissertation: Hidden Subgroup Problem in Quantum Computing \r\nAdvisor: Dr. X. Gao \r\n3 "
    },
    {
        "page_number": "12",
        "text": "Physics \r\nHailemariam Ambayc -------------------------------Ziw::iy, Ethiopia \r\nB.S., M.S., Addis Ababa University \r\nDissertation: Theoretical Srudy of Dimomic Molecule Scattering from Metal Surfaces and its Application \r\nAdvisor: Dr. J. R. Manson \r\nJames Dwayne Kinnison ______________________________ Wocxlbine, MD \r\nB.S., Michigan State University; M.S., Northeast Louisiana University \r\nDissertation: High Energy Neutron Spectroscopy with Thick Silicon Detectors \r\nAdvisor: Dr. P. J. McNulty \r\nNathan Dane Lowhorn Murfreesboro, TN \r\nB.S., Bob Jones University; M.S., Clemson University \r\nDissertation: Effect of Rare#Earth Doping on the Thermoelectric and Electrical Transport Properties of the Transition Metal \r\nPencatelluride HITc~ \r\nAdvisor: Dr. T. M. Tritt \r\nTextiles, Fiber and Polymer Science \r\nMevlut Tascan_~~~~~~---~~-~-~-----------------Seydisehir, Turkey \r\nB.S., M.S.; Istanbul Technical University; M.S., Auburn University \r\nDisseratation: Acoustical Properties of Nonwoven Fiber Network Structures \r\nAdvisor: Dr. E. A. Vaughn \r\nCOLLEGE OF HEALTH, EDUCATION, AND HUMAN DEVELOPMENT \r\nDOCTOR OF EDUCATION \r\nCareer and Technology Education \r\nPamela Miller Ardem Enid, OK \r\nB.S., M.S., Oklahoma State University \r\nDissertation: To Compare the Impact of Two Alternative School Models on the Enhancement of Resiliency and Grade \r\nAchievement in Middle School Youth \r\nAdvisor: Dr. C. E. Poston \r\nDonald Sanford Griffith, Jr. Anderson, SC \r\nB.S., M.Ed., California University of Pennsylvania \r\nDissertation: First Robotics as a Model for Experiential Problem#Based Learning: A Comparison of Student Attitudes and Interests in \r\nScience, Mathematics, Engineering, and Technology \r\nAdvisor: Dr. C. H. Isbell \r\nC. Justice Tillman _________________________________ Hephzibah, GA \r\nB.A., Augusta College; M.S., Clemson University \r\nDissertation: Career and Technical Education Program Graduates: What Happens After Graduation! \r\nAdvisor: Dr. C. E. Poston \r\nDOCTOR OF PHILOSOPHY \r\nCurriculum and Instruction \r\nElizabeth Wilkinson Edmondson _____________________________ Seneca, SC \r\nB.S., Duke University; M.S., M.A.T., University of North Carolina \r\nDissertation: Collaborative Dialogue; Exploring Founh Graders' Discussions of Science \r\nAdvisor: Dr. W. H. Leonard \r\nStephen Jeffrey Lewis. _________________________________ Easley, SC \r\nB.A., Davidson College; M.Ed., University of North Carolina, Charlotte \r\nDissertation: The Effect of Instructional Methlxl on the Language Arts Learning of Middle School Students \r\nAdvisor: Dr. V. G. Ridgeway \r\nEducational Leadership \r\nDeborah Kay Conner _________________________________ Conway, SC \r\nB.A., Converse College; M.Ed., University of South Carolina \r\nDissertation: Factors that Effect Alumnus Giving at a Southeastern Comprehensive University \r\nAdvisor: Dr. R. L. Blackboum \r\nMary Banelme Hensien-:-:--=-:--:-,-----,=------------------------Dacula, GA B.A., Alma College; M.Ed., University of Georgia \r\nDissertation: The Principal's Leadership Style as Rehired to Student Achievement \r\nAdvisor: Dr. J. L. Flanigan \r\nRobbie Pernell Hooker Athens, GA \r\nB.S., M.Ed., Valdosta State Un iversity \r\nDissertation: An Examination of Strategies nnJ Techniques Eicilitated by Georgia Middle School Principals to Increase Student \r\nAchievement and Meet Adequate Yearly Progrcs.s \r\nAdvisor: Dr. J. L. Flanigan \r\n4 "
    },
    {
        "page_number": "13",
        "text": "Educational Le<tdt:rship (cLmtinucd) \r\nJennifer Cape Wilbanks Laurens, SC \r\nB.A., Uni\\'crsicy of Sourh Carolina; M.Ed., Cll'mson University \r\nDissertation: Collegiate Bureaucracy: Bmriers that Affect the Hiring <iml Promotion of Female AJministrarors in Srnre Supported \r\nHigher Education Institutions in South Carulina \r\nAJvisor: Dr. J. L. Flanigan \r\nParks, Recreation, and Tourism Management \r\nCarroll Anne Brown-------------------------------- Anderson, SC B.S., College of Charleston; M.B.A., The Citadel \r\nDisscmuion: The Social World of a Society of Smmdcrs Festival: Shag Dancing as a Serious Leisure \r\nAJvisor: H.J. Grove \r\nHerberc Charles Chancellor _____________________________ Cullowhee, NC \r\nB.S., Wesrern Carolina University; M.E., Bowling Green State University; M.A., Appalachian State University \r\nDissertation: A Study of the Attitudes and Intentions of Land Trust Executive Directors Toward Collaboration with Tourism Encities \r\nAdvisor: Dr. W. C. Norman \r\nJana Joy James Lawrenceville, GA \r\nB.S., University of Georgia; M.S., Northern Illinois University \r\nDissertation: A Description and Analysis of Children's Lived Experiences From a Social, Historical,Cultural Context of Their \r\nParticipation in a Non,formal Environmental Leaming Program \r\nAdvisor: Dr. R. D. Bixler \r\nYawci Wang_~-~------------------------------- Henan, China B.A., M.A., Zhengzhou University \r\nDissertation: Determinants of Travel Intentions Among O lder Adults \r\nAdvisor: Dr. F. A. McGuire \r\n5 "
    },
    {
        "page_number": "14",
        "text": "CANDIDATES FOR THE EDUCATION SPECIALIST AND \r\nMASTER'S DEGREE \r\nj. BRUCE RAFERT, Dean, Graduate School \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nMASTER OF AGRICULTURAL EDUCATION \r\nDavid J;1son C;1udill ________ _, __ Scncca, SC \r\nKathryn Mac Hulse Summerville, SC \r\nJoshua n.rnicl Murdock ________ Honea Path, SC \r\nErnest Schoonover, Jr. Greenville, SC \r\nC lrnse Ris4uc Mcintosh Charlotte, NC \r\nMASTER OF FOREST RESOURCES \r\nJoseph Jess Fleming __________ Pendleton, SC D.lvid Thomas Zabriskie _______ St Petersburg, FL \r\nMASTER OF SCIENCE \r\nAgricultural and Applied Economics \r\nBri;:in Patrick Gancc Clemson, SC \r\nBiochemistry \r\nGregory James G illes ________ Clemson, SC \r\nBotany \r\nJulie Rebecca Mitchell _______ Woodruff, SC \r\nEnvironmental Toxicology \r\nAnthony David Sowers McConnellsburg. PA \r\nFood, Nutrition, and Culinary Sciences \r\nKavith<l Boinap<:1lly Yerragunta, India \r\nForest Resources \r\nJames Christopher Gray Arrington ______ Colfax, NC Elim beth Marie Blizzard ---------Pelion, SC \r\nCarolyn Leigh Bass Cornelius, NC \r\nMicrobiology \r\nJason Lane Herlong-----------Saluda, SC Lori Lynn McGowan _________ Anderson, SC \r\nPackaging Science \r\nVivek Adinath Chougule _________ Pune, India James Cory Stewart __________ Hartsville, SC \r\nPlant and Environmental Sciences \r\nMeghan Leslie Baker Sylva, NC Shann Cory Tanner _________ Hemingway, SC \r\nLuanna Bina Gerardina Prevost_ Castle Comfort, Dominica \r\nWildlife and Fisheries Biology \r\nDavid Willillm Rudbail Spartanburg, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nMASTER OF ARCHITECTURE \r\nMyles Steven Alexander, Jr.------- Six Mile, SC James Clinton Mcncfee __________ Lorena, TX \r\nHillary Buie Andren Lake C ity, SC Homer Kurt Nestlen Inman, SC \r\nJoshua David Bagwell Townville, SC Christopher John Palkowitsch Roseville, MN \r\nStuart Marshall Barber Spartanburg, SC David Aaron Pastre New Concord, OH \r\nMatthew Allen Brewer Camden, SC Sean C. Raboin Minneapolis, MN \r\nAmy Nicole Cole Currituck, NC Thad Carroll Rhcxlen Chapin, SC \r\nBrian Thomas Cook Cinc innati, OH Gretchen Michelle Richter Charleston, SC \r\nEmily Elizabeth Cox Mullins, SC Lindsey Anne Sabo St Clairsville, OH \r\nMichael Stephen Crary Elkton, MD Peyton Withers Shumate Tampa, fl. \r\nLawrence Joseph Delaney Ill Seneca, SC Michael Stanley Stopka Downers Grove, IL \r\nSteven Roberts Grogan Sumter, SC Benjamin Frederick Story, Jr. Summerville, SC \r\nDaniel Benjamin Harrison Spartanburg, SC Johnny T. Tam Spartanburg, SC \r\nMichael Tcxld Hudson Orem, UT Jeremy Michael Tate Fountain Inn, SC \r\nSean Patrick Hyland Flemington, NJ Robert Andrew Thompson Spartanburg, SC \r\nEllen Cathey Martin Anderson, SC Heather Marie Voorhaar Annapolis, MD \r\nMeredith Ashley McCormick Rock Hill, SC \r\n6 "
    },
    {
        "page_number": "15",
        "text": "MASTER OF CITY AND REGIONAL PLANNING \r\nMason Hancock Ailstock -------~Arnold, MD Bryan Jeffress Mitchell _______ Johnson City, TN \r\nAmy Nicole Cole Currituck, NC Hayes Blythe Morrison Madison, AL \r\nCourtney Devon Craker Big Pine Key, FL Mary Douglas Neal Columbia, SC \r\nDavid Christian Dyrhaug Buffalo Grove, IL Ryan Mitchel Perk! Pittsville, WI \r\nRussell Blakeney Easterling Charleston, SC Justin John Price Mauldin, SC \r\nAnthony Daniel Kroeger Cincinnati, OH Lacey Dawn Rains Robinson, IL \r\nWade Franklin Luther II Columbia, SC Ole Russell Sleipness Sedro-Woolley, WA \r\nTodd Christopher Lynch Fairfax, VA Norman Brown Wright McKwen, SC \r\nAndrew Joseph Merriman Greenville, SC Stuart MacReynolds Wyeth III Baltimore, MD \r\nMASTER OF CONSTRUCTION SCIENCE AND MANAGEMENT \r\nSamuel Wright Dixon _________ Greenville, SC Dhanunjay Kondrakunta _______ Hyderabad, India \r\nJohn Lee Kester III Sumter, SC Swathi Kuuchimanchi Bangalore, India \r\nHemant Jagannath Khaneja Ahmedabad, India Timothy Joseph Menard Virginia Beach, VA \r\nMASTER OF FINE ARTS \r\nVisual Arts \r\nChristina Zapffe Anderson ------- Bozeman, MT Matthew Nolan Kargol ________ Oskaloosa, IA \r\nRobert Mitchell Bickey Athens, GA Larry Brandon Wood Mustang, OK \r\nMASTER OF ARTS \r\nEnglish \r\nAmelia Ruth Borders _________ Anderson, SC John Robert Longo, Jr. _______ North Augusta, SC \r\nChristi Ellen Conti Deville, LA Kevin Charles Manus Odum, GA \r\nMadelyn Michelle Cook Appling, GA Patrick Thomas McAleer Spokane, WA \r\nApril Riggins Ficklin Greenwood, SC Meredith Lee Moore Moore, SC \r\nFrederick Simon Grant Winnsboro, SC Jason Gerard Rivers Detroit, Ml \r\nErin Patricia Knapp Peachtree City, GA Jessica Marie Stender Easley, SC \r\nHistory \r\nEric Hayden Doss __ ~~------Greenville, SC William Michael Parker------- La Follette, TN \r\nRobert Oliver Garrison Elder Wichita, KS Sean William Simon Jupiter, FL \r\nNori-Lyn Estelle Moffat Alberta, Canada \r\nProfessional Communication \r\nDavid Brooks Alexander _______ .,,.. Anderson, SC Keri A. Holder_~ _________ Vicksburg, MS \r\nDaniel Jeffrey Bassett Birmingham, AL Christy Ann Mroczek Decatur, Ml \r\nAnn Janet Connelly Waterbury, CT Kacherine June Pringle Greenwood, SC \r\nJason Christopher Durham Mauldin, SC Tracie JoAnne Smith Chesapeake, VA \r\nSamantha Leigh Erbaugh Dayton, OH Jessica Lee Turner Nashville, TN \r\nBarbara Vogel Evers Greenville, SC Brian Everett Verhoeven Binghamton, NY \r\nShawn Denise Haney Anderson, SC \r\nMASTER OF SCIENCE \r\nArchitecture \r\nCan Kundak __________ Istanbul, Turkey \r\nCOLLEGE OF BUSINESS AND BEHAVIORAL SCIENCE \r\nMASTER OF BUSINESS ADMINISTRATION \r\nJeffrey Howard Amrein ________ Baltimore, MD Crystal Currie Jackson ________ Milwaukee, WI \r\nMustafa Kerem Arsal Istanbul, Turkey Jodi Christen Laws Greenville, SC \r\nErinc Atilla Izmir, Turkey Bruce Reames Lee Greer, SC \r\nJames Steven Bache Wilmington, NC David William May New Orleans, LA .. David Neal Bain Greer, SC John Angelo Megale Winchester, VA \r\nRandall Scott Baird Bemidji, MN Tobias Neumann Aachen, Germany \r\nJeremy Paul Beasley Rantoul, IL Stephanie Nicole Ourada Kearney, NE \r\nViatcheslav Andreevitch Belkov Moscow, Russia Elizabeth Anne Perpall Huntsville, AL \r\nKonstantin Ivanov Bozhinov Plovdiv, Bulgaria Derek Michael Raper Lugoff, SC \r\nHeather Anne Vilhauer Bransford Danville, CA Christy Ann Season Birmingham, AL \r\nJonathan Mark Brown Marietta, SC Andrea Denise Smith Tallassee, AL \r\nWilliam Edward Brown Aiken, SC Derek Ross Sorenson Travelers Rest, SC \r\nJian~Hong Chen Taipei, Taiwan James Calvin Spurgeon Greer, SC \r\nAlejandro Contreras Aguilar Malaga, Spain Dongou Tang Hunan, China \r\nWesley Joe Davis Fletcher, NC Daniel James Trier Aiken, SC \r\nRichard Thomas Didonato Simpsonville, SC Jhansi Lakshmi Vasireddy Medak, India \r\nPhilip Kwaku Donkor Accra, Ghana Brian Matthew Winburn Cheraw, SC \r\nJames Nickolas Erneston Atlanta, GA Lynne Susan Wisniewski Ansonia, CT \r\nMatthew Willard Fox Manning, SC Elizabeth Maynard Woodall Lilburn, GA \r\nDavid Gaines Grant Greenwood, SC David Gregory Wurster Wyomissing, PA \r\nRobert Eugene lanuario Duncan, SC Justin J. Zehnder Jefferson Hills, PA \r\nIva Raychcva Ivanova Kyustendil, Bulgaria \r\n7 "
    },
    {
        "page_number": "16",
        "text": "MASTER OF ELECTRONIC COMMERCE \r\nChrist11phcr LL'l' Coker ________ Easley, SC \r\nMASTER OF PUBLIC ADMINISTRATION (~b,1n nt l'uhlu.: Admm1,1r.11n111 is juintly .1dmini~1ereJ hy \r\nC:lt'IH\\(lll nin-r~11y <1ml rlw University 11f S.1u1h C.m,l1n:1.) \r\nJdfn .. ·y Jay P.ransford _________ .Som Anwnin, TX Allison Michdlc Mims ________ Greenville, SC \r\nAnd1lmy J. K<ISSL'kcrc C incinnali, 011 T1.xlJ Ashley Ward Greenville, SC \r\nLukt..· Vnn1m KirklanJ Grct.:nvilk, SC \r\nMASTER OF ARTS \r\nEconomics \r\nLilian<J D.mila _________ Brasov, R011mnia \r\nMASTER OF SCIENCE \r\nApplied Psychol~y \r\nJessica Lynn Bradley __________ Elkhart, IN K. Blake Mitchell __________ Wcllesley, MA \r\nAndrea Nicole Browning Hattiesburg, MS Jason David Moss Blasdell, NY \r\nApplied Sociology \r\nCy<l Lindsey Breland _________ Greenville, SC Andrea Janelle Strou<l _________ Danville, VA \r\nMegan Elisabeth Linz LuLhcrville, MD z~1chary WaJc Sutcon Seneca, SC \r\nChriscopher Michael Selzer Sevcrna Park, MD Leanne Denise Williams Snellville, GA \r\nGraphic Communications \r\nDeepti Chopra __________ Clemson, SC \r\nIndustrial Management \r\nVandana Balan ___________ Chennai, India Subburayalu Rajaram _________ Tuticorin, India \r\nVirendrasinh Vikramsinh Bhonsle Pune, India Nicholas Houston Willmore McMinnville, TN \r\nVenkata Sriram Duvvuri Hyderabad, India Guoyao Zou Ningdu, China \r\nCarrie Lirae Lampson C lemson, SC \r\nCOLLEGE OF ENGINEERING AND SCIENCE \r\nMASTER OF ENGINEERING \r\nCivil Engineering \r\nDavid Thomas Henderson _____ Hendersonville, NC Carl Christian Tho<lesen _______ Asmara, Eritrea \r\nMASTER OF SCIENCE \r\nBioengineering \r\nDouglas M. Brunson -,,-----------,,_Fort Mill, SC Jason Douglas Hemmer _________ Seekonk, MA \r\nAnne Nichole Myers Cavin Orangeburg, SC Andrew Michael Miesse Decatur, IN \r\nAbhijit Achyut Gurjarpadhye Mumbai, India Karen Elizabeth Mohr Denver, CO \r\nBiosystems Engineering \r\nAlejandra Coloma __________ Quito, Ecu<1dor Joshua Aaron Smith __________ Inman, SC \r\nChemical Engineering \r\nGyo Young Park __________ Myrtle Beach, SC Michael Messinger Zavatsky ____ Arlington Heights, IL \r\nRobert A. Walker Greer, SC \r\nChemistry \r\nShelby Lehann Taylor ________ Beaufort, SC \r\nCivil Engineering \r\nBryan Milton Dick ___________ Sumter, SC Pamela Orce ____________ Adams Run, SC \r\nJonathan Matthew Edlinski Goose Creek, SC David Newell Powell Clemmons, NC \r\nChristopher Michael Iser St George, SC Jason Lee Vaughn Lancaster, SC \r\nGaurav Prakash Javalkar Mumbai, India Di Zhang Clemson, SC \r\nMichael J. Markvan Economy, PA \r\nComputer Engineering \r\nAravindkumar B(llakumar ___ ____ Chennai, India Peter Timothy Rickcnbt'tch ______ Simpsonvillc, SC \r\nTimothy Justin Luck Cheraw, SC Michael Anthony Speth Columbia, SC \r\nVishal Bhaskar Patil Mumbai, India Robert Allen Taylor, Jr. Goose Creek, SC \r\nMark Remi Greenville, SC Timothy C lark Thompson, Jr. Honea Path, SC \r\nComputer Science \r\nVipul Chamlrabnt Bhulawala ______ Mumbai, India Daniel Kitovcr Rich Athens, GA \r\nKenneth Mark Bidewclt TclforJ, PA Christopher John Rivers Virginia Beach, VA \r\nKunal Brij Chopra Mumbai, India Kiruthika Selvamani Chennai, India \r\nRobert Sumter Culler Ander~on, SC Balasubramaniam Bhavani Suryanarayanan _Chennai, India \r\nD.wiJ Nicholas Graham Columbia, MS Jeffery Ch<mJler Vales Murrell's Inlet, SC \r\n8 "
    },
    {
        "page_number": "17",
        "text": "Electrical Engineering \r\nS;1ml'l'r Subha~h Bhide Punc, lndi;1 Nikhil Kurn;ir PatwarJhan ________ Punc, India \r\nRha\\·:mi Rurr;1 Hydcrnbad, India Minh Phuong Thi Pham Greenville, SC \r\nNimitha Ch,11n:1 Hyderabad, lmlia Slrnilaja Rachakonda Hyderabad, lmlia \r\nAnshul 11.nvan Ch ... m'l..lhary Pune, India Arvind Ravishunkar Coimbatore, India \r\nHaripriy<l Gant;\\ Hy<lcrah11d, India Taruna Su<larshan Reddy Hyderabad, India \r\nSwcrha GopaLm Santh:mam Chcnnai, India Raghunandan Smnpath Kumarnn Bangalore, India \r\nArchi.sman Gupta Kolkata, India Vcnkatcsh Seetharnm Chcnnai, India \r\nDavid Ll'on Htmisch, Jr. Sumter, SC Arjun Laxrncm Seshadri Bangalore, India \r\nYi Ji:1ng Chengdu, China Thuan Oien Vong Charleston, SC \r\nSri ram Kabisrhabm Muthukumar ____ Cuirnb<1tore, India Brian James Wolf Columbia, SC \r\nSumer<i Parnn Hyderabad, India Guang Zeng Shenzhen, China \r\nEnvironmental Engineering and Science \r\nJason Gregory Grincr __________ Hampton, SC Zaheer Mohammad Shaikh _______ Mumbai, Indi<1 \r\nErnest Justin Holben Ranger, GA John David Sivey Merrill, MI \r\nHu:cfo Husain Burhanpur, India \r\nHydrogeology \r\nJeffrey Thrnnas Atteberry _______ Cincinn!lti, OH Stephanie Brevard Jones ________ Charleston, SC \r\nRichard Jason Hall Newbargh, IN Hadian Liang Ledu, China \r\nIndustrial Engineering \r\nVikas Chander __________ Chanchgarh, India Samer Tamer Moukalled ________ Greenville, SC \r\nRanrnsekhm Cherukumi\\li Bang<1lorc, India Nandita Padmanabhan Hyderabad, India \r\nKaushik D. Dave Mumbai, India Paris Farquhar Stringfellow Tega Cay, SC \r\nAnayo Chinedu Ezenekwe Mauldin, SC Jennifer Lauren Turner Florence, SC \r\nVikram Kurka! Chennai, India \r\nMaterials Science and Engineering \r\nUtpal Ajay Deole ___________ Punc, India Micah Jared Lee ___________ Camden, SC \r\nMathematical Sciences \r\nMaria Gisela Bardossy _______ Cordoba, Argentina Lisa Ann Kaltenbach _________ Cleveland, OH \r\nMary Ann Coleman Middletown, MD Jon<1thon Todd Leverenz Georgetown, KY \r\nYunwei Cui Taiyuan, China Jing,En Pan Foshan, China \r\nSean Michael Daugherty Simpsonville, SC Ethan Chriscopher Smith Oil City, PA \r\nSrncey Lynn Faulkenberg Louisville, KY Andreas Tso\\akis Nicosia, Cyprus \r\nSarah Bech Graham Columbia, MS Zachary David Voller Omaha, NE \r\nRaymond Andrew Heindl Greenville, SC Rui Wang Tai Zhou, China \r\nJoseph Andrew Johnson Johnson City, TN Leonmd Duane Wilkins Atlanta, GA \r\nKumar S. Kakcirlapudi Ponnur, India Mingfu Zhu Yiwu, China \r\nMechanical Engineering \r\nSantosh Ram Ancha ________ Hyderabad, India Jason Thurman Stewart __________ Easley, SC \r\nSeth A. Barbour Princecon, WV Joshua Randall Scewan York, SC \r\nVinod Cherian Bangalore, India Robert Thomas St. Louis Newton, MA \r\nPaul Warren Danker Aiken, SC Bhushan Bhalchandra Thakar Pune, India \r\nBrian Lee Dillinger Chester, SC Adrian Lucian Trif Baia Sprie, Romania \r\nTezc<1n lmmlar Bursfl, Turkey Henry Francis Vitali Lille, France \r\nChristopher Paul Keener Lincolnton, NC Paul Hunter Wright Greenville, SC \r\nSai Ranga Vinal Palapanhy Hyderabad, India Chunling Zhao Guangxi, China \r\nHimanshu Rajoria Ajmer, India Swar Abdulsalam Zubeer Simpsonville, SC \r\nJustin Harold Sill Gaffney, SC \r\nPhysics \r\nMark Frederick Theiling _______ Charleston, SC Tianyu Zhan ___________ Shanghai, China \r\n9 "
    },
    {
        "page_number": "18",
        "text": "COLLEGE OF HEAL TH, EDUCATION, AND HUMAN DEVELOPMENT \r\nEDUCATION SPECIALIST \r\nAdministration and Supe rvision \r\nJamie Amelia Rice Roysron, GA \r\nMASTER OF ARTS IN TEACHING MIDDLE GRADES EDUCATION \r\nEmily Harris r ret ~--------- C lemson, SC \r\nTimothy Robert Bcrklich G reenville, SC \r\nCasey Kathry n Kearse _________ G reenville, SC \r\nRonald Marlin Knorr G reer, SC \r\nEleanor Stubbs Bishop G reenville, SC Sara Beth Kripinski G reer, SC \r\nTamara Yvonne Bodrick C mncron, SC Renee Hcach McClcskcy G reenville, SC \r\nJoel S. Brandon G reenville, SC Rebecca Leigh McMullen G reenville, SC \r\nJason C hrisrophcr Bushnell Daytona Reach, FL Roy;mnc McWarers,Baer G reenv ille, SC \r\nWilliam Lewis C handler A nnisrnn, A L Holly L. Dickert McWhorter C linton , SC \r\nSusan Lawson Dunning Welch, W V Richelle A. Otovic Fountain Inn, SC \r\nC hristopher Michae l Erickson C rysta l Lake, IL Eli zaberh Scoct Pedrick Kingsport, TN \r\nMarth<1 Echols Fowler G reenville, SC Michael John Spae th Naperville, IL \r\nMicki Adolen G ibson Pendleton, SC Jeffrey Eugene Tharpe Easley, SC \r\nDavid Alan G uffey G reenville, SC Joseph Michae l Trojan W eirton, WV \r\nJill D.wis Hughey Boiling Springs, SC Susan Hendrix Wocx:i Laurens, SC \r\nN ib G asperi in Jcmcc G reer, SC \r\nMASTER OF HUMAN RESOURCE DEVELOPMENT \r\nT errance Lynn Broussard _______ Bacon Rouge, LA Nelly Eli za beth Kane _______ Fort Lauderdale, FL \r\nPhares Elwood C hatham IV Sumter, SC Erin Kathleen Matyak Topeka, KS \r\nJacqueline A ldebaran C rocker Fo rt Worth, T X Antho ny William Mayne C incinnaci, OH \r\nHeachcr Diane Edwa rds G reenville, SC Bradley Scott Moore Mo untain Rest, SC \r\nEdwin Tucker Hanna, Jr. Abbeville, SC T anya Michelle Murray G reer, SC \r\nStacey Lee Hitzclbcrg Fairfax, VA Rachae l Mari e Papadacos Barstow, C A \r\nCandace Nicole James Cope, SC Julius A ntoine Washingto n Mt Pleasant, SC \r\nMASTER OF PARKS, RECREATION, AND TOURISM MANAGEMENT \r\nJonathan Michael Blackwell C harleston, SC Randall Todd Dunlap _________ G reenville, SC \r\nMASTER OF EDUCATION \r\nAdministration and Supervision \r\nJennife r Hall Abercrombie --------Laurens, SC Tammy Burrell Knighc _______ Fo untain Inn, SC \r\nPage Nix A m etce Ga inesville, GA Jenn ife r Mills Murphy Johnston, SC \r\nKevin Tho mas Ga ines Royston, GA Joshua A lan Young G reenville, SC \r\nWilliam Frank Kellam A nderson, SC \r\nCounselor Education \r\nC hm les T yrone A llen _______ Brampton, Ontario Ki mberl y Brnshier G roome _______ G reenville, SC \r\nShawn Patrick A rnett Liben y, SC An ita Denise G uthrie Travelers Rest, SC \r\nStephanie A nn Beaver G reenville, SC Bridge t Ly nn Had ley Clinton Township, Ml \r\nLisa M ichelle Benjamin Ac to n, MA LinJa Ce1 rrol Jameison C happaqua, NY \r\nCasey Lee Berkshire Lexi ngton, NC Anne Tucker Lee A lpharetta, GA \r\nKe lly Leigh Berry Blythewood, SC April Theresa Schnuppcr Medford Columbia, SC \r\nAsh ley Elizabeth Blackwe ll Frank lin Springs, GA AJrienne Rawan Middle ton Lugoff, SC \r\nJeffe ry O'Nca l Boyle Owensboro, KY April Joy Moore Union , SC \r\nJoseph Tho mas Brnnyon III AnJrews, SC Emi ly Catherine Moore Columbia, SC \r\nKa ri Shannon Bums Indianapolis, IN C hristopher Craig Parrish , Jr. Camden, SC \r\nPameb Jacinda Butler Ornngcburg, SC Jaime Ann Padav ich Gainesville, FL \r\nLauren Grace Camero n Midloth ian, VA MaryAn n El izabeth Pool G reenville, SC \r\nMel issa Ma rie Dubuque G reenwOLxl, SC T iffa ny Marie Quinze O maha, N E \r\nMark Austin Ferguson Parma He ighcs, OH Mark Kevin Roof Georgetown , SC \r\nScacy C hristine Frick Seneca, SC Jennifer Olga Rozakos Anderson , SC \r\nSusan Celestine Gaither Harmony, NC Edward Frnncis Seavers Il l Ridgewood, NJ \r\nSusan Hope Garmcndia Mt Pleasant, SC A my Marie Thompson Walhalla, SC \r\nJoa n Baylis Griffith Summerville, SC Jonarhan Parri ck Wylie Yadkinville, NC \r\nElementary Education \r\nLesl ie Dawn Caldwe ll _________ Easley, SC \r\nReading \r\nAngela K. Bu rns_~--------- Pickens, SC Amy Keclen Newcon _________ C lemson, SC \r\nShelley Rickctl!'.i Kittle C lemson, SC Ka ren Ann Sloan C harleston, SC \r\nStephan ie AmanJa Myers Prosperity, SC Erin Page T ribble Columbia, SC \r\nSecondary Education \r\nAndrc;.1 \\'Vhclchd B<irnctt _______ Westminster, SC Jordan Russell C urry __________ Duluth, G A \r\nLucynthia Rogers Boyd Piercetown, SC Trac i A nn Hc<lctnicmi C lemson , SC \r\nA ngela Then:~a Cmu~o Simpsonvi lle, SC Adam N;ith<micl Hopkins Sal em, SC \r\nSpecial Education \r\nApril 1'.lichcllc Barkcr-Martin ______ Pendleron, SC Elise Nara le Powell __________ Berwyn, PA \r\nFkt~y Lcl111<l Drake Clemson, SC Gi.::rald Wesrl y T ilson, Jr. C harlesron, SC \r\nRritt:my Jl)Y H.1~tn L1w Mundelein, IL \r\n10 "
    },
    {
        "page_number": "19",
        "text": "MASTER OF SCIENCE \r\nNursing \r\nStephanie Bradk·y Atkinson ______ Spartanburg, SC RonJcy Scott Peake ___________ Union, SC \r\nSarah Deering Baranski Greer, SC Cynthia Bailey Robbins Taylors, SC \r\nAmanda Rene ·mant1._)n Inman, SC Karen Marie Robertson Mauldin, SC \r\nKevin [);mid Boyter Greenville, SC Sccfonie J. Ruiz Liberty, SC \r\nJn Burnette Bradley Campobello, SC Amcliet Marie Smith Evans, GA \r\nLisa T mynham Bry<rnt Anderson, SC Nancy B. Smith Roebuck, SC \r\nSusan Jayne Case Sparrnnburg, SC Tracie Denise Smith Anderson, SC \r\nCynchia S. Chasteen Greenville, SC Yvette Crespo Specs Simpsonville, SC \r\nSarJh Young Fraser Simpsonville, SC Jennifer Kyles Spencer Spartanburg, SC \r\nTheresa Elaine Gunter Salley, SC Victori::i Diane Vought-O'Sullivan Jupiter, FL \r\nMelissa Lovette Hollifield Asheville, NC Kim Louise Waldenmaier Simpsonville, SC \r\nMisti Alisha Jackson lnmm1, SC Shelley Rose Wells Florence, SC \r\nJ~1clyn Kristina Kaiser Brevard, NC Tamika Whitner Moore, SC \r\nTracy Hood Kania Greenville, KY David Devon Wilt Founcain Inn, SC \r\nWendy Lynn Murray Hemingway, SC Landace W. Woods Greenville, SC \r\nCarole Abernathy Parrish Spartanburg, SC Tamara Sue Woods Greenville, SC \r\nParks, Recreation, and Tourism Management \r\nHeather Anne Vilhauer Bransford _____ Danville, CA Amanda Joanne Johnson New Dundee, Ontario \r\nJeffrey Jay Bransford San Antonio, TX Jennifer L. Lytle Albuquerque, NM \r\nLaurabcth Melissa Emory Union, SC Smnandrn~Anne Jaudon Rozier ____ Moncks Corner, SC \r\nJessie Morgan Gibson Wescporc, NY James Leon Welch, Jr. Devonshire, Bermuda \r\nAndrew Logan Haddock Myrtle Beach, SC Christopher Jan Wynveen Lake Zurich, IL \r\nLisa Dyan Hunter Page, AZ \r\nGRADUATE SCHOOL \r\nMASTER OF FINE ARTS \r\nDigital Production Arts \r\nBahar Aybar~ __________ Ankara, Turkey Erik Robert Jeffreys __________ Pittsburgh, PA \r\nJcny Marshall Gardiner Easley, SC Wallis McKinley Larkins Dunwoody, GA \r\n11 "
    },
    {
        "page_number": "20",
        "text": "CANDIDA TES FOR THE BACHELOR'S DEGREE \r\nCOLLEGE OF AGRICULTURE, FORESTRY, AND LIFE SCIENCES \r\nCAL VIN LEE SCHOUL TIES, Dean \r\nBACHELOR OF ARTS \r\nBiological Sciences \r\n*K;nhryn Battrick Baltzell ________ Fkm.::ncc, SC *Sydney Ann Pesavento ________ Greenvi lle, SC \r\n**Christopher Sht.·rman CL)sra Charlcsron, SC Kelly Ann Rentz Spartiinburg, SC \r\n*Jessica Ochmc Hunter Lexington, SC DcAnJra Nicole Strother Columbia, SC \r\nMi.::gan Rose Muclkr Moore, SC D;1vid Thomas T uckcr Greer, SC \r\nBACHELOR OF SCIENCE \r\nAgricultura l and Applied Economics \r\nGeorge Brett Foglc _________ Orangcburg, SC James Hurn Hudson III ________ Orangeburg, SC \r\nBrian Maddox Greaver Snellville, GA Amanda Caroline Johnson Anderson, SC \r\nCht1rlcs Robert Harrison Edisto Island, SC Kendrick Leon Johnson Florence, SC \r\nWesley Alc-xander Trox ler Hayne Columbi<1, MD James Hayes Roberts Galivancs Ferry, SC \r\nAgricultural Education \r\nBrirtney Lanell Ayers. _________ Grecnvillc, SC **Caroline Grace Meetze ________ Lexington, SC \r\nEdward Greggs, Jr. Andrews, SC Aaron Douglas Miles Lake City, SC \r\n**Joseph Everecc Hord, Jr. Lawndale, NC *Macchcw Lawrence Stiefel Fountain Inn, SC \r\nKristen Suzann Jacobs Loris, SC Jacob Guy Scokes Lyman, SC \r\n*Morgan Elizabeth Judy Bowman, SC Carolyn Joyce Thompson North Augusta, SC \r\nAgricultural Mechanization and Business \r\nDaniel Lee McNeely _______ Lake Toxaway, NC Derek Alexander Simpson __________ Iva, SC \r\nJonathan Cleveland Perry Charleston, SC Austin McDonald Wood McCormick, SC \r\nAnimal and Veterinary Sciences \r\n*Adriane Alison Bell ___________ lrmo, SC **Morgan Caryl Krause ________ Anderson, SC \r\n*Elizabeth Leigh Belser Summerton, SC Tabitha Michelle Luna Charleston, SC \r\n**Erin Elise Brearley Essex Junction, VT *Rebecca Copeland Melchers Mt Pleasant, SC \r\nLaurie Christine Brown Carrollton, GA *Leslie Louise Mucci Pelzer, SC \r\n+**Tanya Christine Bruce Gilbert, SC Jeanne Marie Owens Sylvania, GA \r\nMatthew Gary Burns Pendleton, SC +*Shannon Melissa Parker Newton, NC \r\nCeleste Marie Ceva Hollywcxxl, SC ***Matthew Ray Patrick Pelzer, SC \r\n**Zachary Edward Deegan Anderson, SC +***Alana Anne Pavuk New Bern, NC \r\nCassandra Leigh Ehlers Hilton Head Island, SC *Alison Marie Reed Anderson, SC \r\nMegan Elizabeth Epting Chapin, SC *Amy Rebecca Stadler Summerville, SC \r\n*Colette Frances Floyd Beaufort, SC Lee Worth Taylor Yonges Island, SC \r\nCrystal Lee Freshwater Charleston, SC Jaret Thomas Thacker Columbia, SC \r\n*Ana Holly Gibson Hartsville, SC +**Virginia Elizabeth Westeren Columbia, SC \r\n*Janea LaKeysha Jenkins Simpsonville, SC Katie Nicole White McCormick, SC \r\nElizabeth Victoria Kiesling Batesburg, SC Whitney Brent Wilder Evans, GA \r\n*Brett Randall Kirkley Powdersville, SC \r\nBiochemistry \r\n+*Ashley Paige Dawkins _________ Chapin, SC Jason Christopher Liles _______ Virginia Beach, VA \r\n+***Kimberly Rae Doerin Severna Park, MD *Joshua Scott Rickey Georgetown, SC \r\n+**Christopher Wayne Goodman Rock Hill, SC Chad Nicholas Scripnick Florence, SC \r\n+***Mark Wilson Gramling Irmo, SC +***Clarice Marie Seifert Boise, ID \r\n*Aurelie Michelle Gresset La Reunion, France +*Peter Cantwell Shorter Charleston, SC \r\nGeorgios Theofanis Hilas Anderson, SC +**Michael David Stadnisky Wilmington, DE \r\nBryan Kelly Jones Easley, SC +*Robert Brooks Wi lson Summerville, SC \r\nBiological Sciences \r\n+**Evan Oliver Baird-------- Spartanburg, SC +**Sarah Lucille Gustafson Kingsport, TN \r\nLouise S. Bhavnani Marco Island, FL *Rachel Leigh Harris Aynor, SC \r\nJoseph Hopkin Bisesi, Jr. Glen Burnie, MD +*Anne Elizabeth Randall Harrison ___ Springfield, SC \r\nRuth Marie Bream Charlottesville, VA +**Megan Nicole Harvey Bradenton, FL \r\nJonathan Charles Brindle Nokesville, VA Shannon Elaine Hatmaker Chattanooga, TN \r\nLatisha Renee Canty Summerton, SC *Charlie Lloyd Hilton Lexington, SC \r\n**Christina Lynn Crabbe Sumter, SC *Gregory Dennis Jackson Sparcanburg, SC \r\n+***Travis Wilson Crook Kingwcxxl, TX *Amanda Danielle Johnson Sumter, SC \r\n+*Stephen Aloysius Cross Columbia, SC Andrew Paul Justice Pawley's Island, SC \r\n*Erinne Rose Dabkowski Roundhill, VA +*Omar Azad Ladhani Simpsonville, SC \r\n*Allison Marie Duncan Columbia, SC Candace Nicole Lollis Laurens, SC \r\nKristine Connell Ellison Anderson, SC +**Kimberly Ilene Mackin Rochester, NY \r\nSomerset Canadensis Gagne George.town, ME +**Andrea Lynn Mikol North Augusta, SC \r\n**Ja1nes Alton Gambrell Lamar, SC Dominique Quentin Miles Sumter, SC \r\nAshley LeAnn Garner Lugoff, SC Drew Michael Miller Charlotte, NC \r\n+**Jennifer Diane Gibson Kingsport, TN Christopher Dale Mims Taylors, SC \r\n**Laura Beth Grandits Lexington, SC John William Nance, Jr. Rock Hill, SC \r\n12 "
    },
    {
        "page_number": "21",
        "text": "Biological Sciences (continued) \r\nT1.·rry Kent Farmer Nichols, Jr. _____ Earls Grove, SC ShirnnJa Nikeeb Stephens, _______ Prosperity, SC \r\n+*~kgan Lucken O'Neill Greenville, SC Trent Kirby Suggs L1.)ris, SC \r\nGlenn Earl Pnrin GrecnwouJ., SC Michelle Ka,Lai Michiko Tada Greer, SC \r\n*Jcnnif-..•r Marie Pi1: D,illas, TX *Robert Livingsron Tankersley Florence, SC \r\nVich)ria LinJdl R1.·strepo Fort Lauderdale, FL John Thomas Thompson Kingstree, SC \r\nCorey Edward RllClkc Mishaw;tka, IN Usman Amash Tohid Darlington, SC \r\nBrittany Constance Russ Piedmont, SC *Ada Marie Monzo Vil linger Summerville, SC \r\n**Adriana Simioncscu Clemson, SC **Jennifer Maria Virag Camden, SC \r\n**Stcph:mic Layne Simpson Winscon,Salem, NC Allison Nicole Warren Wilmington, DE \r\nMegan Alison Slaughter Aiken, SC +**Virginia June Winston Greer, SC \r\nRy.m Travis Stec Marlton, NJ +*John David Southerland Wise Beaufort, SC \r\nEnvironmental and Natural Resources \r\nJason TI1omas Antley ________ Graniteville, SC +***Anne K<ithryn Hosey ______ Millersville, MD \r\nPeter Chanson Dom Younges Island, SC *Joseph Hogan Hyatt Ware Shoals, SC \r\n*Mallory Grnce Eils Piedmont, SC +***Jeremy Patrick Stovall Knoxville, TN \r\n*Anna Elizabeth Eskridge Greenville, SC \r\nFood Science \r\nErin Louise Crane ---------~~Norfolk, VA Lesley Auburn Salley,--_______ Myrtle Beach, SC \r\n*Megan Alexis Hayes North Charleston, SC +*Marlena Jocm Smich North Augusta, SC \r\n+*Suzanne Rooemary Hebda Lexington, SC Ashley Lara Spokowski Charles City, VA \r\n*Katie Danielle Komomik Fore Mill, SC Jennifer Maghen Stubbs Knoxville, TN \r\n*Ashley Tant Lee Bamberg, SC Jonathan Malcolm Unsworth Ithaca, NY \r\n*Mary Elizabeth Mills Sumter, SC Lucinda Sanquenette Vereen Hemingway, SC \r\n+**Carla Jennings Moore B<lmwcll, SC \r\nForest Resource Management \r\nRussell James Bruce--------~ Anderson, SC *Robcrc Dane Perkins..,.,.-------- Darlingcon, SC \r\nChristopher Lee Bryant Travelers Rest, SC *Timothy John Powell II Charleston, SC \r\nCharles Howard Coleman IV Blair, SC Jeffrey Deans Riggin Newberry, SC \r\nCharles Beal DeWict Blythewood, SC Christopher Lee Smith Union, SC \r\n+***Stephen Alexander McCullers Mariecca, GA Joseph Wharcon Wilson Central, SC \r\nJoseph Wallace Melton Pickens, SC Benjamin Thomas Woody Belton, SC \r\nHorticulture \r\nJeffrey William Carter _________ Augusta, GA Danielle Janean Maddox ________ Abbeville, SC \r\nStephen Bradley Cavin Sharon, SC Justin Lynn Mathis T uckasegee, NC \r\nMatthew Lynn Haynes Greenwood, SC John Norman Owens Ill Sparcanburg, SC \r\nMatthew Brian Herndon Lexington, SC Bradley Hawkins Page Woodruff, SC \r\nMichael Aaron Hughes Goose Creek, SC Robert Gary Saylor Gaithersburg, MD \r\n**Adrea Rebecca Hutchinson Anderson, SC \r\nMicrobiology \r\nEdmond Russell Baxley Ill ______ Johnsonville, SC *Jacqueline Elizabeth Hicks ___ North Myrtle Beach, SC \r\nCharlesCas.>idy Bray Asheville, NC Hannah Paige Hollis Spartanburg, SC \r\n*Robert Rashad Brightharp Trenton, SC *Robert Michael Jansen Columbia, SC \r\n*Mark Christopher Conard Clyde, NC **Eric Wonderly Jones Columbia, SC \r\nAndrew Russell Daane Naples, FL Karen Leigh Keesing Melbourne, FL \r\n+*Christina Michelle Gray Salisbury, MD *Jennifer Alison Petersen Omaha, NE \r\nTanya Lee Hall Cumming, GA Christopher Ronald Reisch Eden, NY \r\nKimberly Ann Hamer Dillon, SC +**Timothy Michael Snider Anderson, SC \r\nAnsel Edgar Hardin Ill York, SC \r\nPackaging Science \r\nAdam Hunter Gibson _________ Lexington, SC Jeffrey Cullen Patterson ________ Anderson, SC \r\nRoger Nicolas Godley Ehrhardt, SC Scott Brandon Peterson Mauldin, SC \r\nDaniel Marcus Haas Bethlehem, PA Franklin Wes Pollock Lexingcon, SC \r\nJaccy Micah Harper Chaguasnas, Trinidad +***Elizabeth Juanita L. Rhue Georgetown, SC \r\nWillene Patrice Johnson Charleston, SC Daniel Spencer Rikard Lexington, SC \r\nAsa Blix Jordan Ill Aynor, SC Thomas Mitchell Scott, Jr. Fork, SC \r\nAndrew Joseph Kessler St Albans, WV Brad Ashley Snipes Fork, SC \r\nNathan Adam Minton Greenville, SC **Robin Suzanne Strickland Seneca, SC \r\n*Kimberly Amanda Moon Hartsville, SC Joshua Anthony Tallon Summerville, SC \r\nKevin Howard Myers Mercer, PA Allyson Montique Wood Columbia, SC \r\nPre,professional Studies \r\nJennifer Melissa Austin ________ Charleston, SC Elizabeth Childers Hamilton Charleston, SC \r\nSa\"1h Kathleen Baxley Greenville, SC **Laura Griffith Lane Greeleyville, SC \r\n*Erin Eileen Burdette Clemson, SC Heather Leanne Lyles Lancaster, SC \r\n***Julie Kristen Carraway Clemson, SC ***Rose Ann~Marie Rader Wando, SC \r\n*Leslie Jo Carrieri Hartsville, SC *Shanon Whitney Simonds ___ Hilton Head Island, SC \r\n***Amy Lynn Donald Fort Mill, SC \r\nTurfgrass \r\nCurtis Garren Edens __________ Dalzell, SC M<ltchew Butler LaFoy _______ ....,,,.,...Greenville, SC \r\nJ,1Im Timmas Helmke Taylors, SC Brian Louis MacMillan Wading River, NY \r\nJustin D.wid Houk Lancaster, SC \r\n13 \r\nJ \r\n~ \r\nJ \r\nii \r\n·1 \r\n) "
    },
    {
        "page_number": "22",
        "text": "1 \r\nII \r\n' \r\nWildlife and Fisheries Biology \r\nRob1.·n Chri:-.tnphcr Becker _ ______ Charlcsrnn, SC **Cl1lleen Rae Funkhouser ______ New Oxford, PA \r\nWillis Anrh1.my Fh.1\\vcrs, Jr. Hampton, SC Jennifer Lynn Gamn11.m Gaffney, SC \r\nJustin Ln· Rruch· Pickens, SC Timorhy William Jackson North Augusta, SC \r\n***Mary Ellen Carinn Simpsonville, SC AnJrew Nathan Nuffer Portville, NY \r\nRri:m Campb1.·ll Cary MiJlorhian, VA Kevin Ned Renwick Newberry, SC \r\nJ<1imc Eli:aht:th Cnnk Fairview P;1rk, OH Peggy Lynn Shru1n Spartanburg, SC \r\nCOLLEGE OF ARCHITECTURE, ARTS, AND HUMANITIES \r\nJANICE CERVELLI SCHACH, Dean \r\nBACHELOR OF FINE ARTS \r\n*CL1urrney Leigh Dllnndl _______ Jacksonvi\\le, FL +**Daniel Gregory Stemann _____ White House, TN \r\nfknj;unin l\"\")uuglas Gilbert North Myrcle Beach, SC Alicia Blair Waller Columbia, SC \r\n**St<Ky Nod Isenbarger Simpsonville, SC *Susfln N<incy Young Gray Court, SC \r\nl\\ Luy Kathryn McGaw Anderson, SC Beau Fletcher Youngblood Charleston, SC \r\n*Blake Anthony Ross Greenville, SC \r\nBACHELOR OF LANDSCAPE ARCHITECTURE \r\n*Sh:twn Michael Balon _______ Spartanburg, SC Ira Jason Hallman __________ Rock Hill, SC \r\nc~1mcron Royflll Barrad;1le Richmond, VA +***Patrick Benjamin Kelly Greenwcxxl, SC \r\n*Richard Larry Brown, Jr. North Augusta, SC William Lewis McCollum Wall Tup, NJ \r\nJonathan Blake Coleman San Antonio, TX Joy Weaver McCurley Clemson, SC \r\n*David Paul Cosslett Williams Township, PA Edward Marion Smith Mt Pleasant, SC \r\n**Robert GC1ge Couch Greer, SC *Mark Cameron Stuermann Spartanburg, SC \r\nJamie Christine D.wis Easley, SC **Nichobs Steven Tedesco Wesley Chapel, FL \r\nLisa Marie Daye Billerica, MA Evan Kay Wilson Florence, SC \r\nKath<trine Michelle Graves Indianapolis, IN \r\nBACHELOR OF ARTS \r\nArchitecture \r\nTamara Tennille Anthony Lugoff, SC *Katie Lorraine Lawrance _______ Columbia, SC \r\n*Nathan Kent Asire Greenville, SC James Whitfield Lee Ill Saluda, NC \r\n**Melissa Kathleen Bau Id Pendleton, SC Floyd Julian Lemon, Jr. Summerville, SC \r\n+***Jennifer Lynne Bean Jacksonville, FL *Gregory Paul Marcy Columbia, SC \r\nShannon David Calloway Sparcanburg, SC **Shawn Michael McKeever Moncks Comer, SC \r\n*Jeremy Patrick Chinnis North Charleston, SC Abigail Joanne McKinley Summerville, SC \r\nJason Gerard Coolbaugh Kirkwood, NY Aaron Randolph Moody Charleston, SC \r\nMelissa Anne Cooper Greer, SC Christopher Joel Moore Florence, SC \r\nJason Lee Cumbee Ridge Spring, SC *John Edward Morris II White Plains, MD \r\n+*Kimberly Jane DeMars Sylvania, OH *Laura McDaniel Portney North Augusta, SC \r\nJoshua David Domingo Goose Creek, SC *Abigail Bech Santone Germantown, MD \r\nJonathan Andrew Frank Lancaster, SC Victor Paul Schelechow Fort Mill, SC \r\n**Natalie Nicole Gambill North Augusta, SC +**Christopher Michael Shelley Conway, SC \r\n*Margaret Eleanor Gramling_ ___ Moncks Comer, SC Ryan Francis Sloan Newport, RI \r\nNacalie Gualy Nashville, TN Laura Nanette Smith Greenville, SC \r\nJefferson Ryne Hawkins Spartanburg, SC Elizabeth Wong Sumner Pendlecon, SC \r\nMichael Paul Henderson MiJdlctown, NY +***Robin Lynn Timmons Kingsport, TN \r\n+*Nathan R. Herold Madison, AL +*Barbara Diane Tribic Mt Laure l, NJ \r\nMcCall Elizabeth Holman Shelby, NC Mary Katherine Trice Suwanee, GA \r\nKevin Robert Kievit Highhmd Mills, NY Ryan Charles Wilson Fallston, MD \r\nCommunication Studies \r\nJill Marie Bainbridge _________ Charlotte, NC **Jessica Sara Jubick __________ Somerset, PA \r\n+**Andrew Claycon Boozer Pomaria, SC Ashleigh Elina Kemp Turbeville, SC \r\nErin Colleen Burke Mariena, GA Edward Harris Lidow Naples, FL \r\n*Cassady Leigh Coggins Boiling Springs, SC *Laura Ruth Maddox Anderson, SC \r\n**April Lane Cook Greenville, SC *Elizabeth Allyn Mallison Tallahassee, FL \r\n+**Elizabeth Shirer Cox Florence, SC Travis Raunig McConkcy Fountain Inn, SC \r\nBradley Joel Crosby North Augusta, SC **Leah Eldis McDuffie Dillon, SC \r\n**Ashley Renee Crump Rock Hill, SC Kyle L<turen McElveen Georgetown, SC \r\n*Ashley Elizabeth Davis Marietta, GA +***K<ttic Elizabeth McRee Alpharetta, GA \r\nMary Caldwell Robertson Dial Columbia, SC Megan Elizabeth Moran Washingcon, PA \r\n**Jennifer Leigh Ferrell Pinehurst, NC Allison Leigh Mulkey Newport News, VA \r\nKelly Kathleen Flanagan Lilburn, GA *Kelly Elizabeth Orders Greenville, SC \r\n*Lauren Michele Ford Lexington, SC Renee Monique Pelton Fort Mill, SC \r\nTyler John Freiheit Oak Hill, VA Sara Frances Raynor Charleston, SC \r\nLaura McKeithen Harley Charleston, SC *Kelly Elizabeth Recd Salisbury, MD \r\nKristen Marie Harcwig Lexingcon, SC Stacey Michelle Rockwell Greenwood, SC \r\nStephanie Marie Haskell Simpsunville, SC Christina Susan Rodgers Olympia, WA \r\n*Amber Noel Hiergesell Aiken, SC Katherine Anne Saunders Windermere, FL \r\nErin Eli:abeth Holbrook West Bloomfield, Ml Ben Jason Self Fairfax, VA \r\nJulia Celeste Jones Clemson, SC Alexis Courtney Smith Charleston, SC \r\nMelissa Lemme Jones Picd1nnnc, SC B<trbara Me<igan Smith Lawrenceville, GA \r\nRichelle Nicole Jones L1dson, SC *Marg<UC( Ready Smith Mt Pleasant, SC \r\n14 "
    },
    {
        "page_number": "23",
        "text": "Communicacion Studies (conrinucd) \r\nRd,ccc1 Joanne Stanford ----- Baumh1._)ldcr, Gcrm;my Jaime Beth Uv;1 ___________ Charlocte, NC \r\n~ bry Je~m ~ullivan Billerica, MA **Victoria Gabrielle Watson Chesterfield, VA \r\n+*Cheryl Ann Swir Greer, SC Kathryn Eleanor Zmnbito Pine Bush, NY \r\n*Michael Thomas EJmund Trchy Aiken, SC \r\nDesign \r\nAdam Daniel Roberts _______ Greenville, SC \r\nEnglish \r\nBmbma Ashley Allen _________ Kingstree, SC Robert Oliver Maguire, Jr. _______ Chmlescun, SC \r\nJessica Lauren Birt Barnwell, SC *Lauren Patricia McCallister Spartanburg. SC \r\nLucas Marc Cyr Lexington, SC **Laura Amy Page Lexington, SC \r\nMary Anne Dickens Lake Junaluska, NC *Marion Elinor Patterson Shelby, NC \r\nMalena Anne Dinwoodie Beaufort, SC Luke Carter Rumsey Greenville, SC \r\nMegan Victoria Du Pree West Columbia, SC **Sally Ann Schwartz Greenville, SC \r\n***Megan Joanna Gooch Simpsonville, SC *Laura Gaillard Simons Holly Hill, SC \r\nTina Scuart Gregory Jamestown, OH +***William Alan Spink Germantown, TN \r\n+**Kevin Michael Haynes Ann Arbor, MI Amy Lawson Stokes Aiken, SC \r\n+*Emily Cacherine Herczog Signal Mountain, TN Sarah Anne Sucphin Shrewsbury, NJ \r\n*Carrie Ruch Hodge Easley, SC **Adam Gregory Thompson West Grove, PA \r\nEmily Michelle Hollosi Orbndo, FL Caleb Edward Todd Westminster, SC \r\nErica Ann Jaros Lansdale, PA Bonnie Joycelyn Tuten Grays, SC \r\n+**Hilary Owens Johnson St Louis, MO *Daniel Jordan White Greenville, SC \r\n*Alan Grant Jones Greenville, SC *Alyson Erin Willis Rock Hill, SC \r\n+***Jessica Marie Kearnn Anderson, SC +***Lauren Holleman Yarrow Central, SC \r\nHistory \r\n+*Elizabeth Ann Miller Cade Birmingham, AL +*Lindsey Nicole McClain _______ Greenwood, SC \r\n*Thomas Harper Collins Greenville, SC Anna Marie McDavid Greenville, SC \r\n**Sara Kendall Edwards Simpsonville, SC *William Thomas Merrell Walhalla, SC \r\n**Catherine Rebecca Howard Elder __ Surfside Beach, SC Gabrielle Marie Nicolini Hilton Head Island, SC \r\nShaun Ryan Gambrel Greenville, SC +**Grady Alexander Nunnery Rock Hill, SC \r\n+***Megan McLean Gaston Simpsonville, SC Andrew Anthony Provenzano Greenville, SC \r\nMacchew Scoct Giles Taylors, SC Justin Lee Robercs Greenwood, SC \r\nDaniel Francis Gwosch Greenfield, MA Emery Keane Robinson Spartanburg, SC \r\nChristopher Craig Jackson Paterson, NJ **Kyle MacArthur Rusnak Norris, SC \r\n+**Thomas Patrick Kelley Newbury Port, MA **Daniel Christopher Teater Rocky River, OH \r\n+**Jan Lindsey Levinson Clinton, SC Lydia Ruth Van Steenburgh G reenville, SC \r\nCharlene Allyson Lloyd Malone, NY *Homer Bronn Wood Tiger, GA \r\n+**Katherine Marie Lukach Kingsport, TN \r\nLanguage and International Trade \r\n*Danielle Shenita Amador _______ Fort Polk, LA Alix Josette Lacelarie~ ________ Beziers, France \r\nBrianna Renee Apple Newton, NC *Caroline Drouin Laforge Oak Hill, VA \r\nStefan Joseph Bachman Greenville, SC Carolina Lombana Mauldin, SC \r\n+*Jennifer Leigh Bires Martinsville, IN James Ralph Matsinger, Jr. Maurepas, France \r\n*Allyn Lauren Bowers Cayce, SC Joseph Richard Matsinger Augusta, GA \r\nDeanna Catherine Chislett RedbC1nk, NJ +**T Cira Ann McQuistion Huntsville, AL \r\nAmy Elizabeth Culp Spartanburg, SC Melissa Anne Minock Greenville, SC \r\n*Sara Tressie Dudzinski Cary, NC *Laura Whitney Perkins Aiken, SC \r\nCarrie Anne Dunton Hartsville, SC *Ashley Maygarden Phelps Roanoke, VA \r\n*Elizabeth Ann Ernst Freeland, MD *Jessica Janes Rowe Hilton Head Island, SC \r\nAmy Marie Howell Summerton, SC *Robert Rhett Sansbury Ill Myrtle Beach, SC \r\nJames Edward Hunter Greer, SC *Wendi Dee Walker Greenville, SC \r\n*Jacqueline Sue Karpel Mountville, SC Jennifer Merrill Weston Surfside Beach, SC \r\n*Donald Score Kautz Charleston, WV *Phyllis Hei~Y i Yeung Greenville, SC \r\nNicole Maria Kresse Wihnington, NC Matthew Brady Zupan Columbia, SC \r\nModern Languages \r\n**Melissa Kathleen Bauld ________ PenJleton, SC +**Erin Lee McDavitt. ______ North Attleboro, MA \r\nJoni Renee Bogan Georgetown, SC *Kyle Chesser Roe Plano, TX \r\nJessica Dawn Hinkel Easley, SC Rachel Ann Stelzer Anderson, SC \r\n**April M. Ingalsbe Rome, GA *Amanda Lynn Wertz Cottageville, SC \r\nPhilosophy \r\n)>ired Landon Byrd~~--------~ Oallas, TX *AbigayleJoan McKinley ______ New Palestine, IN \r\nJonathan William Isbill C lemson, SC Joseph Owen Smith Greenville, SC \r\nRory Mavourneen Martin Midlochian, VA Christopher Jason Taylor Spartanburg, SC \r\nProduction Studies in Performing Arts \r\n**Dororhy Dean Camak~------- Anderson, SC *Susan JoAnn Simpson ________ Orangeburg, SC \r\n**Christin,1 Alexandra Collier Alexandria, VA Jarrod Jamaal Walker Greenville, SC \r\nDOUBLE MAJOR \r\nArchitecture and English \r\nRebl·bh Joy Morrah Birmingham, Ml \r\n15 "
    },
    {
        "page_number": "24",
        "text": "Communication Studies and Spanish \r\nKacie Elizabeth Thomas Sr George, SC \r\nHistory and Spanish \r\n+***Molly Catherine Ball Charleston, SC \r\nPhilosophy and Political Science \r\n*William Clayton Dillarcl, Jr. Columbia, SC \r\nPhilosophy and Production Studies in Performing Arts \r\n*Match.cw Roberc Lubnicwski S<llisbury, MD \r\nProduction Studies in Performing Arts and Sociology \r\n***Joshua D<lniel Collier Salem, SC \r\nBACHELOR OF SCIENCE \r\nConstruction Science and Management \r\nRuss Martin Braasch _________ Greenville, SC Anderson Alley Linder __________ Irmo, SC \r\nKathryn Reeves Brooks Clemson, SC Bradley Marcus Lynch Laurens, SC \r\nRus.sell Miller Brown Winnsboro, SC Joshua Adam McDermott Anderson, SC \r\nGregory Caleca Alexandria, VA Jia-Luen Lai Morris Chicago, IL \r\n*Brady James Cauthen Lancaster, SC Thomas Wilson Morrow, Jr. Greenville, SC \r\nRobert Roy Doppelheuer, Jr. Greer, SC Adam Desalcs Mudd LaPlata, MD \r\nRaymond Edward Duncan Ill Union, SC Edwin William Prescott 111 Laurens, SC \r\nSpencer Lane Foster Moncks Comer, SC Raymond Michael Prock Seneca, SC \r\n*Michael Troy Foushee Greenville, SC *David Christian Schambach Advance, NC \r\nStephen Kent Foushee Greenville, SC *Jarrett Miller Smith Aiken, SC \r\nAndrew Bryan Fraser High Point, NC Matthew Pennington Smith Columbia, SC \r\n*Jonathan David Graybeal Greenville, SC James Albert Sutherland, Jr. Huntington, NY \r\nSeth Michael Greene Anderson, SC +*Barbara Diane Tribit Mt Laurel, NJ \r\nC harles Floyd Hailey IV Rock Hill, SC Eloise Virginia Wall Atlanta, GA \r\nRobert Theo Harris Ill Seneca, SC Joseph Aaron Weis.sglass Charleston, SC \r\nEmily Christine Jordan Portsmouth, RI Travis Brandon Westmoreland Summerville, SC \r\nMatthew Daniel Kartanos Columbia, SC Jeremy Edward Whiteman Nelliston, NY \r\n*Trent Edward Lawhorn Midlothian, VA \r\nCOLLEGE OF BUSINESS AND BEHAVIORAL SCIENCE \r\nBRUCE YANDLE, Interim Dean \r\nBACHELOR OF ARTS \r\nEconomics \r\nLeslie Ann Finn=--.,.,.,------- San Diego, CA Todd Ward Pruette _________ Anderson, SC \r\nTimothy James O'Leary IV Gorl1an1, ME \r\nPolitical Science \r\n+***Richard Charles Beaulieu ______ Massena, NY Jessica Reyne Mitchell West Point, VA \r\nJarrod Matthew Bruder North Augusta, SC Kevin Michad Mulvaney Orange Park, FL \r\n+***Carla Michelle Cagle Canton, GA Louis Erik Powell, Jr. Greenville, SC \r\nLandon Paul Chandler Monroe, GA Rebecca K. Reynolds Rome, GA \r\nHenry Cooper Ellenberg II Alpharetta, GA Lori Michelle Rhodes Spartanburg, SC \r\nKenneth Craig Gerlipp West Islip, NY James Clayton Rogers Lake Toxaway, NC \r\n*Andrew Julian Gibbons Columbia, SC ***C<ttherine Diane Runion Simpsonville, SC \r\nMatthew Scott Giles Taylors, SC Aaron Leland Benjamin Scogin ____ North Augusta, SC \r\nAndrew Ross Hart West Chester, PA Tara Dorhea Simmons Toccoa, GA \r\nGeorge Daniel Jacobs, Jr. Gastonia, NC Kathryn Elizabeth Stoddard Greenwood, SC \r\n*Stephanie Frances Johnson Levictown, PA Andrew Thomas Stone Eustis, FL \r\n*Amanda Marie Kulcsar Myrtle Beach, SC Christopher Jason Taylor Spartanburg, SC \r\n**john Christopher Long Irmo, SC Roy Michael Thompson, Jr. Charleston, SC \r\nMatthew David Maxwell Lexington, SC Karen Robyn Trite Anderson, SC \r\nMandy Lee McCaslan Calhoun Falls, SC Erika Ashley Williford Anderson, SC \r\n*Todd Ryan McLean Newport News, VA *Caroline Ann Wingate Waxhaw, NC \r\nDanielle Angela Millard Mystic, CT \r\nPsychology \r\n**Kara Ann Adloff - ------- Blue Springs, MO Jessica Kathleen Dombrowski ______ Mt Pleasant, SC \r\n+***Jennifer Ann Alley Central, SC +*•Jessica Ann Farris Starkville, MS \r\nJennifer Susan Banks Columbia, SC Joanna Lee Fazio Newark, OH \r\n**Kimberly Ward Boozer Batesburg-Leesville, SC Katherine Leigh Fendley Fort Mill, SC \r\n+***Conney Ann Brenner Bcccendorf, IA Kelly Ann Finnegan Lawrenceville, GA \r\n*Hayley Whitson Brooks Virginia Beach, VA Emilie Elizabeth Ford Greenville, SC \r\nShon·unnc Nicole Brown Sumter, SC Heather Idell Graham Anderson, SC \r\n*Kristin Ann Bryanc North Augusta, SC **Mary Nell Green Gastonia, NC \r\nLmJsay Susan Bryant Mauldin, SC **Katy Lauren Gregg Clemson, SC \r\nRachel Marie Caslcn Belleville, IL **Wynona Rae Howard Six Mile, SC \r\n*Nicole Chrisrine Cononie Simpsonville, SC +***Erin Sloan Jenkins Carlisle, SC \r\nCha,I Christian Ct\"><1k Asheville, NC Bary Alys.sa Johnson Larchmont, NY \r\n16 "
    },
    {
        "page_number": "25",
        "text": "Psychology {continued) \r\nCameron Jancik· Jones Greenville, SC +***Laura Ann Singer -------- Wheeling, WV \r\n**Melinda Kristine Keith Springfield, VA *Jennifer Marie Starkey Milford, DE \r\n*Srer hanie Lynn Kerr Columbia, SC Sanders Dallas Tare Columbia, SC \r\nLindsey Lee Knlb Lexington, SC Elizabeth Renee Todd Kershaw, SC \r\n+**Molly Leigh Robertson McCullers ____ Acworrh, G A Laura Elizabeth Vernon _______ Winter H<1vcn, FL \r\nScott Michael McNeely York, SC +*Kennedy Campbell Watkins Ill Roanoke, VA \r\n*Derrick Jason Mulder Charlottesville, VA **Barbara Brooks Watson Greenville, SC \r\nMary Vermillion Pickens Spartanburg, SC **Lisa Christine Widener Aiken, SC \r\n*Paige Bh1ke Rogers C ht'tttanooga, TN *T ia Nicole Williams West Columbia, SC \r\nJanessa Tiffany Sanders Union City, GA +***Catherine N. Wood Cincinnati, O H \r\nAlisa Caro lyn Schanne Houston, DE *Christina Marie Wright Gaffney, SC \r\n*Kristen Lynn Schneider Long Valley, NJ Connie So Yee Yeung Charleston, SC \r\nJeffrey Elliott Simpson Pendleton, SC \r\nSociology \r\n+*Jennifer Leigh Bires _ ___ ____ Martinsville, IN *Abby Elizabeth Rucker _______ Simpsonville, SC \r\nDerck David G ilson Highlands, NJ Ashley Rae Slacum Lewes, DE \r\nCarson Gaillard Hanahan Seneca, SC Meghan Marie Tidd Simpsonville, SC \r\n*Amy Grace Hargctte Powdersville, SC Jenny Leigh Walker Westminster, MD \r\n*William Ryan Lyles Summerville, SC Tyler Bolt Warren Kingsport, TN \r\nAmanda Leigh Mattison Anderson, SC Charity A'mca Washington Swansea, SC \r\nMyra Martelle Morant Orangeburg, SC *Jennife r Lee Werkhoven Conway, SC \r\nMargaret Ann Morgan Charlotte, NC Andrew Roy Wolfe Taylors, SC \r\nAdam James Nickell C harleston, SC \r\nDOUBLE MAJORS \r\nCommunication Studies and Political Science \r\n**Jennifer G wynne Case _______ Charleston, WV Jason Rodney German ________ Mc Pleasant, SC \r\nEconomics and Mathematical Sciences \r\n+***Matthew Edward Collin Conway, SC \r\nEconomics and Political Science \r\nJames Richard Hartke ll Cinninatti, O H \r\nFrench and Political Science \r\n+***Megan Alicia Gajewski Myrtle Beach, SC \r\nFrench and Sociology \r\n+***Sterling Elizabeth Lee Alpharetta, GA \r\nHistory and Political Science \r\nLindsey Kay Marriott Columbia, SC \r\nPsychology and Spanish \r\n+•••Claire McCall Roof Lexington, SC \r\nSociology and Spanish \r\n+***Shannon Lee Michelle Day ____ Marietta, GA \r\nBACHELOR OF SCIENCE \r\nAccounting \r\n***Shelley Suzanne Barrett _______ Newnan, GA ***Ashley Danielle Price _______ Lake View, SC \r\nTimothy B. Benjamin, Jr. Waterloo, NY Elizabeth Moye Q uetti Sumter, SC \r\nJacob A lexander Carter Lexington, SC *Sara Kacherine Ramage Clinton, SC \r\n+**Thomas Rainsford Costigan Aiken, SC **Scephanie Jean Roberts Toccoa, GA \r\n**Bethany Ann Gillooly Maryville, TN Charlee Michelle Robinson C harlotte, NC \r\n*Beth LeAnn Goldie Anderson, SC Stephanie Rae Senn Clinton, SC \r\n*Mary Rebecca Heaton Kingsport, TN +*Lauren Viccoria Shuler Seneca, SC \r\n***Kelly Dianne Henderson North Granby, CT *Bethany Shay Simpson Cowpens, SC \r\nBradley Davis Hewett Fountain Inn, SC *Krisra Marie Sonnefeld Monkton, MD \r\n***Franchele Marie Klaus Pepper Pike, OH +***Katherine Louise Stewart Mt Pleasant, SC \r\nBenjamin Graham McLean C lemson, SC *Kristin Elise Stouffer San Antonio, TX \r\nAdam Spaugh Neely Columbia, SC Jakitta Webb Sullivan Opelika, AL \r\n***Cassie Marie Owens Fountain Inn, SC Carey Thomas Towne Charleston, SC \r\n+*Lynsey Dianne Parker Smoaks, SC *Lindsey Brooke Williamson Marion, SC \r\nDavid Stanley Perkins Ill Mullins, SC \r\n17 "
    },
    {
        "page_number": "26",
        "text": "Economics \r\nRyan Sutton Broome __________ Sumter, SC *Jason Timothy Kunkel ________ Greenville, SC \r\nPerer Alan Brown Greenville, SC Charles Duscin Mancini Greenville, SC \r\nJon Fredric Chrisciansen Greenville, SC Kenneth Robert McQuiddy Wil\\iamscon, SC \r\n+**Ancuta Eugenia Cojoc Bistrita, RomCJnia Patrick Brian Score O'Toole Pittsburgh, PA \r\nMacchew James F\\C(cher Taylors, SC **Adam Timochy Pope Spart<inburg, SC \r\n*Victoria Mieko Freihofcr Mcrrim<ick, NH +***Megan Martha Reed Greer, SC \r\n+**Kevin Colby Harvel Aiken, SC Mark Trent Repokis Halifax, VA \r\n*Jonathan David Hill Sparrnnburg, SC ***Sara Jeanne Stanley Columbus, OH \r\nPaul Robert Huguley Myrtle Beach, SC Sarah Elizabeth Swindle Homewood, AL \r\nAndrew John Jurasin Wethersfield, CT Joel Chriscopher Thiry Stevens, PA \r\nFinancial Management \r\nAngela Denise Ammons Greer, SC Joel Benjamin Jennings _________ Laurens, SC \r\nLaurie Denise Ashley Honea Path, SC Erik David Johnson Vienna, VA \r\n***Shawn Everecc Becker Myrtle Beach, SC Rebecca Jean Kahle Greer, SC \r\nLauren Marie Bellanca Greenville, SC Michael Andrew Kessler Mariecca, GA \r\nNicolas Kyle Berry Greenville, SC +*Scott Thomas Key Knoxville, TN \r\nJames Ernest Boatwright IV Charleston, SC Shawn C. Kicklighter North Charleston, SC \r\nAndrew Tilden Boland Atlanta, GA Charles Edward Kirven Windermere, FL \r\nAndrea Maria Bostic Greenville, SC Daniel Jonathan Lacher Timonium, MD \r\nJoshua Allen Brooks Holly Hill, SC Jonathan Russell Laible Herndon, VA \r\n+**Leslie Anne Browne Moncks Comer, SC Michael Scoct Lippiatc Anderson, SC \r\nDavid Bradley Cashwell Columbia, SC **Tayler Elyce Maxwell Orlando, FL \r\nCraig Ryan Condon Charleston, SC +*Ronald Glenn McCoy lJ Sumter, SC \r\nJacob Alexander Crawford Peak, SC Luke Ryan McKenney Ashburn, VA \r\nEstephanie Desiree Crowder Aiken, SC *Joseph William Morgan Conklin, NY \r\n+*William Wayne DesChamps III ___ Murrell's Inlet, SC Adam Spaugh Neely Columbia, SC \r\nDarbie Ann Dickert Knoxville, TN Jennifer Cordell Osborn Easley, SC \r\n*Daniel Stewart Dickinson Sumcer, SC ***Cassie Marie Owens Fountain Inn, SC \r\nNina Jerretta Dicks Hemingway, SC Gregory Alan Pavao Annapolis, MD \r\nBricrney Shae Diseroad Martinsville, IN Rachel Lauren Prescott Sumter, SC \r\nJeffrey Charles Martyn Earley Taylors, SC *Sara Katherine Ramage Clinton, SC \r\n*Elizabeth Joann Ferner Pensacola, FL *Jacob Robert Rauch Myrtle Beach, SC \r\n+**Erin Suzanne Finley Easley, SC Curtis Clyde Rea Lexington, SC \r\nJoseph Stephen Flagg Seneca, SC Michael David Ready Seneca, SC \r\nSamuel Mason Foster Greenville, SC Ashley Scewart Reeves Greenville, SC \r\nKristen Marie Fredrick Fort Mill, SC William Dean Reeves Ill Suwanee, GA \r\n*Benjamin Bayard Gaines Lafayette, LA +**Monika Ryba North Myrtle Beach, SC \r\n+*Kathleen Elizabeth Gilbert Wilmington, DE Matthew Henry Sanders Edisto Island, SC \r\n+***Macthew Joel Gilreath Winnsboro, SC Andrew Powell Scott Florence, SC \r\nKathleen Ann Griffith Aiken, SC Elizabeth Marie Short Orange, VA \r\n***Jonathan Mitchell Groom Taylors, SC Shannon Alexis Simpson Shelby, NC \r\nTyson Glenn Haefele Rock Hill, SC Marcus Trey Sneed Fairfield, OH \r\nAdam Joshua Hammond Simpsonville, SC Bradley Patrick Stoehr Moore, SC \r\nWilliam Travis Harper Columbia, SC *William Jennings Stogsdill III Wheaton, IL \r\nLacy Rena Hilley Lowndesville, SC *David Elliott Stroup Charlotte, NC \r\nTammy Nguyen Hoang Rock Hill, SC *Jonathan Robert Wallace Stone Mountain, GA \r\n*R. Herrin Hood Spartanburg, SC Damian Dem\" Walls Rock Hill, SC \r\nJohn Patrick Howard Fairfield, CT Lacey Miranda Wilson Seneca, SC \r\n**Sarah Elizabeth Hyder Landrum, SC *Allen Bradley Wise Blythewood, SC \r\nWilliam Michael lzykowski New Providence, NJ Jason Ddvid Zimmerman Fort Mill, SC \r\nGraphic Communications \r\nVernon Clifford Alexander _______ Loganville, GA Jeffrey Troy Kimble ____________ York, SC \r\nPaul Davidson Allred York, SC Leigh Anna Kluttz Charlotte, NC \r\nErik Leigh Anderson Hilton Head Island, SC Lindsay Rebecca Limbaugh Easley, SC \r\n*Heather Marshay Bond Laurens, SC James V Messner Wilton, CT \r\nWilliam Laurens Bruce Anderson, SC Chriscopher George Mevers Charleston, SC \r\nRonald Christopher Bryant Roanoke, VA Leah Nichole Moore Anderson, SC \r\nChristopher Paul Campbell Pawley's Island, SC *Haley Leigh Morris Isle Of Palms, SC \r\n+*Ronatta Daphne Carter Britten's Neck, SC Robert Ernest Povelones Columbia, SC \r\n***Margaret Ann Childers Snellville, GA Jordan Lee Powell Spartanburg, SC \r\nAshley Falls Churm North Augusta, SC *Stacey Lynn Riley Ridgeville, SC \r\n*Ashley Leigh Craddock West Columbia, SC Christopher David Schmidt Columbia, SC \r\n*Olivia Anne Crane Mt Pleasant, SC Imelda Michelle Tuazon Sebastian Anderson, SC \r\n*Lauren Virginia Earle Spartanburg, SC Alyssa Joy Siders Anderson, SC \r\n*Kimberly Lynn Flores Columbia, SC Brieann Nicole Wade Cinannati, OH \r\nMichael Bradford Freeman, Jr. Greenville, SC Megan Anne Waller Columbia, SC \r\nJudson Lee Gibbs Mullins, SC +***Jessica Louise Westbury Harleyville, SC \r\n*Tanisha Evette Givens Ehrhardt, SC *Lacy Elizabeth White Beaufort, SC \r\nKemrey Lee Heinold Leominster, MA Adrienne Renee Williams Ridgeway, SC \r\nTravis Andrew Ikerd Columbia, SC \r\nIndustrial Management \r\nJustin D,miel Cameron--,-------- Pasadena, MD Ryan Stephen Lawson~--------,--, Aiken, SC \r\nCmneron Scenstrom Knight Columbia, SC ***Donald Andrew Parkhurst Alpharetta, GA \r\n18 "
    },
    {
        "page_number": "27",
        "text": "Management \r\nPhilip Richard a'Bi.:ckct Scverna Park, MD **Nina Lewis Holman _________ Shelby, NC \r\nS.irah F:1lima Ahmed Greer, SC Lindsay Renee Houck Hagersrown, MD \r\nTh;1nkg\\xl Chukwumcka Alcruchi __ Pon Hacoun, Nigl'ria Amanda Mclora Huttn Denmark, SC \r\nJeffrey Mich;1cl Andres Beaufort, SC Rebecka May Anne lurzi Clare, Ml \r\n***Stephanie Amber Askew Fishers, IN Ashley Elizabeth Kinsey Murrell's Inlet, SC \r\n*Cody Tipton Bair Chapin, SC Catherine Leigh Koonce Rock Hill, SC \r\nPatrick Lee Barnett Fort Mill, SC Jennifer Marie Koonce Rock Hill, SC \r\nThomas Gill Beck Alpharetta, GA *Rita Mt1ureen Lewis Bradenton, FL \r\n*Helena Alcsy<1 Belskaya Summerville, SC Nikolaus Matthias Lischerong Spartanburg, SC \r\nEric Matthew Boettner Raleigh, NC Michelle Lydia Lozano Columbia, SC \r\nJoseph Ronald Brnnch II Boone, NC James Tristan Lynn Easley, SC \r\nR.mdall Ellis Brooks, Jr. Columbia, SC Jason Scott Maxwell Atlanta, GA \r\nLara Pauline Brophy Branford, CT T crrance Lamonza McD,miel Gray Court, SC \r\nEJward Arlington Brown II Irmo, SC *Kelli Marie McKinney West Union, SC \r\nJonathan Alexander Calder Salem, VA Timothy David Morrow Charlotte, NC \r\n*Robert Clayton Cannon Marietea, GA *Shannon Bech Myers Augusta, Ml \r\nBradley Hugh Cantrell Sumter, SC ***Gisele Lima de Oliveira Porco Alegre, Brazil \r\nBenjamin Johnson Carpenter Ann Arbor, MI Thomas Albert Peery Tazewell, VA \r\nWilliam Wyman Clanton Columbia, SC James Paul Perkins Richmond, VA \r\nAndrew Charles Coleman Greenville, SC Kelsey Lea Perkins Hinsdale, NH \r\nThomas Ry;m Dacus Simpsonville, SC William Shane Perry Chester, SC \r\nScott McCray Davies Alpharetta, GA *Vaneishia Nicole Rainey Anderson, SC \r\nJonathan L. Davis Orangeburg, SC Alex Todd Ratcliffe Simpsonville, SC \r\nMichele Leigh Davis Piedmont, SC Christina Noelle Reinhard Fairfax, VA \r\nMichael Luis DeCespedes Fort Lauderdale, FL **Kristin Nicole Retallick Irmo, SC \r\n+Timothy Warren DcMint Greenville, SC Warren Clark Richardson Houston, TX \r\nJohn Franklin Dobbins Marietta, GA Benjamin Wells Robertson Alpharetta, GA \r\nJimmy Lee Dodgens 11 Pickens, SC Thomas Charles Roebuck Columbia, SC \r\nNathan Ross Duncan Greenville, SC Kyle Boyce Rogers Greenville, SC \r\nChristopher Ryan DuRant Gable, SC Petra Schneemann Greenville, SC \r\nJoie Tramane Eison Pacolet, SC Charles Hampton Sellers 11 Columbia, SC \r\nCharles Allen Eldridge Greenville, SC Thomas Clifton Sharpe Albany, GA \r\nDaniel Wylie Faris Rock Hill, SC Brenston Wayne Sharperson Orangeburg, SC \r\nTimothy William Farren Westwood, MA *Warren Blake Simpson Anderson, SC \r\nKristine Nicole Faryniak Allentown, PA Dennis Randall Smith Hartsville, SC \r\nMary Katherine Flynn Gainesville, FL *Blair Humphreys Taylor Batesburg-Leesville, SC \r\nJohn Edward Fostyk Pittsburgh, PA *Bradley Fraser Thompson Arnold, MD \r\nLindsay Ann Franklin York, SC Grant Edward Turner Powdersville, SC \r\nMichael Albert Garcia Mclean, VA Richard Christopher Vaughn Atlanta, GA \r\nPreston Tyler Godfrey Spartanburg, SC **Kimberly Denise Weber Pedricktown, NJ \r\n**Britt McKensie Harling Anderson, SC Angela Dawn Webster Anderson, SC \r\nAlexias Danielle Harrison Columbia, SC *Morgan Carter Webster Summerville, SC \r\nEmory Guy Hendrix, Jr. Rock Hill, SC Angela Suzanne Wilson Inman, SC \r\nCorey Lee Herndon Easley, SC Christopher Guy Workman Spartanburg, SC \r\nTerry Allen Hildebrand West Columbia, SC \r\nMarketing \r\nAmanda Rose Algiere ----------,~ Easley, SC Holly Lea Enterline __________ G reenville, SC \r\nMaria Elena Azpurua Gainesville, FL **Blair Elizabeth Eskew Simpsonville, SC \r\nMeredith Brooke Bado Burke, VA Quartise Darmeil Farr Piedmont, SC \r\n*Jenny Nicole Barber Gastonia, NC *Melis.sa Ann Finnell Charleston, SC \r\nLaura Lee Barefoot Charlotte, NC Molly Laura Gardner Knoxville, TN \r\n**David Michael Beebe Birmingham, AL Brian Patrick Gilreath Winston~Salcm, NC \r\nJeffrey Michael Bertges Fort Mill, SC Philip Charles Gilsdorf Atlanta, GA \r\nLaura Kathryn Bickley Lexington, SC +•David Allen Goebel Willoughby, OH \r\n*Eric Michael Boice Seneca, SC *Monica Lynn Guertin Alpharetta, GA \r\nMichael Brian Bolling Willingboro, NJ Jeffrey Allen Hahn Winchester, VA \r\nRyan Patrick Bonner Charleston, SC *Layla Renee Hakamiun Charleston, SC \r\nJennifer Lynn Brown York, SC Margaret Elizabeth Harp Hamilton, OH \r\nKristin Blair Brown Windemere, FL Brian Donald Harwood Atlanta, GA \r\nMark Andrew Bunnell Florence, SC •••Ashley Joy Hesseltine Smyrna, DE \r\nEmily Anne Caggiano Spartanburg, SC Ashley Allison Hoffman Burke, VA \r\nJeremy Phillip Carter Cayce, SC Christopher Andrew Hogue Myrtle Beach, SC \r\nRobert James Carter Fort Mill, SC +*Ashley Erin Holloway Myrtle Beach, SC \r\nJennifer Leigh Champa Stone Mountain, GA Meredith Ann Inabinet Charleston, SC \r\nWilliam Dial Choate Columbia, SC Kay Ellen Johnson Columbia, SC \r\nC mie Elizabeth Clark Johnston, SC Stephanie Threse Johnson Indianapolis, IN \r\nKristin Emily Competicllo Atlanta, GA Eric Chambers Johnston Columbia, SC \r\n••April Lane Cook Greenville, SC Benjamin Ray Jones Seneca, SC \r\n+••Lauren Elizabeth Cooney Coral Springs, FL Caroline Elizabeth Jones Batesburg-Leesville, SC \r\n***Casey Anne Coppedge Winter Park, FL +***Alexis Anne Kaylor Mt Pleasant, SC \r\n*Jes.sic::1 Elaine Croxton Kershaw, SC *Carrie Denise Kendrick Columbia, SC \r\n**Erin Lindsay Curtis Marictea, GA Kendall McCreight King Easley, SC \r\nJulia Duvall DesChamps Bishopville, SC *Justin Taylor Kistler Greenville, SC \r\nKelli Lee Donald Woodruff, SC *Katherine Anne Klein Greenville, SC \r\nLindsay Barnard Donaldson Alexandria, VA +***Kristina Marie Krzyzanowski Seneca, SC \r\n*Kristina Michelle Downing Summerville, SC Catherine Lynn Lacey Annapolis, MD \r\n19 "
    },
    {
        "page_number": "28",
        "text": "Marketing (omtinued) \r\nWhitney NL·.11 Livingston----------,-- Chapin, SC \r\n+***Chrbrine Marie Long Bcllbrn1.1k, OH \r\nJohn Davis Riner..,.-.,,..-,---------- Florence, SC \r\nCatherine Eliz;1bcth Roberts Greenville, SC \r\nHaley ArtiL' Lnwry West Point, MS *Ansley Ewing Rohcrtson Lancaster, SC \r\nLinds;1y T1ylnr M.11.:Phcrsnn Roswell. GA Ashley Brown Roe Charleston, SC \r\nAshley Ryan Major Grccnwcxx.I, SC Hunter Ramey Sadler Flnrencc, SC \r\nDrew Sunlcy Markel Richmond, VA Andrew I. Saul it is, Jr. Annandale, VA \r\n*Erin Lynne Mathis Rock Hill, SC Jessica Lee S;1villc Vienna, VA \r\n**Kristie Ann McAuley An<lerson, SC Brittany Dreher Sencrius Anderson, SC \r\n*LinJs;ty Anne McKenney Sylvania, OH **Kristen Michelle Shook Hickory, NC \r\n*Krislic Michelle Mc Taggart Wesr Columbia, SC **Corey Ty Landon Smirh Avoca, NY \r\nNapoleon Mcleon, Jr. Inman, SC Adam Howard Snelling York, SC \r\nZachary Betts Oakley Clemson, SC Michael Albert Stein Anderson, SC \r\n*Joan Bollin Oliphant Rock Hill, SC +**D,miel Gregory Stemann White House, TN \r\nNan Carol Palmer Waynesboro, GA Kimberly Jean Sumner Laurens, SC \r\n*Katie Ngoc Pham Rock Hill, SC ***Kimberly Mariko Tanaka Las Vegas, NV \r\nMmrhew Joseph Pimcmel An<lover, MA Caroline Cour Thompson Greer, SC \r\nAndrew Joseph Poltorak Chmlotce, NC *Caroline Virginia Thun Swansea, SC \r\nRussell Ray Ports, Jr. Sumter, SC Joshua Robert White Weaverville, NC \r\nAmanda Leigh Price Newberry, SC *Ashley Elizabeth Willis Rock Hill, SC \r\nElizabeth Lee Price Sr Albans, WV Thomas Warren Windsor Lewes, DE \r\nRobert Daniel Pritchard Hartsville, SC *Sarah Christine Wright Blythewood, SC \r\nMatthew Robert Regis North Billerica, MA Derrick Lee Wyatt Liberty, SC \r\nAdam Timothy Rice Weaverville, NC Jessica Lynn Wyatt Boiling Springs, SC \r\nPolitical Science \r\nDenita Vonique Benson _________ Seneca, SC **Robert Edward Lowery _______ Rock Hill, SC \r\n*Lauren Elisabeth Clipp Clemson, SC *Heather Marie Rice Pittsburgh, PA \r\n*Christopher Ryan Gahagan Conway, SC Elizabeth Anne Steele Walpole, MA \r\n+**Jude Thomas Hickland Stilcm, NY Tamara Leigh Yoder North Augusta, SC \r\nJoseph Charles Krella Springboro, OH \r\nPsychology \r\nAshley Marie Alden Summerville, SC D,miel Patrick Harris __________ Seneca, SC \r\n*Kathleen Jean Becht Irmo, SC Jordan Elizabeth Hawkins Decatur, IL \r\nKarla Ashley Birkel Simpsonville, SC Allison Elizabeth Keck Palm Harbor, FL \r\n**Laura Ashlyn Boyd Clover, SC *Kelly Michelle Latham Anderson, SC \r\n*Kristen Janine Boynton Norrh Augusra, SC *Christopher A. Merchant Fairfax, VA \r\nLara Pauline Brophy Branford, CT *Cheryl Rose Mihalovits Hartsville, SC \r\nDemetria Evelyn Brown Fort W'5hington, MD Erin Elizabeth Moorhead Blacksburg, SC \r\n**Whitney Brooke Bryan Easley, SC +*Joseph Brian Mulvihill New Milford, NJ \r\nBates Lee Cagle Aiken, SC Jennifer Alexis Nichols Indianapolis, IN \r\n**Ann McDowell Calloway Sumter, SC *Meredith McKenzie Orten Hopkinsville, KY \r\nCaroline Elizabeth Carson Ccncrnl, SC Gregory Barrett Paquetce Fairfax Scation, VA \r\nMichael Patrick Cassady Cincinnati, OH *Judy Thi Pham Piedmont, SC \r\nLaura Elizabeth Challenger Greer, SC *Sara Kathleen Prothro Manning, SC \r\n**Erin Seibert Craft Greenville, SC ***Melissa Anne Redfearn Chesterfield, VA \r\nKirsten Lynn Cramer Clemson, SC Jovetrice Shadonna Rubin Bishopville, SC \r\nAshley Caroline Crawford Powhatan, VA Amanda Joy Scheetz Easley, SC \r\n+***Travis Wilson Crook Kingwood, TX Evan Adam Smith Charleston, SC \r\n+*Maggie Michael DeHart Sumter, SC Taslrne Monique Tate Allendale, SC \r\n+*Marcie Anne Eubanks Knoxville, TN Michael Vincent Teramano Travelers Rest, SC \r\nKristin Ann Fahy Augusta, GA Alfred Thomas, Jr. Choppee, SC \r\nMatthew Anchony Fiorello ____ Palm Beach Gardens, FL *Jennifer Ann Turchi Springfield, VA \r\nCandle Marie Fogle Blythewood, SC *Adam Ali Valipour Piedmont, SC \r\nKirk Rollins Freeman Greenville, SC Patci Louise Vegella Germamown, MD \r\nDavid Christopher Garrison, Jr. Easley, SC Jennifer Christine Wiggins Fork, SC \r\n*Valerie Dalrymple Gaughen Palm Harbor, FL Danielle Alicia Woods Georgetown, SC \r\nByron Thomas Guffee Pendleton, SC +*Dulcinea Evangelista Yabut Charleston, SC \r\nJohn Frederick Hamrick, Jr. Pelzer, SC *Britanie Leigh Younginer Columbia, SC \r\nSociology \r\nKevin Joseph Callis --------~~Lexington, SC Christy Marie Mills ___________ Greer, SC \r\nJulie Ann Conrad Summerville, SC Emily Nichols Mills Blair, SC \r\nBrian Edward Gibson Easley, SC Kenya Renee Nelson Greenville, SC \r\nTia Alexis Hill Sumter, SC *Jessica Leigh Reinhardt Edgemoor, SC \r\nKelly Ann Howard Greenville, SC Brian Lee Tull Naples, FL \r\n*David Keirh King, Jr. Lexington, SC *Elim beth Gail Whitfield Anderson, SC \r\n*Jennifer Christine Litde T<lylors, SC \r\n20 "
    },
    {
        "page_number": "29",
        "text": "COLLEGE OF ENGINEERING AND SCIENCE \r\nTHOMAS MICHAEL KEINA TH, Dean \r\nBACHELOR OF ARTS \r\nChemistry \r\n+***M<Hg~1rer Martin Brown ______ Columbia, SC Jon Paul Rayburn Hooks ________ Houston, TX \r\n+**Rebecca Anne Carino Simpsonville, SC John Cmnpbcll Lake, Jr. Ware Shoals, SC \r\nLeslie Loren Davis Newberry, SC \r\nComputer Science \r\nViccor Hein, Ren Chen ________ Greenville, SC Julio Enrique Saldana --------- Beaufort, SC \r\nMathematical Sciences \r\nJulie Coin ____________ Amiens, France Andre Rashad Thornhill _______ Summerville, SC \r\n*Francesco N. Monrerisi, Jr. Tryon, NC Lucia Marie Welch Dallas, TX \r\n+**Caleb Michael Rogers Greer, SC \r\nBACHELOR OF SCIENCE \r\nBiosystems Engineering (Biosystems Engineering is jointly administered by the College nf Agriculture, Foresty, and Life Sciences \r\nand the College of Engineering and Science.) \r\n+*William Joseph Allen _______ Midlothian, VA Patrick Edward Kennedy ________ St Louis, MO \r\n***Meredith Stilwell Amick Gilbert, SC Bryan Edward Koharc Florence, SC \r\n*Stephanie Lorraine Arnold Fort Mill, SC Nicolas Robert Koontz Bethlehem, PA \r\nGareth Carl Avant Walterboro, SC William Frederick Lamb, Jr. Columbia, SC \r\nBenjamin Mark Hammond Anderson, SC Derek Marshall Little Claysville, PA \r\nMary Elizabeth Honeycutt Fort Mill, SC +***Elyn Aimee McBride Findlay, OH \r\n+***Bethany Rose Hom Florence, SC +***Melissa Jane Nicosia Midlothian, VA \r\nMichael Adam Hucks Lexington, SC William Arthur Rector Rock Hill, SC \r\n+**Matthew John Huyser Holland, Ml Lauren Talbot Schmelter Mt Pleasant, SC \r\n+***Richard Andrew Jamison Fort Mill, SC +*Xiaoyi Lilia Wang Huntsville, AL \r\nCeramic and Materials Engineering \r\nNatasha Rodricka Boyd ________ Greenville, SC **Robert Jeffrey Luschek ________ Alexandria, KY \r\n+***Erin Lynn Gross Lexington, SC *Jennifer Diane Zawislak Pawley's Island, SC \r\nMitchell Henry Harrison Kadel York, SC \r\nChemical Engineering \r\nMatthew Edward Blackstone ________ Easley, SC Alethia Renee Melody ________ Greenville, SC \r\nCurtis Edward Bollinger Rock Hill, SC Jacqueline April Moseley Conyers, GA \r\nKimberly Ann Busam Smithfield, RI Valerie Magdaluyo Navarro Weaverville, NC \r\nVeronica Carneiro Fernandez Panama, Panama Whitney Andrew Owens Marion, SC \r\nJason Dean Conner Mauldin, SC Michael David Pool Beaumont, TX \r\nFranklin Sol Dempsey Beaufort, SC *Sarah Elizabeth Proulx Clemson, SC \r\nCarmen Chriscy Eleazer Elgin, SC +*Scephen Clincon Robnett Camon, GA \r\nSarah Elizabeth Gottlieb Westborough, MA *Aaron Jacob Rugh North Augusta, SC \r\nLindsey Rae Haywood Rock Hill, SC *Brandon Keith Summey Greer, SC \r\nCameron Rogers Kirkpatrick Dulurh, GA +*Brian Wesley Thompson Simpsonville, SC \r\n+*Michelle Lee Malecha Fairmonr, MN Michael Blair Wesc Union, SC \r\nMargaret Mae McAlister Easley, SC *Joshua Carroll Yon Perry, SC \r\nMelissa Ann McAllister Fayetteville, NC Thomas James Zubrzycki, Jr. Hilltop, NJ \r\nChemistry \r\nChristopher Shane Burdette -------,---Iva, SC +**William Clary Floyd 111------~~ Chester, SC \r\nLaShonda Tanika Cureton Lancasrer, SC *Hcacher Anne Pillman Greenwoal, SC \r\nAlbert Demaine Dukes Ill Winnsboro, SC Jennings Palmer West Greenwood, SC \r\nCivil Engineering \r\nNathan Edward Quilling Allen ______ Columbia, SC Young T. Nguyen Conway, SC \r\nJonathan Nolan Ard Easley, SC Daniel Lee Perry Chapin, SC \r\nChad Christopher Bacote Darlington, SC Gene Earl Pierce Ill Columbia, SC \r\nRobert Glenn Blackwell Hanahan, SC ***Clayton Chandler Pucnam ____ Kings Mountain, NC \r\n*Matthew Ryan Broderick Greensboro, NC Jason David Rabon Lugoff, SC \r\nLauren Anne Brown Myrde Beach, SC ***Nellie Elizabech Ramsey Sharon, SC \r\n+***Duncan Burnerre Bryant Cheraw, SC David Chadwick Reynolds Aiken, SC \r\nAnne Elizabeth Burkhardt Chesterfield, VA Laurie Marie Rhodes Isle Of Palms, SC \r\nTabitha Ashley Caldwell Columbia, SC Joel Clinton Riley IV Saluda, SC \r\nJeffrey Michael Davis Germantown, MD Ian Douglas Rish Lexington, SC \r\nMichael Gary DuPre II Moncks Comer, SC John Hill Rogers, Jr. Greenville, SC \r\n**Thomas Alan Faulkner Smyrna, SC Chriscopher John Rowe Fairhope, AL \r\nDavid Jordan Hosretler Charleston, SC Daniel Warren Royscer Anderson, SC \r\nRoberr Taylor Irwin Lawrenceville, GA Justin Benjamin Ruh Westerville, OH \r\nDaniel Hale Johnson West Columbia, SC Kelly Marie Rutkowski Herndon, VA \r\n*Michael Robert Klink Hilton Head Island, SC David Anthony Satter Piedmont, SC \r\nLindsay Nicole Keeper Hanahan, SC +***Mact John Schuster Bernard, IA \r\nJames Brandee Milner Aiken, SC Greacon Wesley Sellers, Jr. Mc Pleasanc, SC \r\n&ibby Curtis Moore II Conway, SC Jonathan David Shick Aiken, SC \r\n21 "
    },
    {
        "page_number": "30",
        "text": "Civil Engineering (continued) \r\n+**NLnthi.:w Adam Turner _______ Oak Ridge, TN McLean Andrew George Wilson _____ Mt Pleasant, SC \r\nSteven Kyk Vickery Rock Hill, SC \r\nComputer Engineering \r\n*Mich;1cl F<1him Fbssily _______ Simpsonville, SC Frank Simon Jasen III _________ Lexington, SC \r\n+*Jasnn Thum;1s &x1ycott Pitman, NJ Mntthew Stuart Jen.Ian Irmo, SC \r\nPhilip O'Brien Brnoks Ch;1rleston, SC +***Karsten Lewis Lowe Scorcsboro, AL \r\nArie Rrent Cowart Clover, SC +***Mich;-1cl Rudder Masse Milledgeville, GA \r\nJl)shua Graham Dragstcdt Sumter, SC Brian Thomas Miller Tega Cay, SC \r\nThomas Wilson Epton Seneca, SC Midrncl Alan Misiaszek Columbia, MD \r\nRyan Christopher Garlington Greenville, SC Michele! David Payne Hanahan, SC \r\n+*David Alan Glandon Greer, SC Russell Jeffrey Pearce Greenwood, SC \r\n+*Jonathan Ch<lrles Goforth Greenwood, SC Jason Charles Sampers Fort Mill, SC \r\nNathan Erick Gorrman Irmo, SC *Brandon Duane Smith Pelion, SC \r\n+***Thomas William Grooms Aiken, SC **Joel Gregory Stcelmnn Newton, NC \r\nDouglas Russell Harris Goose Creek, SC Jonathan David Tate Taylors, SC \r\n*Eric Benjamin Holcombe Knoxville, TN Anthony Dwayne Williams Irmo, SC \r\n***Brian Michael Holland North Augusta, SC +**Jeffrey Scott Young North Augusta, SC \r\n**Matthew James Ivester Easley, SC +**Joseph Mark Ziska Dover, DE \r\n+***Peter Joseph James Teg<l Cay, SC \r\nComputer Information Systems \r\n*Joseph Allen Boone _________ Charleston, SC Cindy Balinda McLeod _________ Seneca, SC \r\nMelvin Carson, Jr. Huger, SC Diana Louise Rambo Spartanburg, SC \r\n*Katherine Elizabeth Gerken Charleston, SC +***Thomas Edward Rappold, Jr. Roanoke, VA \r\nKevin Michael Johnson Winnsboro, SC +**Punit Krishna Sech Charleston, SC \r\nTravis Jerome Johnson Greenville, SC Tawanna Travice Starks Atlanta, GA \r\nStephanie Alaine Larson Westfield, NJ Ronald David Wilson Pickens, SC \r\nCorey Ames McClelland Bradenton, FL \r\nComputer Science \r\nLisa Sharesha Aiken Orangeburg, SC Andrew Montgomery Harper----- Georgetown, SC \r\nJames Frederick Leonard Baker Middlebury, CT +***Jacob Monroe Hicks Florence, SC \r\n*James Christopher Bardoner ____ Signal Mountain, TN Ian Burton Hollenbaugh Georgetown, SC \r\n+*Ashley Elizabeth Barnett Simpsonville, SC ***Kevin Hai,Ping Huang Charlescon, SC \r\nKenneth Blake Bevard Oak Ridge, TN Perry Christopher Jacobs Marshfield, MA \r\n+**Laurie Dawn Brannon Anderson, SC R. David Liebers Jamestown, NY \r\nDaniel Dante Brown Greenville, SC Thomas James Linton Greenville, SC \r\n+*Harry Cho Cantey Aiken, SC +**Matthew Bryant Mabus Greer, SC \r\nJill Marie Constante Chapin, SC James Robert Morefield Abingdon, VA \r\n***Andrew Thomas Culclasure Riverview, FL James Paul Mullinnix, Jr. Greenville, SC \r\nEzekiel Cuttino, Jr. Atlanta, GA +***Michael Andrew Murphy Greenville, SC \r\n+***John Randolph Dabney, Jr. Greer, SC Christopher Terrence Myers Columbia, SC \r\nScoct Martin Duckworth Acworth, GA Julius Essexs Robinson Seneca, SC \r\nTiras De'Censa Eaddy Florence, SC Darius Mahmood Samii Landenberg, PA \r\n*Andrew Habib Eli ya Greenville, SC Joshua Price Snelling Aiken, SC \r\n*Daniel Christian Ellis Greenville, SC *James Edward Williams, Jr. Florence, SC \r\nFred Hodge Gamble, Jr. Kingstree, SC Kelly Dean Wahlman Whittier, NC \r\nBenjamin Patrick Griner Charleston, SC Shi Ii Zheng Greenville, SC \r\nElectrical Engineering \r\n+**Andrew Mark Adams ________ Chapin, SC Tou Lee------------ Spartanburg, SC \r\n***Darren Edwin Aiken Loris, SC Andre Montrell Manning Dillon, SC \r\nDavid Lapsley Barron Merritt Island, FL Kenneth Joel Mason Westminster, SC \r\nBrian Jones Bowen Columbia, SC Matthew Ryan McCammon Greenville, SC \r\nJonathan Leigh Bristol Brevard, NC ***Casey Nathaniel Morgan Belton, SC \r\nHassan Ali Dbouk Tyre, Lebanon Charles Steve Nalley, Jr. Greenville, SC \r\nRobert Gregory Elmore Piedmont, SC Han Bao Ong Clemson, SC \r\nJose Rafael Figueroa Greenville, SC Brian Andrew Parks Lexington, SC \r\n+*John Curtiss Fox Summerville, SC Joseph Wade Richards Camden, SC \r\n*Justin Kyle Gainey Hartsville, SC **Adam Douglas Rivet Fort Mill, SC \r\n*George Martin Gilchrist III Orangeburg, SC +*Michael Lawton Rodin amestown, SC \r\nDouglas Donavon Greene Greenville, SC +***Adam Wesley Schreiber Landenberg, PA \r\nSamuel Benjamin Orville Harris Landrum, SC Ian Brewster Smith Lancaster, PA \r\nRamon McCabe Hayes Chapin, SC Scott Davis Smith Myrtle Beach, SC \r\n*Cory Jake Hudson Dayton, OH Andrew John Szymke Alpharetta, GA \r\n+***Jay Marcus Hunsberger Asheville, NC **Satoshi Takeshita Greenville, SC \r\n+***Dwight Keith Hutchenson Kemblesville, PA +***Vijay Nayak Ulla! Mt Pleasant, SC \r\nSara Laws Hutchison Annapolis, MD Phuong Van Vo Greenville, SC \r\nStephen Michael Knox Forest Lake, MN *Donald Ray Webb Marshall, NC \r\nBenny Tyrone Lee Florence, SC Zanthia Marquita Wolfe Bowman, SC \r\nGeology \r\n***Jennifer Ann Oblinger _____ Alpharetta, GA \r\n22 "
    },
    {
        "page_number": "31",
        "text": "Industrial Engineering \r\n!ctn Joscrh Albenesius Charlesron, SC Nathan Robert GloVl'r Newpurt News, VA \r\n*Mcghan Hunter Bell Charleston, SC RLxlrick O'Nl'<ll Littlejohn Gaffney, SC \r\n*Liam John Ctihalane Dorchester, MA *A;mm Josl'ph MichauJ Brunswick, ME \r\nSycJ Kcnib Camit Irmo, SC Michael Whitfo .. ·IJ Sawyer Luvamy, SC \r\n+***Sawh Alicl' Canterbury Moon Townshir, PA Mar'cc Smith Swansea, SC \r\nKatht:rine Eli:abcth Culberson Johnson City, TN John Patrick Snmrnar Burke, VA \r\nToJJ Stanton Davis Louisville, KY Walter Mclain Steele Winston1 Salem, NC \r\nThierry Decoud Buenos Aires, Argentina *Megan Patrice Stires Saline, Ml \r\nAlan Holbert Edwards, Jr. Conway, SC *Samuel ThaJdcus Strom Ill Union, SC \r\nAmanda Karen Elender Florence, SC Gregory Lamar Weaver, Jr. College Park, GA \r\nMathematical Sciences \r\n+*Katherine Victoria Chisholm Greenville, SC Jeremy James Lizza Anderson, SC \r\nVictoria Kmrina Garner Santee, SC **Stephen Ross Martin Thomasville, NC \r\n+***Jacob Monroe Hicks Floren,ce, SC Thomas Michael Raspet, Jr. Durham, NC \r\n**Sarah Michelle Karpel Mountville, SC *James Robert Stapleton Clemson, SC \r\n+***Megan Lee Koehler Greenville, SC +***Emily Marie Van Meter Greenville, SC \r\nRondell Allen Lee Columbia, SC Terri Hope Waters Asheville, NC \r\nMechanical Engineering \r\n+***Craig Alan Amick Gilbert, SC Laura Lee Lyons Annapolis, MD \r\nFarhan Aziz Dhahran, Saudi Arabia +***James Francis M<lck Fort Motte, SC \r\nDecker Michael Barnard Pineville, SC **Glenn Mark Mahony, Jr.. Duluth, GA \r\nDavid Lapsley Barron Merritt Island, FL *Brian Keith Manley Hickory Tavern, SC \r\n***Jesse David Black Bedford, VA *John Anthony Mart II Charleston, SC \r\nDavid Franklin Boyd Lancaster, SC +*Anthony Stuart Maxey Simpsonville, SC \r\nChristopher Harris Bridges Greenwood, SC *Christopher Dent McCartney Greenville, SC \r\nWilliam Davis Bryan Greenwood, SC Richard Francis McKee Woods Town, NJ \r\nDavid Michael Clarke Greenville, SC Andrew Jordan Miller Marietta, GA \r\n*John Baker Cleveland Ill Easley, SC **Keith Garrett Mills Aiken, SC \r\nDavid Keith Comer, Jr. Drayton, SC Christopher John Mitchell Gaffney, SC \r\nSeth Patrick Cook Easley, SC Scott Christopher Monsch Simpsonville, SC \r\n*Charles Edward Cwirka Rockland, MA +*Matthew Francis Motyka Aiken, SC \r\nCreston Lewis Dempsey Rose Hill, KS Brian Allen Mullins Seneca, SC \r\n+**Steven Charles Dinger Laurens, SC Christopher Steven Owens Blacksburg, SC \r\nJoshua Kane Ellenburg Liberty, SC Richard Alvin Parker Beaufort, SC \r\nShane Anthony Evans Greenwood, SC Matthew Clark Preslar Charlotte, NC \r\n*Brian William Fanner Hartsville, SC Zachary Allen Probst Charleston, SC \r\nRhonda Anne Fetner Dublin, GA Micah Benjamin Pryor Landrum, SC \r\nWilliam Joseph Flood Waukesha, WI Christopher Ian Rehrig Atlanta, GA \r\nWilliam Walden Foster, Jr. Seneca, SC Shari Necole Rice Leicester, NC \r\n*Kevin Austin Foy Aiken, SC David Dean Roberts Aiken, SC \r\nAnthony Score Franks Summerv ille, SC James Casey Rogers Easley, SC \r\n**Peyton Matthew Frick Chapin, SC Allen Edward Rolland, Jr. Gainesville, VA \r\n*Brady Blackbume Godbey Irmo, SC Anthony James Salvatore, Jr. Roswell, GA \r\nJeffrey Robert Gohean Chapin, SC Thomas Gregory Self Clover, SC \r\nGermaine La Troy Granc Mt Pleasant, SC Daniel Carlisle Skinner North Charleston, SC \r\n**Matthew O'Neil Greer Oak Ridge, TN Benjamin Andrew Smith Lexington, SC \r\nRichard Scou Hailey South Boston, VA Tristan David Smith Darlington, SC \r\nJames Vincent Hamilton Yuba City, CA Carlos Micheal Snyder Irmo, SC \r\nBrandon Francis Hargett Climax, NC Christopher R y<'ln Spivey Camden, SC \r\nTimothy Karl Haskell Zionsville, IN Irvine Richardson Spurlock, Jr. Wake, VA \r\nBrandon Lee Headrick Monroe, GA Christopher Aaron Stockton Daytona Beach, FL \r\nRandall Chad Henderson Laurinburg, NC *Jason Edward Thomas Spartanburg, SC \r\n+**Robert Louis Heuser II Pasadena, MD Daniel Gifford Toeppner Bethel Park, PA \r\nJonathan Michael Hill Seneca, SC Brandon Tirrell Tompkins McCormick, SC \r\nAlan Montgomery Hudson Lexington, SC *Amit Surendra Toprani Easley, SC \r\nDavid Roper Ingram Sumter, SC Matthew Jason Walker Powder Springs, GA \r\nStanley John Jablonski Townville, SC Gavin Memminger Wiggins Seneca, SC \r\nAshley Renee Landen Alpharetta, GA +***Macthew David Williams __ Batesburg-Leesville, SC \r\nWilliam Neal Ledgerwood Fountain Inn, SC Jesse Michael Wilson Charleston, SC \r\nRobert Neal Lewis Valdosta, GA Joshua David Wilson Anderson, SC \r\nJohn Wesley Lively Hendersonville, NC Mathew Adam Womack Greenville, SC \r\n*Tyler Nunn Lowe Clover, SC Robert Leroy Wood Ninety Six, SC \r\n+*Maureen Ellen Lynch Columbia, SC Benjamin Forton Zander Greenville, SC \r\nPhysics \r\nAllan Edward Anderscrom ____ Hilton Head Island, SC **Katherine O'Meara Freedman _____ Lexington, KY \r\n(Degree awarded posthumously) +***Meredith LeAnne Russell Evans, GA \r\nJustine Elizabeth Andrews Murrell's lnlec, SC +***William Robert Sams Anderson, SC \r\nDouglas Arthur Chappell Silver Spring, MD Christopher Andrew Turner Safety Harbor, FL \r\n*Benjamin Scott Conner Mauldin, SC Zachary Kenneth Vollrath Anderson, SC \r\nJudson Paul Dyar Seneca, SC +*Christopher Michael Wood Charleston, SC \r\nBradley Allen Edwards Ninety Six, SC \r\n23 "
    },
    {
        "page_number": "32",
        "text": "Polymer and T cxtilc Chemistry \r\n+***J•l.'>~)n An.Jn:w Curry------- Rt>ek Hill, SC +**Grady AlcxanJer Nunnery ______ Rock Hill, SC \r\n**Lisa Grah;Hn Fuller Greenville, SC Wi\\li;nn Chirk Reifsnider Florence, SC \r\nKnsl,1ntinos Michael Katsancvnkis Clrnrlcston, SC +**Eli:;1bcrh Ann Tucker Charleston, SC \r\nT cxtile Management \r\n*Sarah Eli:abcrh Vcsrnl East BenJ, NC \r\nCOLLEGE OF HEAL TH, EDUCATION, AND HUMAN DEVELOPMENT \r\nLAWRENCE ROBERT ALLEN, Dean \r\nBACHELOR OF ARTS \r\nEarly Childhood Education \r\n*Frances Brawley Barnes _________ Central, SC *Jennifer Hughes McElveen _______ Mauldin, SC \r\n**Alyson Nicole Basden Anderson, SC Kathleen LaBor<lc McLeod Greenville, SC \r\nKristen Elaine Bogan Lyman, SC ***Jennifer Mnrie Mescher Goose Creek, SC \r\n*Crystal Dawn Bryant Cowpens, SC **Kaja! D. Pare\\ Greenville, SC \r\nAndrea Dawn Carroll Potomac, MD *Sandra Michelle Pirkle North Augusta, SC \r\n+***Karhryn Marie Casey Annapolis, MD *Emily Shelton Puls Greenville, SC \r\n*Alicia Anne Coffman Seneca, SC Megan Frances Richardson Simpsonville, SC \r\n***Tracey Lynn Coley Clover, SC Casey Amanda Robinson Greenwood, SC \r\n*Jennifer Danielle Crawford Union, SC *Candace Renee Rogers Columbia, SC \r\n*Mary Elizabeth DeRose Charleston, SC *Heather Catherine Rogers Dillon, SC \r\n**Erin Elizabeth Dodd Simpsonville, SC *April Elizabeth Rushton Saluda, SC \r\nSarah Blair Donald Hilton Head Island, SC *Kimberly Michelle Satterfield Piedmont, SC \r\n***Marissa Megan Fann Columbia, SC Jaime Marlene Seitz Norcross, GA \r\n**Ashley Brooke Faulkner Lexington, SC *Autumn Michelle Shockley Columbia, SC \r\n***Hunter Leigh Feemster Greenville, SC *Stephanie Lorenc Thurston Greenwood, SC \r\nSarah Elizabeth Henry Columbia, SC Jami Lynn Walker Syracuse, NY \r\nMary Katherine Huff Chapin, SC *Merrill Elizabeth Weathers Bowman, SC \r\nErica Monique Jones Lexington, SC April Lynn Wilson Rock Hill, SC \r\n***Leanne Marie LeGodais LaGrange, GA \r\nElementary Education \r\nJennifer Rose Anderson _______ Mission Viejo, CA Jayme Lyn Mills ___________ Marietta, GA \r\n**Kelli Nicole Arms Duncan, SC **Brooke Avarene Moody Kingsport, TN \r\n***Kimberly Dillon Bolton Seneca, SC *Andrew Howell Morton Rock Hill, SC \r\n*Heather Leigh Bramlett Greenville, SC Megan Colleen Mulcahy Simpsonville, SC \r\n**Hope Madelyn Brown Greenville, SC *Lindsey Taylor Nesbitt Hollywood, SC \r\n+*Tiffany Renee Burgess Maggie Valley, NC *William Jason Osborne Turbeville, SC \r\n**Susan Jean Campbell Columbi<1, SC Hamilton Anthoney Parks Greer, SC \r\nJoshua William Christopher Summerville, SC *Jennifer M;:iureen Pendleron Fort Mill, SC \r\n*Erin Lee Daniel Greenville, SC **Ashley Dianne Pike Conyers, GA \r\n**Jenna Rena Dobbins Greer, SC Anna Blythe Plemmons Greenville, SC \r\nKatherine Elizabeth Foushee Charlotte, NC **Sarah Joy Poole Gilbert, SC \r\nAmanda Lynn Fraser WoO<lbridge, VA *Megan McKelvey Powell Chesnee, SC \r\nCrystal Lynn Graves Columbia, SC **Ashleigh Brooke Reedy Columbia, SC \r\nElizabeth Ball Harrison Anderson, SC Kalani Nicole Rolfe Berlin, MA \r\n*Kelly Elizabeth Hayworth Rock Hill, SC ***Marie Lenora Rostron West Union, SC \r\nSusan Bell Hill Atlanta, GA Michelle Nicole Rupert Roswell, GA \r\n+***Alice Marie Ingram Greer, SC *Melissa McKerrihan Stark Lake Elsinore, CA \r\n+***Mary Ellyn Jamieson Greenville, SC *Jessica Erin Sud<lerh Simpsonville, SC \r\n**Kathryn Kelly Johnson Fort Mill, SC *Stephanie Anne Tennent Lilburn, GA \r\nKrista Lynn Kalaidjian Huntersville, NC **Tiffany Smith Tucker Myrtle Beach, SC \r\n***Stacy Lyn Keesley Mauldin, SC *Tara Carrin VanPaccen Herndon, VA \r\n*Meredith Lee Kornahrens Hnm1han, SC James Ryan Way Manning, SC \r\nErica Ruch Krezdorn Greer, SC K.uhcrine Virg~nia Wharton Florence, SC \r\n*Lindsey Lauren Lollis Mauldin, SC *Maribeth Rae Wl.ite\"Si<l Indian Land, SC \r\nFallon Ashley Lore Anderson, SC *Nadine Jean Wightman Scottsdale, AZ \r\nSara Catherine Love Wyoming, DE *Ellen Virginia Williams Atlanta, GA \r\n*Kristen Nicole McFarland Clifton, VA **Cheryl Dianne Wright Lexington, SC \r\nErica Lee McQueen Charleston, SC *Ashley Tate Young Anderson, SC \r\n***Jessica Lauren Meek Columbia, SC +***Jessica Lin Zalewski Lexington, SC \r\nSusannah Rae Merrell Walhalla, SC *Lauren Michelle Zaring Rock Hill, SC \r\nSecondary Education \r\n*Christopher Stark Anfin _______ Rock Hill, SC **Andrew Taylor Hammond ______ Anderson, SC \r\nPhilisa Michelle Bennett Anderson, SC +**Bonnie Ann Howard Ridgefield, CT \r\nRyan Clark Charpia St George, SC *Keri Virginia Jackson Columbia, SC \r\n*Lindsay Denise Church Brentwood, TN +***Anne Reid Kessler Lawrenceville, GA \r\nMartha Adair Cody Union, SC Joshua Thomas Oxendine Central, SC \r\nChristine Lynn Cornelio Stafford, VA Emily Rebecca Reeves Simpsonville, SC \r\nMiriam LaRosa Edwards Carlisle, SC Jamie Scott Roszel Clemson, SC \r\n*Veronica Leigh Ficco Duluth, GA Heather Nicole Thomas Rock Hill, SC \r\nBctty Catherine Fisk Louisville. KY Tracy Hester Todd Easley, SC \r\n*Karen S. G;uchow Kennett Square, PA Frank Williams Weide Nashville, TN \r\n***Marjl.lrY M<-1rie Hamlin W;-1lhalla, SC \r\n24 "
    },
    {
        "page_number": "33",
        "text": "Special Education \r\nKeegan Wcbher Daniel _______ Sp<1wmburg, SC *Allison Marie Kitchens _______ Ornngcburg, SC \r\n*Cassan<lra Adams Dingess Senern, SC *Heather Ann Nichols Greenville, SC \r\nEmily Louise Edwmls Chapin, SC *Erin Lynn Richie Roswell, GA \r\n**April Dixon Hendricks Central, SC Lindsay Lynn Scott Fort Mill, SC \r\nHeather Harmon Huckabee West Columbia, SC *Brianne Marie Siciliano Columbia, SC \r\nK;1tie Meredith Johnson Alpharetta, GA \r\nDOUBLE MAJORS \r\nEnglish and Secondary Education \r\n*Erin Ruth Carne _________ Simpsonville, SC ***Natalie Ward Chandler ______ Simpsonville, SC \r\nHistory and Secondary Education \r\n**Michelle Lynn Crouse Simpsonville, SC \r\nMathematical Sciences and Secondary Education \r\n+***Kimberly Lynn Bowman _______ Fort Mill, SC *Stephanie Russell Whitt _______ Lake Wylie, SC \r\n**Angela Lynn Holder Greer, SC \r\nSecondary Education and Spanish \r\n***Amy Patricia Mitchell Gaffney, SC \r\nBACHELOR OF SCIENCE \r\nHealth Science \r\nTerri Brynn Abercrombie-------- Six Mile, SC Amanda Lynn Hodge __________ Seneca, SC \r\n*Jennifer Anne Armstrong Greenwood, SC Brandon Scott Holmes Woodruff, SC \r\nLindsay Dawn Benvenuto Norton, MA Stephanie Elizabeth Howell Fort Mill, SC \r\n**Heather Nicole Blackwell Lancaster, SC Victeka Monique Howell Douglasville, GA \r\nJordon Anderson Brees Greenville, SC *Ashley Dyan Jones Calhoun Falls, SC \r\nJared Matthew Burton Belmont, NC Brictani Lynn Lettrich Lower Burrell, PA \r\nMary Anne Carter Huntington, WV *Lindsey Ann Maurer Fort Mill, SC \r\n**Vicki Wing Yan Cheng Florence, SC Megan Elizabeth McNulty Cleveland, TN \r\n*Erin Renee Combs Columbia, SC *Amanda Irene Miklos Goose Creek, SC \r\nRachel Elizabeth Coulter Fountain Inn, SC Latcefah Aisha Mosley Columbia, SC \r\nElaine Michelle Crosby Greenville, SC Brandy Elizabeth Neely Marion, SC \r\n**Matthew Benjamin Crumpler Greenville, SC **Anna Grace Patccrson Greenwood, SC \r\nKathryn Eugenia Darley Summerville, SC Mario DeJuan Ramsey Pineville, SC \r\nHarriet Provence Gallivan Greenville, SC Thomas Alton Recd, Jr. Olney, MD \r\n+***Kristian Lee Gordon Fore Mill, SC *Holly Elizabeth Simpson Lancaster, SC \r\n*Jaime Alexis Gottfried Manasquan, NJ Rachel Frances Slagle Griffin, GA \r\n*Stephanie Eugena Graham Lexington, SC *Adrienne Louise Steifle Greenwood, SC \r\n***Kristin Marie Griffin Anderson, SC Manha Ptlu line Thomas St George, SC \r\nDaniel Edwin Higginbotham Irmo, SC Allison Elizabeth Traynor Jacksonville, FL \r\nKeisha Shevon Hightower Bath, SC Elizabech Lee Tucker Lexington, SC \r\nRobert Zachary Hines Greenville, SC Jason Christorhcr Urps Simpsonville, SC \r\n*Brittaine Mechelle Hinkson Aiken, SC Courtney Leigh Whitlow Hilton Head Island, SC \r\nRobert Derck Hitchcock Myrtle Beach, SC Kathleen Ruth Wood Greer, SC \r\nMathematics Teaching \r\nKevin Randal Burnette, Jr. ______ Potomac Falls, VA Ryan Alan Pamer __________ Lexington, SC \r\n+**Sherry Michele Hensley Inman, SC Austin Paul Shelley North Myrtle Beach, SC \r\nStephanie Sue Long Boiling Springs, SC \r\nNursing \r\nAnne Kalherine Abrams ________ Columbia, SC **Amy Lauren Hanna ________ Charleston, SC \r\n*Caroline Elizabeth Allen Florence, SC Amanda Noelle Keels Florence, SC \r\n+*Aman<la Mcf<'ld<len Arrants Ormond Beach, FL Sharic<l Shanay Kilgore Easley, SC \r\n*Bethany Gale B<tiley Mt Pleasant, SC Brictany Hester Langley Greenville, SC \r\nApril Lynnette Benoit Easley, SC Amanda Joy Long Aiken, SC \r\n*Amy Constance Bl<1ck Charleston, SC Latoya Shaneika Macon Columbia, SC \r\nKirsten Stoddard Borst Aiken, SC +**Stacia Elizabeth Mays Camden, SC \r\n**Erin Margaret Breeding Florence, SC Leslie Ann McCall Anderson, SC \r\n+*Lauren Nicole Bridges Manning, SC Marian Lorick McKenzie Columbia, SC \r\nCandice Olivia Bryant Pickens, SC *Misti Dawn Meador North Richland Hills, TX \r\n***Deborah Jacks Camak Greenwood, SC Amy Love Mignogna Medford, NJ \r\n+*Lindsey Brook Clendenin GrcenwcxxJ, SC **Lisa Taylor Moore Bowling Green, KY \r\nEmily Mousha Cox Woodruff, SC Katherine Diana Morgan Seneca, SC \r\nLauren Taylor Craft Anderson, SC C<1scy Lynn Morris Manning, SC \r\nSJ-umi4ua Jank:tha Dt1rby Hollywoo<l, SC ***Catherine Sikkema Murton Westminster, SC \r\nAlicia Nicholette D,wis Anderson, SC *Megan Adele Myers Seneca, SC \r\n*CanJicc Clarice DcMcrs Ornngeburg:, SC Allison Marie Nagle Orangeburg, SC \r\nJanet Marie Dixon Seneca, SC Kelli Ashley Nielson Charleston, SC \r\n*Beth Anne Ehlert Anderson, SC ***Kimberly Ann Owens Gray Court, SC \r\nChioma Uju E:cnckwe Greenville, SC Kristin Eliz<1bcth Page Lmdrum, SC \r\n***Andre;1 Jill Emning Orangeburg, SC *Sarnh Krisrin Paul Florence, SC \r\nChristine EL1inc Go1.::ncl Murrell's Inlet, SC +*Susan Arlene Poag Rock Hill, SC \r\nBcka Nicl)lc Hamlin Darlington, SC Erin Am;rno;,.h1 Pruitt Seneca, SC \r\n25 "
    },
    {
        "page_number": "34",
        "text": "Nursing (clmtinu1.:d) \r\nAnm1 Hendrix R;1ffoelk -------Charleston, SC +*Kelsey Jean Sweeney ________ Tallahassee, FL \r\nSheen,\\ Nicole Reid Callh)tJn Falls, SC Jan Lesli Tapp Travelers Rest, SC \r\n***Alison Maris;\\ Richter South HempsteJ, NY +**Chrisropher S. Taylor Lexington, SC \r\n***Melissa JoAnn Rogers Carmel, IN Jill Erin Templeton Blackville, SC \r\n*Rcbecc1 Marie Rostek Simpsonville, SC Lindsey Kay Thomas Dillon, SC \r\n***Tomck1 McDowell $;11nples Greenville, SC +**Racquel Elizabeth Vallicrl·s Iva, SC \r\nTifany Del' Si:emorc Simpsonville, SC *Allison Renee Waddell Lexington, SC \r\nFrances Louise Skipper Marion, SC Albertine White Rembert, SC \r\nJennifer Annette Smith Asheville, NC Jennifer Nina Wilkie Lexington, SC \r\nLauren Blake Smith Bamberg, SC Mere<lith Claire Wood North Augusta, SC \r\nKatrice Lynette Spurgeon Greenville, SC \r\nParks, Recreation, and Tourism Management \r\nBbkley Melissa Aldridge ________ Columbia, SC john Nigel Landreth lll ________ Greenville, SC \r\n***Emily Grace Andersen Rock Hill, SC Alonzo Seabrook Laroche, Jr. Charleston, SC \r\n*Christopher Derck Ayers Taylors, SC Amon Carroll Le Yett Charleston, SC \r\n*Rachel Marie Beckler Anderson, SC James Anthony Majeski, Jr. Mt Pleasant, SC \r\nNicholas Anthony Bolding Pickens, SC Amy Elizabeth McAlister Greenville, SC \r\nGabriel David Bradford Rockwood, TN Todd McClinton Columbia, SC \r\n*Jessica Blair Buchanan Anderson, SC Michael James McGarry, Jr. Simpsonville, SC \r\nJames Mich<lel Coleman Newberry, SC Corey Vincenc McWethy Summerville, SC \r\nBrent Martin Delahoussaye Greenville, SC Reah Pacrice Nicholson Charlotte, NC \r\n*Jessica Somantha Dey Manasquan, NJ **Abby Jo Perrotta Sumter, SC \r\nJack McKewen Ferguson Seneca, SC David Bradley Robinson Florence, SC \r\nKristen Nicole Frizzell North Augusta, SC Toby John Roper Easley, SC \r\nMichael Doyle Gilbert Columbia, SC Jessica Brooke Saad Pickens, SC \r\nLarry Griffin, Jr. Greenville, SC Kasi Lauren Sacterwhicc Columbia, SC \r\nSterling Eugene Hapner Burke, VA Mary Allen Corbett Schuster Nashville, TN \r\nAllison Katherine Hartnett Spartanburg, SC Mills Dixon Scoggins, Jr. Columbia, SC \r\nRobert Wesley Hayes Ill Rock Hill, SC **Kevin Stanley Smuniewski Charleston, SC \r\nBrenc Warren Hitchcock The Woodlands, TX ***Anne Cathleen Stanton Millersville, MD \r\nAmanda Elizabeth Hoffman Greer, SC Andy Nickles Starnes Duncan, SC \r\nAndrew Hodges Johnson Columbia, SC john Michael Stevens Clemson, SC \r\nMorgan Rae Jones Greer, SC Lucy Green Swaffield Lexington, SC \r\nCassandra Marie Kennedy Clinton, SC James Russell Watkins, Jr. Murrell's Inlet, SC \r\n**Brett Lee Kerce Greenville, SC Sarah B. Woolard Orange Park, FL \r\nScience Teaching \r\nCecelia Tankersley Baggott _______ Whitmire, SC +*Christopher Eric Raynolds ______ Kingsport, TN \r\nRhett Jefferson Hutchins Columbia, SC **Kristy Marie Seigfried Shickshinny, PA \r\nMeri Johnson Kohl Central, SC \r\nTechnology and Human Resource Development \r\nRebecca Susan Apgar ________ Simpsonville, SC Michael Timothy Means ________ Jonesville, SC \r\n***Justin Bruce Banks Pickens, SC Thomas An<lrew Morris Boykin, SC \r\n*Ashley Marie Bumgardner Lancaster, SC Ashley Kaye Neal Easley, SC \r\nJohn Rhode Callaway Boiling Springs, SC Benjamin Earl Sears Aiken, SC \r\n*Haley Suzanne Drake Anderson, SC *Seth Nathaniel Shirley Honea Path, SC \r\n**Jerry Dean Garrison, Jr. Mouncain Rest, SC *Alekzandr Mikhail Tesolowski Seneca, SC \r\nLeanne Alexandria Hiott Anderson, SC \r\n*Cum laude: A grade poiru rntio of 3.40 to 3.69 \r\n••Magna cum laude: A grade point ratio of 3.70 to J.89 \r\n•••Summa cum laude: A grade point mrio of 3.90 to 4.00 \r\n+Calhlltm Honors College: The gradua1es so designated in the printed graduation program have completed an enriched program of study through the Calhoun Honors \r\nCollege. To earn this distinction, students must maintain an 11Vcrall grade-point ratio of J.40 or higher and comple1e the req_uirements of General Honors and/or \r\nDepartmental Honors. Students who have earned Departmental Honors appear in the line of march wearing the Calhoun Honors College Medallion on an orange \r\nand purple ribhon. This medallion is made possible hy an endowment estahlished hy Mrs. Ka[herine lnahinet Vickery of Columhia, South Carolina, to honor rhe \r\nmemory uf her husband and Clemson graduate, the late B. C. Inabinet. \r\nStudents we;iring the white stoles over their gowns are graduating with a 3.00 or better gm.de-point average. Those who :ire members of University recognized \r\nhonorary 5(x:ieties may have the names of those societies emhroidered on nne side of the stole with the University ~al embroidered on the nrher side. \r\n26 "
    },
    {
        "page_number": "35",
        "text": "Awards \r\nNORRIS MEDAL \r\nFirsr awarded at C lemson U niversity in 1908, the Norris Medal was established under the terms of rhe will of the \r\nHonorable D. K. Norris, a life rru~tec of this institution. T he medal is given each year to the graduating student who , \r\non the basis of exceptional scholastic achievement and leadership ability, is judged by the University Scholarships and \r\nAw~uds Committee to be the best all-around student. \r\nAll recipients of the Norris Medal have their names affixed to a bronze plaque mounted at the front entrance of \r\nSikes Hall. \r\nRECIPIENT OF THE NORRIS MEDAL \r\nTRAV IS WILSON CROOK \r\nKingwood, TX \r\nALGERNON SYDNEY SULLIVAN AWARD \r\nThe Sullivan Award is given annually to individuals who possess the characteristics of hearc, mind, and conduct as \r\nevince a spirit of love for and helpfulness to other men and women. These humanitarian qualities arc cxhibiccd in the \r\nfollowing recipients. \r\nRECIPIENT OF THE ALGERNON SYDNEY SULLIVAN CITIZEN AWARD \r\nMR. LAURIE C. LAWSON \r\nDarlington, SC \r\nRECIPIENTS OF THE ALGERNON SYDNEY SULLIVAN STUDENT AWARD \r\nSTEPHANIE LYNN KERR \r\nColumbia, SC \r\nMATTHEW DAVID WILLIAMS \r\nBatesburg-Leesville , SC \r\nALUMNI MASTER TEACHER AWARD \r\nThis award is presenced by the C lemson Alumni Association for distinguished achievements in classroom teaching. \r\nThe faculty recipient is selected by the Student A lumni Council from nominations submitted by scudents. A bronze \r\nplaque is presented permanently to the recipient and the award carries with it a stipend of twenty-five hundred dollars. \r\nRECIPIENT OF THE ALUMNI MASTER TEACHER AWARD \r\nUMIT YILMAZ \r\nFACULTY SCHOLARSHIP AWARD \r\nEstablished at C lemson University in 1959, this award is made annually by the faculty of C lemson University to the \r\nmember of the graduating class who has the highest scholastic achievement. All gradua tes who have compleced the \r\nrequirements for the bachelor's degree since the last commencement exercise and who have completed at Clemson at \r\nleast 75 percent of the work required for graduation shall be eligible for consideration. \r\nDARREN EDWIN AIKEN \r\nLoris . SC \r\nMEREDITH STILWELL AMICK \r\nGilbert, SC \r\nMOLLY CATHERINE BALL \r\nCharleston, SC \r\nSHELLEY SUZANNE BARRETT \r\nNewnan, GA \r\nRICHARD CHARLES BEAULIEU \r\nMassena, NY \r\nTRAVIS WILSON CROOK \r\nKingwnod, T X \r\nJASON ANDREW CURRY \r\nRock Hill, SC \r\nJOHN RANDOLPH DABNEY, JR. \r\nGreer, SC \r\nMARISSA MEGAN FANN \r\nColumbia, SC \r\nHUNTER LEIGH FEEMSTER \r\nGreenville, SC \r\nMEGAN ALICIA GAJEWSKI \r\nMyrtie Be;ich, SC \r\nMEGAN JOANNA GOOCH \r\nSimpsonville, SC \r\nMARK WILSON GRAMLING \r\nlrm11, SC \r\nRECIPIENTS OF THE FACULTY SCHOLARSHIP AWARD \r\nJONATIIAN MITCHELL GROOM \r\nTaylors, SC \r\nTHOMAS WILLIAM GROOMS \r\nAiken, SC \r\nERIN LYNN GROSS \r\nLex1ngcon, SC \r\nMARY ELLYN JAMIESON \r\nG reenville, SC \r\nALEXIS ANNE KAYLOR \r\nMt Pleasant, SC \r\nJESSICA MARIE KEATON \r\nAnderson, SC \r\nMEGAN LEE KOEIILER \r\nGreenville, SC \r\nELYN AIMEE MCBRIDE \r\nFindlay, OH \r\nKATIE ELIZABETH MCREE \r\nAlpharetta, GA \r\nJENNIFER MARIE MESCHER \r\nGoose Creek, SC \r\nMICHAEL ANDREW MURPHY \r\nGreenville, SC \r\nJENNIFER ANN OBLINGER \r\nAlphare1ta, GA \r\nALANA ANNE PA VUK \r\nNew Bern, NC \r\nASHLEY DANIELLE PRICE \r\nLake View, SC \r\nMEGAN MARTHA REED \r\nGreer, SC \r\nELIZABETH JUANITA L RHUE \r\nGeorgetown, SC \r\nCLAIRE MCCALL ROOF \r\nLexington, SC \r\nCATHERINE DIANE RUNION \r\nSimpsonville, SC \r\nLAURA ANN SINGER \r\nWheeling, WV \r\nKIMBERLY MARIKO TANAKA \r\nLas Vegas, NV \r\nVIJA Y NA YAK ULLAL \r\nMr Pleasant, SC \r\nMATTHEW DAVID WILLIAMS \r\nBatcshurg-Lcesville, SC \r\nCATHERINE N. WOOD \r\nCincinnati, OH \r\nLAUREN HOLLEMAN YARROW \r\nCentral, SC "
    },
    {
        "page_number": "36",
        "text": "Historical Statement \r\nClemson University is named for Thomas Green Clemson (1807-1888), who left \r\nthe bulk of his estate to the State of South Carolina for the founding of the \r\ninstitution. \r\nThomas Clemson was born in Philadelphia in 1807 and educated at the Royal \r\nSchool of Mines in Paris (1828-1832). His early profession was that of a mining \r\nengineer; however, circumstances diverted his interests into politics and the life of \r\na southern planter, and he soon became an enthusiastic advocate of scientific \r\nagriculture. He had a career as a diplomat (charge d'affaires to Belgium, \r\n1844-1852) and served as the first Superintendent of Agricultural Affairs in \r\nWashington (1860). As a scientist he published numerous articles in the fields of \r\nmining, chemistry and agriculture. His varied activities included his assistance in \r\nthe founding of the Maryland Agricultural College, his support of the Morrill Act, \r\nhis leadership in South Carolina after the Civil War, and his part in founding \r\nClemson University. \r\nThomas Clemson was the son-in-law of South Carolina's John C. Calhoun, a \r\npolitical figure of national importance during the first half of the nineteenth \r\ncentury. Mr. Calhoun's home, Fort Hill, is preserved on the Clemson Campus as a \r\nnational shrine. \r\nThe academic program at Clemson College began in 1893 with an enrollment \r\nof 446. The first \"college prospectus\" announced only two four-year curricula, \r\nsupplemented by two two-year preparatory courses. Today the University has six \r\nmajor academic units. These are the College of Agriculture, Forestry, and Life \r\nSciences, the College of Architecture, Arts, and Humanities, the College of \r\nBusiness and Behavioral Science, the College of Engineering and Science, the \r\nCollege of Health, Education, and Human Development, and the Graduate \r\nSchool. \r\nClemson University is accredited by the Commission on Colleges of the \r\nSouthern Association of Colleges and Schools (1866 Southern Lane, Decatur, \r\nGeorgia 30033-4097; telephone number 404-679-4501) to award the Bachelor's, \r\nMaster's, Education Specialist, and Doctor's degrees. Various curricula are \r\naccredited by the AACSB International (Association to Advance Collegiate \r\nSchools of Business), Accreditation Board for Engineering and Technology, \r\nAmerican Council for Construction Education, American Society of Landscape \r\nArchitects, Computing Science Accreditation Board, National Architectural \r\nAccrediting Board, National Association of Industrial Technology, National \r\nAssociation of Schools of Art and Design, National Council for Accreditation of \r\nTeacher Education, National League for Nursing, NRPA/AALR Council on \r\nAccreditation, Planning Accreditation Board, and Society of American Foresters. \r\nClemson is a land-grant institution. As such, it is engaged not only in its \r\nprimary academic program, but does extensive research at the main campus and at \r\nfive agricultural experiment stations located in the State. The University is also \r\nheavily committed to a varied program of public service, including the work of \r\nagricultural extension which has professional personnel located in each of the \r\nState's counties. "
    },
    {
        "page_number": "37",
        "text": "CLEMSON ALMA MATER \r\nFarmer and McGarity/arr. Freeman \r\nWhere the Blue Ridge yawns its greatness, \r\nWhere the Tigers play; \r\nHere the sons of dear old Clemson \r\nReign supreme alway. \r\nChorus \r\nDear old Clemson, we will triumph \r\nAnd with all our might, \r\nThat the Tiger's roar may echo \r\nO'er the mountain height. \r\nWe will dream of greater conquests, \r\nFor our past is grand, \r\nAnd her sons have fought and conquered \r\nEvery foreign land. \r\nWhere the mountains smile in grandeur \r\nO'er the hill and dale. \r\nHere the Tiger lair is nestling \r\nSwept by storm and gale. \r\nWe are brothers strong in manhood, \r\nFor we work and strive; \r\nAnd our alma mater reigneth \r\nEver in our lives. "
    },
    {
        "page_number": "38",
        "text": "Candidates appearing in this program are not certified graduates. Likewise, academic \r\nhonors designations are based upon performance prior to final grades. Both certification of \r\ngraduation and honors designations must come from the Registrar of the University. \r\n********** \r\nFirst Aid-A First Aid Station is located at the North entrance. \r\nEvacuation System-Littlejohn Coliseum is equipped with a fire alarm evacuation system. \r\nIn the event of activation, as noted by sustained horns and strobe lights, please proceed to \r\nthe closest available exit. Remain outside the building until fire officials deem the building \r\nsafe to re-enter. \r\nNo Smoking-Smoking is prohibited in Littlejohn Coliseum. "
    }
]